[
	[
		"2022-07-18",
		"U.S. Senator Dan Sullivan (R-Alaska), and four other senators sent a letter to Defense Secretary Lloyd Austin and Chairman of the Joint Chiefs of Staff General Mark Milley, asking them to immediately expedite shipments of military equipment to Ukraine as appropriated by Congress under the Additional Ukraine Supplemental Appropriations Act. Passed on May 19, Equipment recommended for immediate delivery includes medium- and long-range air defense systems, 155 mm howitzers, High Mobility Artillery Rocket Systems (HIMARS), armored personnel carriers, larger and more capable unmanned aircraft systems (UAS), and Mi-17 helicopters. The senators also urged the defense leaders to consider recommending the inclusion of fourth-generation fighter aircraft, along with funding for the necessary flight training in future military aid packages",
		"Сенатор США Ден Салліван (республіканець від Аляски) та чотири інших сенатори надіслали листа Міністру оборони Ллойду Остіну та голові Об’єднаного комітету начальників штабів генералу Марку Міллі з проханням негайно прискорити поставки військового обладнання в Україну, як це передбачено Конгресом, а саме Законом про додаткові асигнування Україні. 19 травня було затверджено перелік обладнання, що рекомендоване для негайної поставки, і включає системи протиповітряної оборони середньої та великої дальності, 155-мм гаубиці, реактивні системи залпового вогню (HIMARS), бронетранспортери, більші та потужніші безпілотні авіаційні системи та гелікоптери Мі-17. Сенатори також закликали лідерів оборони розглянути рекомендацію, щодо включення винищувачів четвертого покоління разом із фінансуванням необхідної льотної підготовки до наступних пакетів військової допомоги",
		"https://www.sullivan.senate.gov/newsroom/press-releases/sullivan-fellow-senators-ask-defense-department-to-expedite-critical-military-aid-to-ukraine"
	],
	[
		"2022-07-20",
		"Western countries could provide the Ukrainian air force with jets and pilot training, the U.S. Air Force’s chief of staff said, but military officials say no firm decisions have been made yet",
		"Західні країни могли б надати українським ВПС реактивні літаки та навчати пілотів, заявив начальник штабу ВПС США, але військові чиновники кажуть, що твердих рішень ще немає",
		"https://www.forbes.com/sites/joewalsh/2022/07/20/us-air-force-general-says-west-may-send-jets-to-ukraine-after-all/?sh=763d27e170c2"
	],
	[
		"2022-07-21",
		"Ben Wallace (UK secretary of defence)  reveals latest British military support for Ukraine, including plans to send 50,000 artillery shells and hundreds more anti-tank weapons in the coming weeks.",
		"Бен Уоллес (міністр оборони Великої Британії) оприлюднив останню британську військову підтримку Україні, включаючи плани відправити 50 000 артилерійських снарядів і сотні протитанкових гармат протягом найближчих тижнів.",
		"https://www.gov.uk/government/news/uk-to-send-scores-of-artillery-guns-and-hundreds-of-drones-to-ukraine"
	],
	[
		"2022-07-24",
		"U.S. Ambassador To Ukraine Says Washington Will Support Kyiv 'For As Long As It Takes'",
		"Посол США в Україні заявив, що Вашингтон підтримуватиме Київ \"стільки, скільки буде потрібно\"",
		"https://www.rferl.org/a/ukraine-us-ambassador-brink-support-kyiv/31957319.html"
	],
	[
		"2022-07-25",
		"Польские боевые танки PT-91 Twardy прибыли в Украину, подтвердил глава Офиса Президента Украины.",
		"Польські бойові танки PT-91 Twardy прибули до України, підтвердив голова Офісу Президента України.",
		"https://tvpworld.com/61471733/polish-main-battle-tanks-arrive-in-ukraine"
	],
	[
		"2022-07-25",
		"The Defense Department has announced another package of security assistance for Ukraine, which will include additional High Mobility Artillery Rocket Systems, ammunition and a substantial number of Phoenix Ghost unmanned aerial systems",
		"Міністерство оборони США оголосило про черговий пакет допомоги Україні у сфері безпеки, який включатиме додаткові ракетно-артилерійські системи високої мобільності, боєприпаси та значну кількість безпілотних літальних комплексів Phoenix Ghost.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3103655/more-himars-phoenix-ghost-drones-bound-for-ukraine/"
	],
	[
		"2022-07-26",
		"The longer the Biden administration continues delaying and stinting its support for Ukraine without enabling Kyiv to halt and reverse Russia’s invasion, the more precarious both Ukraine’s and Taiwan’s positions become. ",
		"Чим довше адміністрація Байдена продовжує зволікати та обмежувати свою підтримку України, не дозволяючи Києву зупинити та повернути вторгнення Росії, тим нестабільнішими стають позиції як України, так і Тайваню.",
		"https://thehill.com/opinion/international/3573439-ukraines-lessons-for-taiwan-grow-more-ominous/"
	],
	[
		"2022-07-26",
		"Slovakia is edging closer to a decision on the delivery of its fleet of MiG-29 fighter jets to Ukraine, but no deal has been finalised yet",
		"Словаччина наближається до рішення про поставку Україні свого парку винищувачів МіГ-29, але угода ще не завершена.",
		"https://kafkadesk.org/2022/07/26/no-deal-yet-on-slovakias-delivery-of-mig-29s-to-ukraine/?utm_source=rss&utm_medium=rss&utm_campaign=no-deal-yet-on-slovakias-delivery-of-mig-29s-to-ukraine"
	],
	[
		"2022-07-26",
		"Some Republicans say President Joe Biden is doing too much to help Ukraine, sending massive amounts of money and weapons with no plan for how the war ends while ignoring trouble back home. Others in the Trump wing of the party, however, argued this week that Biden is acting too slowly. He is giving the Ukrainian troops just enough to prolong the conflict and prevent defeat, they say, when he should be sending even more weapons to score a decisive victory over Russia.",
		"Деякі республіканці кажуть, що президент Джо Байден робить занадто багато, щоб допомогти Україні, надсилаючи величезні суми грошей і зброї, не плануючи, як закінчиться війна, ігноруючи проблеми вдома. Однак інші представники крила Трампа цього тижня стверджували, що Байден діє надто повільно. Він дає українським військам рівно стільки, щоб продовжити конфлікт і запобігти поразці, мовляв, тоді як він мав би надсилати ще більше зброї, щоб здобути вирішальну перемогу над Росією.",
		"https://www.defenseone.com/policy/2022/07/biden-arming-ukraine-play-tie-some-america-first-gopers-say/374977/"
	],
	[
		"2022-07-26",
		"On Monday, Ukraine received its first Gepard anti-aircraft tanks from Germany. “Today, the first three Gepards officially arrived,” Defence Minister Olexiy Resnikov announced on Ukrainian television. In addition, he said, tens of thousands of rounds of ammunition had also been handed over. A total of 15 Gepards were expected to arrive, Resnikov added.",
		"У понеділок Україна отримала від Німеччини перші зенітні танки Gepard. «Сьогодні офіційно прибули перші три Гепарди», – повідомив міністр оборони Олексій Ресніков в ефірі українського телебачення. Крім того, за його словами, також було передано десятки тисяч патронів. Всього очікується прибуття 15 Гепардів, додав Резніков.",
		"https://www.wsws.org/en/articles/2022/07/26/pust-j26.html"
	],
	[
		"2022-07-27",
		"Slovakia might donate its MiG-29 fighter jets to Ukraine, defence minister says",
		"Словаччина може передати Україні свої винищувачі МіГ-29, заявив міністр оборони",
		"https://www.euronews.com/2022/07/25/ukraine-war-what-you-need-to-know-about-the-conflict-this-monday"
	],
	[
		"2022-07-27",
		"Republican lawmakers are worried that Indiana Representative Victoria Spartz might be taking it one step too far when it comes to her criticism of the situation in her native Ukraine. Her criticism is aimed at what she sees as a lack of effort in using American aid to fight invading Russian forces.",
		"Законодавці-республіканці стурбовані тим, що конгресмен від Індіани Вікторія Спартц може зайти занадто далеко, коли справа доходить до її критики ситуації в її рідній Україні. Її критика спрямована на те, що вона вважає браком зусиль у використанні американської допомоги для боротьби з російськими військами.",
		"https://www.953mnc.com/2022/07/27/indiana-rep-victoria-spartz-criticizes-situation-in-ukraine/"
	],
	[
		"2022-07-27",
		"Germany has approved sales of 100 self-propelled artillery systems PzH 2000",
		"Німеччина схвалила продаж 100 самохідних артилерійських систем PzH 2000",
		"https://www.spiegel.de/politik/deutschland/ukraine-darf-100-panzerhaubitzen-kaufen-a-6e1c331d-0da2-4218-9653-2ee96560da9d"
	],
	[
		"2022-07-27",
		"A little-known group at U.S. European Command in Germany fills Ukraine’s battlefield requests with donations from more than 40 countries.",
		"Маловідома група Європейського командування США в Німеччині заповнює запити України на полі бою пожертвами з понад 40 країн.",
		"https://www.nytimes.com/2022/07/27/us/politics/ukraine-weapons-center.html"
	],
	[
		"2022-07-27",
		"11 tanks were seized from residents of the Poltava region",
		"У жителів Полтавського регіону вилучено 11 танків",
		"https://ukranews.com/en/news/872001-law-enforcers-seize-11-tanks-from-residents-in-poltava-region"
	],
	[
		"2022-07-27",
		"Azerbaijan had secretly supplied Ukraine with dozens of precision-guided bombs, documents leaked by the Iraqi Sabereen News Telegram channel on July 27 revealed.",
		"Азербайджан таємно постачав Україні десятки високоточних бомб, свідчать документи, оприлюднені 27 липня іракським телеграм-каналом Sabereen News.",
		"https://southfront.org/azerbaijan-supplied-ukraine-with-dozens-of-precision-guided-bombs-in-secret/"
	],
	[
		"2022-07-28",
		"Chancellor Scholz is under constant pressure from the opposition because of the failure to fulfill his promise to supply heavy weapons to Ukraine. Poland directly accused Germany of disrupting supplies.",
		"Канцлер Шольц перебуває під постійним тиском з боку опозиції через невиконання обіцянки постачати Україні важке озброєння. Польща прямо звинуватила Німеччину в зриві поставок.",
		"https://www.politico.eu/article/germany-olalf-scholz-pressure-tank-deliveries-ukraine/"
	],
	[
		"2022-07-28",
		" In the coming days, the Government of Slovenia will discuss a new package of security assistance to Ukraine.",
		"Найближчими днями уряд Словенії обговорить новий пакет безпекової допомоги Україні.",
		"https://www.ukrinform.net/rubric-polytics/3538011-government-of-slovenia-to-discuss-new-security-assistance-package-to-ukraine.html"
	],
	[
		"2022-07-28",
		"Both Democrats and Republicans raised the issue of transferring ATACMS long-range ballistic missiles to Ukraine again.",
		"І демократи, і республіканці піднімали питання передачі Україні балістичних ракет великої дальності ATACMS",
		"https://en.defence-ua.com/events/the_us_congress_declares_the_need_to_transfer_atacms_to_ukraine_democrats_and_republicans_support_the_decision-3699.html"
	],
	[
		"2022-07-28",
		"Bulgaria Supplies Shells For Ukraine’s 100mm MT-12 Rapira Anti-Tank Guns",
		"Болгарія постачає Україні снаряди для 100-мм протитанкових гармат МТ-12 «Рапіра»",
		"https://en.defence-ua.com/weapon_and_tech/bulgaria_supplies_shells_for_ukraines_100mm_mt_12_rapira_anti_tank_guns-3698.html"
	],
	[
		"2022-07-29",
		"The Defense Ministry of Macedonia confirmed on July 28 that a column of Macedonian tanks was heading towards Ukraine.",
		"У Міноборони Македонії 28 липня підтвердили, що колона македонських танків прямує в бік України.",
		"https://news.yahoo.com/north-macedonia-sending-t-72-150700481.html?fr=sycsrp_catchall"
	],
	[
		"2022-07-29",
		"Germany's Federal Minister of Defense Christine Lambrecht announced the decision to deliver a package of 16 BIBER armored bridge-laying vehicles to Ukraine, with the first shipment of six vehicles to begin in the fall. The other ten will follow in 2023.",
		"Федеральний міністр оборони Німеччини Крістін Ламбрехт повідомила про рішення доставити в Україну пакет з 16 броньованих мостоукладальних машин BIBER, перша поставка з шести машин почнеться восени. Інші десять з’являться у 2023 році.",
		"https://www.newsweek.com/biber-tanks-ukraine-western-weapons-1729233"
	],
	[
		"2022-07-29",
		"Norway has donated 14 armored patrol vehicles to Ukraine",
		"Норвегія передала Україні 14 патрульних броньованих машин",
		"https://norwaytoday.info/news/norway-has-donated-14-armored-patrol-vehicles-to-ukraine/"
	],
	[
		"2022-07-30",
		"Western arms supplies to Ukraine only dragging out conflict, Lavrov tells Blinken",
		"Поставки західної зброї в Україну лише затягують конфлікт, каже Лавров Блінкену",
		"https://www.panorama.am/en/news/2022/07/30/Lavrov-Blinken/2713263"
	],
	[
		"2022-07-30",
		"John Kirby, the National Security Council Coordinator for Strategic Communications, announced new military package. “I fully expect that and I think you're going to see another one [military aid package] relatively soon,” Kirby said. The White House representative said he would not specify any dates now, however, according to him, another statement on the security assistance support for Ukraine would be announced 'very soon.'",
		"Про новий військовий пакет повідомив координатор Ради національної безпеки зі стратегічних комунікацій Джон Кірбі. «Я цілком цього очікую, і я думаю, що відносно скоро ви побачите ще один [пакет військової допомоги]», — сказав Кірбі. Представник Білого дому зазначив, що зараз не буде вказувати дати, однак, за його словами, \"дуже скоро\" буде оголошено ще одну заяву щодо підтримки безпекової допомоги Україні.",
		"https://menafn.com/1104616773/US-To-Announce-Another-Military-Aid-Package-For-Ukraine-Very-Soon-White-House"
	],
	[
		"2022-07-30",
		"US already procuring NASAMS air defense systems for Ukraine, says Pentagon, but delivery date unknown. The U.S. Department of Defense said the allocation of the military aid to Ukraine, the 14th package worth $820 million, would include NASAMS air defense systems.",
		"За словами Пентагону, США вже закуповують системи ППО NASAMS для України, але дата доставки невідома. Міністерство оборони США повідомило, що виділення Україні військової допомоги, 14-й пакет на суму 820 мільйонів доларів, включатиме системи ППО NASAMS.",
		"https://news.yahoo.com/us-already-procuring-nasams-air-144400982.html"
	],
	[
		"2022-08-01",
		"Britain will hand over several warships from its fleet to Ukraine in near future - Ambassador Prystayko",
		"Британія найближчим часом передасть Україні кілька військових кораблів зі свого флоту, - посол Пристайко",
		"https://censor.net/en/news/3357726/britain_will_hand_over_several_warships_from_its_fleet_to_ukraine_in_near_future_ambassador_prystayko"
	],
	[
		"2022-08-01",
		"MLRS MARS II missiles arrived from Germany to Ukraine's front ",
		"З Німеччини на український фронт прибули ракети РСЗВ MARS II",
		"https://www.newsweek.com/mars-ii-missiles-join-ukraines-western-arsenal-1729740"
	],
	[
		"2022-08-01",
		"US officials announced another $550 million in military aid will be sent to Ukraine, including 75,000 rounds of 155mm artillery ammunition and additional ammunition for High Mobility Artillery Rocket Systems (HIMARS). ",
		"Офіційні особи США оголосили, що Україні буде надіслано ще 550 мільйонів доларів військової допомоги, включаючи 75 000 артилерійських боєприпасів калібру 155 мм і додаткові боєприпаси для високомобільних артилерійських ракетних систем (HIMARS).",
		"US sending $550 million in military aid to Ukraine, including HIMARS ammunition | Fox News"
	],
	[
		"2022-08-02",
		"Minister of Defense of Spain, Margarita Robles, announced that the government cannot send its Leopard 2A4 tanks to Ukraine",
		"Міністр оборони Іспанії Маргарита Роблес заявила, що уряд не може відправити в Україну свої танки Leopard 2A4.",
		"https://www.eurointegration.com.ua/eng/news/2022/08/2/7144289/"
	],
	[
		"2022-08-04",
		"Russia is working to fake evidence to claim Western rockets destroyed a jail housing Ukrainian prisoners of war, Washington warned yesterday. US intelligence officials say Russia wants it to appear that Ukrainian forces were responsible for the July 29 attack on Olenivka prison that left 53 dead.",
		"Росія працює над підробкою доказів, щоб стверджувати, що західні ракети знищили в'язницю, де містилися українські військовополонені, попередив учора Вашингтон. Співробітники американської розвідки кажуть, що Росія хоче показати, що українські сили відповідальні за напад на Оленівську в'язницю 29 липня, у результаті якого загинули 53 людини.",
		"https://www.dailymail.co.uk/news/article-11082887/Russia-plant-evidence-blaming-West-Ukrainian-prison-camp-rocket-blast-officials-fear.html"
	],
	[
		"2022-08-04",
		"Defence Ministry of North Makedonia neither confirms nor denies media reports that the country has donated its four Sukhoi Su-25 ground attack jets to Ukraine.",
		"Міністерство оборони Північної Македонії не підтверджує і не спростовує повідомлення ЗМІ про те, що країна передала Україні свої чотири штурмовики Су-25.",
		"https://balkaninsight.com/2022/08/04/north-macedonia-maintains-silence-over-jet-donation-to-ukraine/"
	],
	[
		"2022-08-04",
		"Canada is resuming Operation Unifier - up to 225 Canadian troops have been sent to the UK to train the Ukrainian military.",
		"Канада відновлює операцію «Unifier» – до Великої Британії направлено до 225 канадських військових для навчання українських військових.",
		"https://www.canada.ca/en/department-national-defence/news/2022/08/defence-minister-anita-anand-announces-deployment-of-canadian-armed-forces-to-train-ukrainian-soldiers-in-the-united-kingdom.html"
	],
	[
		"2022-08-05",
		"The Biden administration's next security assistance package for Ukraine is expected to be $1 billion, one of the largest so far, and include munitions for long-range weapons and armored medical transport vehicles, three sources briefed on the matter told Reuters on Friday.",
		"Очікується, що наступний пакет допомоги адміністрації Байдена в галузі безпеки для України становитиме 1 мільярд доларів, один із найбільших на сьогодні, і включатиме боєприпаси для зброї далекого радіусу дії та броньованих медичних транспортних засобів, повідомили Reuters у п’ятницю три джерела, поінформовані про це питання.",
		"https://www.reuters.com/world/europe/exclusive-us-readies-new-1-billion-ukraine-weapons-package-2022-08-05/"
	],
	[
		"2022-08-06",
		"The Swedish Defense Ministry announced Sunday that beginning August 12, it will send up to 120 instructors to the UK to conduct basic military training for Ukrainian citizens",
		"Міністерство оборони Швеції оголосило в неділю, що з 12 серпня відправить до Великобританії до 120 інструкторів для проведення базової військової підготовки громадян України.",
		"https://government.se/press-releases/2022/08/sweden-to-train-ukrainian-soldiers-in-uk/"
	],
	[
		"2022-08-07",
		"Under Secretary of Defense Colin Kahl: \"In recent packages for Ukraine we've included a number of anti-radiation missiles that can be fired off Ukrainian aircraft. \"",
		"Заступник міністра оборони Колін Кал: «В останні пакети для України ми включили низку протилокаційних ракет, які можуть бути випущені з українських літаків».",
		"https://www.thedrive.com/the-war-zone/u-s-confirms-air-launched-anti-radiation-missiles-sent-to-ukraine"
	],
	[
		"2022-08-09",
		"The Finnish Defence Forces will send about 20 service members to Britain to assist in training volunteer members of the Ukrainian Armed Forces",
		"Сили оборони Фінляндії (FDF) відправить близько 20 військовослужбовців до Британії для допомоги у підготовці добровольців Збройних сил України",
		"https://yle.fi/news/3-12569098"
	],
	[
		"2022-08-09",
		"The Biden administration will provide $89 million to help Kyiv clear land mines that now litter huge swaths of Ukraine",
		"Адміністрація Байдена виділить 89 мільйонів доларів, щоб допомогти Києву розмінувати величезні території України",
		"https://news.yahoo.com/u-announces-89-million-help-185916017.html"
	],
	[
		"2022-08-09",
		"As the war in Ukraine continues with no end in sight, concerns are mounting in Washington—in both Democratic and Republican circles—that the Biden administration is holding back from supplying Ukraine with certain weapons that could give the invaded country a clear edge against Russia.",
		"Оскільки війна в Україні триває й кінця їй не видно, у Вашингтоні — як у демократичних, так і в республіканських колах — зростає занепокоєння тим, що адміністрація Байдена утримується від постачання Україні певної зброї, яка може дати країні явну перевагу проти Росії",
		"https://www.msn.com/en-us/news/world/lawmakers-want-better-weapons-for-ukraine-biden-isn-t-so-sure/ar-AA10sLsN"
	],
	[
		"2022-08-09",
		"Biden administration declared in separate announcements that it would provide $5.5 billion more in combined foreign aid and military weaponry to the wartorn nation of Ukraine as it continues to fight Russia’s invasion. The United States Agency for International Development (USAID) announced on Monday that it would send another $4.5 billion worth of taxpayers’ money to the Eastern European country in order to help the Ukrainian government function and provide social services for its people.",
		"Адміністрація Байдена оголосила в окремих оголошеннях, що надасть ще 5,5 мільярдів доларів у вигляді комбінованої іноземної допомоги та військового озброєння постраждалій війною нації України, яка продовжує боротися з вторгненням Росії.. Агентство США з міжнародного розвитку (USAID) оголосило в понеділок, що спрямує до цієї східноєвропейської країни ще 4,5 мільярда доларів грошей платників податків, щоб допомогти українському уряду функціонувати та надавати соціальні послуги її громадянам.",
		"https://www.dailywire.com/news/biden-admin-sending-5-5-billion-more-in-aid-to-ukraine"
	],
	[
		"2022-08-09",
		"The latest $1 billion package of U.S. military assistance to Ukraine includes an undisclosed number of “GMLRS,” precision-guided missiles with a 40-mile range that are fired from HIMARS mobile launchers, along with 75,000 rounds of 155 mm artillery ammunition; 20 120 mm mortar systems with 20,000 rounds of ammunition; 1,000 more Javelin anti-armor missiles; and significantly, anti-radar missiles that can be fired from Ukrainian fighter jets and are capable on homing in on Russian anti-aircraft radars, blinding air defense systems. The Pentagon is promising a “steady stream” of the GPS-guided GMLRS missiles but no more HIMARS launchers",
		"Останній пакет військової допомоги США Україні на суму 1 мільярд доларів включає нерозголошену кількість «GMLRS», високоточних ракет з радіусом дії 40 миль, які запускаються з мобільних пускових установок HIMARS, а також 75 000 снарядів 155-мм артилерії; 20 120-мм мінометів з 20 тис. боєприпасів; ще 1000 протитанкових ракет Javelin; і що важливо, протирадіолокаційні ракети, які можуть бути випущені з українських винищувачів і здатні наводитися на російські зенітні радари, засліплюючи системи протиповітряної оборони. Пентагон обіцяє «постійний потік» ракет GMLRS з GPS-наведенням, але не більше пускових установок HIMARS",
		"https://www.washingtonexaminer.com/policy/defense-national-security/us-promises-steady-stream-of-himars-ammo-as-ukraine-prepares-for-southern-offensive"
	],
	[
		"2022-08-10",
		"The Armed Forces of Ukraine have received 50 new Kirpi armored vehicles from Turkey. Another batch of 150 units is expected to be delivered soon.",
		"Збройні сили України отримали від Туреччини 50 нових броньованих автомобілів Kirpi. Незабаром очікується поставка ще однієї партії зі 150 одиниць.",
		"https://www.ukrinform.net/rubric-ato/3546708-armed-forces-receive-first-batch-of-50-kirpi-armored-vehicles-from-turkey.html"
	],
	[
		"2022-08-10",
		"Germany has supplied four more Gepard anti-aircraft armoured fighting vehicles to the Ukrainian Armed Forces.\nUkraine as a whole has received 12 Gepard anti-aircraft armoured fighting vehicles from Germany. Some 49,000 shells for Gepard, and three armoured recovery vehicles have been supplied over the past few days",
		"Німеччина поставила Збройним Силам України ще чотири бойові зенітні броньовані машини Gepard.\nУкраїна в цілому отримала від Німеччини 12 бойових зенітних броньованих машин Gepard. За останні кілька днів було поставлено близько 49 000 снарядів для Gepard і три броньовані евакуаційні машини.",
		"https://caliber.az/en/post/100026/"
	],
	[
		"2022-08-10",
		"Ben Wallace, the British Defence Secretary, confirmed on Wednesday that London would give Ukraine three additional multiple-launch rocket systems in addition to the three already in Kyiv, as well as a \"significant\" number of rockets for them.",
		"Міністр оборони Великої Британії Бен Воллес підтвердив у середу, що Лондон передасть Україні три додаткові реактивні системи залпового вогню на додаток до трьох, які вже є в Києві, а також «значну» кількість ракет для них.",
		"https://www.pravda.com.ua/eng/news/2022/08/10/7362746/"
	],
	[
		"2022-08-11",
		"Britain and Denmark will provide more financial and military aid to Ukraine. The announcement came after defence ministers meeting in Copenhagen.",
		"Британія та Данія нададуть Україні більше фінансової та військової допомоги. Про це заявили після зустрічі міністрів оборони в Копенгагені.",
		"https://www.reuters.com/world/europe/denmark-will-contribute-additional-110-mln-euros-ukraine-pm-2022-08-11/"
	],
	[
		"2022-08-12",
		"Sweden admits the possibility that it could produce weapons for the needs of Ukraine. This was announced by Swedish Minister of Defense Pēters Hultqvist at the conference of Western countries in Copenhagen",
		"Швеція допускає можливість виробництва зброї для потреб України. Про це заявив міністр оборони Швеції Петерс Хультквіст на конференції західних країн у Копенгагені.",
		"https://baltics.news/2022/08/12/sweden-allows-the-possibility-of-producing-weapons-for-ukraine/"
	],
	[
		"2022-08-12",
		"Estonia must continue to help Ukraine and a new comprehensive military support package is being discussed, said Estonian Minister of Defense Hanno Pevkur after a meeting of 24 countries in Copenhagen",
		"Естонія повинна продовжувати допомагати Україні, і зараз обговорюється новий комплексний пакет військової підтримки, заявив міністр оборони Естонії Ханно Певкур після зустрічі 24 країн у Копенгагені.",
		"https://news.err.ee/1608683122/pevkur-estonia-discussing-new-military-support-package-for-ukraine"
	],
	[
		"2022-08-15",
		"Ukraine has received the first four of a total of eight Slovak-made Zuzana 2 howitzers.",
		"Україна отримала перші чотири із восьми гаубиць словацького виробництва Zuzana 2.",
		"https://www.mosr.sk/51851-en/ukrajina-dostala-prve-z-objednanych-hufnic-zuzana-2/"
	],
	[
		"2022-08-15",
		"Latvia transferred two Mi-17 and two Mi-2 helicopters to Ukraine",
		"Латвія передала Україні два вертольоти Мі-17 і два вертольоти Мі-2",
		"https://www.mod.gov.lv/en/node/10886"
	],
	[
		"2022-08-17",
		"Nineteen retired US generals and former officials have called on the Biden administration to step up the pace of arms supplies to Ukraine or run the risk of “unintentionally seizing defeat from the jaws of victory”. They said that the US was providing enough weaponry to ensure a stalemate but not sufficient to help Ukraine recapture territory seized by Russia. The former officers, diplomats and other officials argue that failure to defeat Vladimir Putin in Ukraine increases the danger of a confrontation with Moscow later “on less favourable grounds”.",
		"Дев'ятнадцять американських генералів у відставці та колишніх чиновників закликали адміністрацію Байдена збільшити темпи поставок зброї в Україну, інакше ризикують «ненавмисно отримати поразку з пащі перемоги». Вони сказали, що США надають достатньо зброї, щоб забезпечити тупикову ситуацію, але недостатньо, щоб допомогти Україні повернути територію, захоплену Росією. Колишні офіцери, дипломати та інші офіційні особи стверджують, що нездатність перемогти Володимира Путіна в Україні збільшує небезпеку конфронтації з Москвою пізніше «на менш сприятливих умовах».",
		"https://www.theguardian.com/us-news/2022/aug/17/us-ukraine-arms-supply-retired-generals-officials"
	],
	[
		"2022-08-18",
		"Jaroslav Nad', Slovakia's defence minister has stated that the Government of Slovakia will not stop providing military support to Ukraine despite all Russia’s efforts to influence public opinion in his country on this matter",
		"Міністр оборони Словаччини Ярослав Надь заявив, що уряд Словаччини не припинить надавати військову підтримку Україні, незважаючи на всі зусилля Росії вплинути на громадську думку в його країні з цього приводу.",
		"https://www.ukrinform.net/amp/rubric-ato/3553050-slovakia-to-send-weapons-to-ukraine-despite-russias-efforts-to-prevent-supplies-defence-minister.html"
	],
	[
		"2022-08-18",
		"“We support Ukraine with the weapons we supply so that Ukraine can protect its territorial integrity and sovereignty” said Germany’s Chancellor Olaf Scholz. He was answering a question on whether the Armed Forces of Ukraine can use weapons provided by Germany and Sweden to return Crimea.",
		"Ми підтримуємо Україну зброєю, яку постачаємо, щоб Україна могла захистити свою територіальну цілісність і суверенітет», – заявив канцлер Німеччини Олаф Шольц. Про це він відповідав на запитання, чи можуть Збройні сили України використати для повернення Криму зброю, надану Німеччиною та Швецією.",
		"https://www.kyivpost.com/russias-war/ukraine-has-the-right-to-use-weapons-to-retake-crimea-leaders-of-germany-sweden.html"
	],
	[
		"2022-08-18",
		"The Latvian Ministry of Defence has confirmed the delivery of six self-propelled M109 howitzers and ammunition to Ukrainian forces",
		"Міністерство оборони Латвії підтвердило поставку українським силам шести самохідних гаубиць М109 і боєприпасів.",
		"https://www.mod.gov.lv/en/node/10886"
	],
	[
		"2022-08-19",
		"The Secretary of State Antony J. Blinken announced military suport to Ukraine in amount of $775 mln. This includes arms, munitions and military equipment.",
		"Держсекретар Ентоні Дж. Блінкен оголосив про військову підтримку України в розмірі 775 млн. доларів. Це включає зброю, боєприпаси та військову техніку.",
		"https://www.state.gov/775-million-in-additional-u-s-military-assistance-for-ukraine/"
	],
	[
		"2022-08-19",
		"For the first time, the U.S. is sending 15 ScanEagle surveillance drones to help the Ukrainians spot and correct the precision artillery and rocket strikes.",
		"США вперше надсилають 15 дронів-спостережників ScanEagle, щоб допомогти українцям помітити та скорегувати високоточні артилерійські та ракетні удари.",
		"https://www.politico.com/newsletters/national-security-daily/2022/08/19/u-s-sending-new-drones-to-ukraine-ahead-of-southern-push-00052856"
	],
	[
		"2022-08-21",
		"Australia will provide Ukraine with 300 DefendTex D40 kamikaze drones",
		"Австралія надасть Україні 300 безпілотників-камікадзе DefendTex D40",
		"https://veteranweb.asn.au/news/australia-will-provide-ukraine-with-300-defendtex-d40-kamikaze-drones/"
	],
	[
		"2022-08-21",
		"The Ukrainian servicemen received Bulgarian 60-mm M60CMA mortars.",
		"Українські військові отримали болгарські 60-мм міномети M60CMA. ",
		"https://mil.in.ua/en/news/ukrainian-servicemen-received-bulgarian-m60cma-mortars/"
	],
	[
		"2022-08-21",
		"Lithuanian Defense Minister Arvydas Anusauskas said that Vilnius is preparing new deliveries of military aid to Ukraine. Anusauskas mentioned that another ten M113 armored vehicles would be handed over to Kyiv.",
		"Міністр оборони Литви Арвідас Анусаускас заявив, що Вільнюс готує нові поставки військової допомоги Україні. Анусаускас зазначив, що Києву буде передано ще десять броньованих машин М113.",
		"https://oopstop.com/lithuania-is-preparing-to-send-two-more-shipments-of-military-aid-to-kyiv/"
	],
	[
		"2022-08-21",
		"Sweden will break its doctrine of not sending arms to countries engaged in an active conflict, the country's prime minister announced Sunday. “Sweden is now proposing direct support for Ukraine's armed forces.\"",
		"Швеція порушить свою доктрину не надсилати зброю країнам, які перебувають у активному конфлікті, заявив у неділю прем'єр-міністр країни. «Швеція зараз пропонує пряму підтримку збройних сил України».",
		"https://infonewsmania.com/sweden-to-send-military-aid-to-ukraine-in-break-with-tradition-daily-sabah-daily-sabah/"
	],
	[
		"2022-08-22",
		"Rumors are swirling around Washington that the United States has provided Ukraine with more weapons than the administration has announced publicly.",
		"У Вашингтоні ходять чутки, що Сполучені Штати надали Україні більше зброї, ніж публічно оголосила адміністрація.",
		"https://www.politico.com/newsletters/national-security-daily/2022/08/22/is-the-u-s-giving-ukraine-some-weapons-secretly-00053079"
	],
	[
		"2022-08-23",
		"Lithuania will send two rotations of instructors to the United Kingdom to train Ukrainian troops there, Lithuanian Defence Minister Arvydas Anušauskas said on Tuesday.",
		"Міністр оборони Литви Арвідас Анушаускас заявив у вівторок, що Литва відправить дві ротації інструкторів до Великої Британії для навчання українських військових.",
		"https://www.lrt.lt/en/news-in-english/19/1764946/lithuania-to-send-30-instructors-to-uk-to-train-ukrainian-troops"
	],
	[
		"2022-08-23",
		"Slovakia will deliver 30 tracked BVP-1 armored infantry fighting vehicles to Ukraine.",
		"Словаччина поставить в Україну 30 гусеничних броньованих машин піхоти БВП-1.",
		"https://www.thedefensepost.com/2022/08/24/germany-slovakia-tank-exchange/"
	],
	[
		"2022-08-23",
		"Chancellor Olaf Scholz said on Tuesday that Germany planned to deliver further arms to Ukraine, worth more than 500 million euros ($498.55 million)",
		"Канцлер Олаф Шольц заявив у вівторок, що Німеччина планує поставити Україні додаткові озброєння на суму понад 500 мільйонів євро (498,55 мільйонів доларів).",
		"https://www.reuters.com/world/europe/germanys-scholz-plans-send-more-arms-ukraine-source-2022-08-23/"
	],
	[
		"2022-08-24",
		"British Prime Minister Boris Johnson promised a further package of military support to Ukraine. The 54 million pound ($63.5 million) package will include 2,000 drones and loitering munitions.",
		"Прем'єр-міністр Великої Британії Борис Джонсон пообіцяв подальший пакет військової підтримки Україні. Пакет вартістю 54 мільйони фунтів стерлінгів (63,5 мільйона доларів США) включатиме 2000 безпілотників і боєприпаси.",
		"https://www.reuters.com/world/uk/uk-pm-johnson-pledges-more-military-aid-ukraine-during-visit-kyiv-2022-08-24/"
	],
	[
		"2022-08-24",
		"On August 24, the Department of Defense (DoD) announced approximately $3 billion in additional security assistance for Ukraine under the Ukraine Security Assistance Initiative (USAI).",
		"24 серпня Міністерство оборони (DoD) оголосило приблизно 3 мільярди доларів додаткової допомоги Україні в галузі безпеки в рамках Ініціативи сприяння безпеці в Україні (USAI).",
		"https://www.defense.gov/News/Releases/Release/Article/3138105/nearly-3-billion-in-additional-security-assistance-for-ukraine/"
	],
	[
		"2022-08-25",
		"Norway and Great Britain are jointly providing Ukraine with \"Black Hornet\" military micro-drones that can be used to spy on Russian forces due to their minute size.",
		"Норвегія та Велика Британія спільно надають Україні військові мікродрони \"Чорний шершень\", які через їх незначні розміри можуть використовуватися для шпигування за російськими військами.",
		"https://www.newsweek.com/ukraine-black-hornet-micro-drones-reconnaissance-undetected-1737135"
	],
	[
		"2022-08-25",
		"The Ministry of Defense of Canada allocated two C-130 aircraft (Lockheed Martin C-130J) for transporting weapons to Ukraine.",
		"Міністерство оборони Канади виділило два літаки C-130 (Lockheed Martin C-130J) для транспортування озброєння в Україну.",
		"https://www.txtreport.com/news/2022-08-25-canada-has-allocated-2-planes-for-transporting-weapons-to-ukraine.S1RbVBryo.html"
	],
	[
		"2022-08-27",
		"The UK is giving underwater drones to Ukraine and training Ukrainian personnel in Britain to use them to clear their coastline of mines",
		"Велика Британія надає Україні підводні безпілотники та навчає український персонал у Британії використовувати їх для очищення берегової лінії від мін",
		"https://www.gov.uk/government/news/uk-donating-undersea-minehunter-drones-to-help-ukraine-clear-coastline"
	],
	[
		"2022-08-27",
		"After a direct question, whether the US will supply aircraft, Under Secretary of Defense for Policy Colin Kahl, answers that the US will not. But this doesn’t mean that there are no other options.",
		"Після прямого запитання, чи постачатимуть США літаки, заступник міністра оборони з питань політики Колін Кал відповів, що США не будуть. Але це не означає, що інших варіантів немає",
		"https://en.defence-ua.com/analysis/the_aircraft_for_ukrainian_air_force_have_already_been_decided_and_it_is_not_the_f_16_tips_from_the_pentagon_and_copenhagen-4022.html"
	],
	[
		"2022-08-29",
		"Olaf Scholz promised that Germany would send Ukraine state-of-the-art weapons, such as air defence and radar systems and reconnaissance drones, in the coming weeks and months.",
		"Олаф Шольц пообіцяв, що Німеччина надасть Україні найсучасніші озброєння, такі як протиповітряна оборона та радіолокаційні системи та розвідувальні безпілотники, протягом найближчих тижнів і місяців.",
		"https://www.reuters.com/world/europe/germanys-scholz-we-will-keep-up-support-ukraine-long-it-takes-2022-08-29/"
	],
	[
		"2022-08-29",
		"The foreign minister of Germany Annalena Baerbock said that Germany will continue to support Ukraine in the war against Russia. Baerbok explained the slow pace of military equipment for Ukrainian soldiers to the difficulties of production",
		"Міністр закордонних справ Німеччини Анналена Бербок заявила, що Німеччина продовжить підтримувати Україну у війні проти Росії. Повільні темпи поставок військової техніки для українських військових Баєрбок пояснила складнощами виробництва",
		"https://good-time-invest.com/blog/germany-approaches-transfer-of-heavy-weapons-to-ukraine/"
	],
	[
		"2022-08-30",
		"EU defence ministers voiced support for the start of work on setting up an EU military training mission for Ukrainian forces that would complement current efforts by individual EU countries",
		"Міністри оборони ЄС висловили підтримку початку роботи зі створення військової тренувальної місії ЄС для українських сил, яка доповнить поточні зусилля окремих країн ЄС",
		"https://www.euractiv.com/section/defence-and-security/news/eu-decides-to-start-work-on-ukraine-military-training-mission/"
	],
	[
		"2022-09-01",
		"The Danish Foreign Minister Jeppe Kofod stressed that Denmark would continue to support Ukraine both in the military sphere and in reconstruction. In particular, a new aid package is being prepared.",
		"Міністр закордонних справ Данії Йеппе Кофод наголосив, що Данія й надалі підтримуватиме Україну як у військовій сфері, так і у відбудові. Зокрема, готується новий пакет допомоги",
		"https://closetheskyoverukraine.com/latest-news/denmark-prepares-another-aid-package-for-ukraine"
	],
	[
		"2022-09-01",
		"Sweden will consider providing Ukraine with self-propelled artillery systems Archer, as well as short-range anti-aircraft missile systems RBS 70 to repel Russian aggression. This said Minister of Foreign Affairs of the Kingdom Ann Linde .",
		"Швеція розгляне можливість надання Україні самохідних артилерійських систем Archer, а також зенітно-ракетних комплексів малої дальності RBS 70 для відсічі російської агресії. Про це заявила міністр закордонних справ Королівства Анн Лінде.",
		"https://thetimeshub.in/sweden-will-consider-providing-ukraine-with-acs-archer/35454/"
	],
	[
		"2022-09-02",
		"U.S. President Joe Biden will request $11.7 billion in emergency funding from Congress to provide lethal aid and budget support to Ukraine",
		"Президент США Джо Байден вимагатиме від Конгресу екстреного фінансування в розмірі 11,7 мільярдів доларів для надання летальної допомоги та бюджетної підтримки Україні.",
		"https://www.reuters.com/world/biden-request-117-bln-ukraine-aid-224-bln-covid-relief-2022-09-02/"
	],
	[
		"2022-09-05",
		"European weapons stocks are running low, Josep Borrell warned",
		"Запаси зброї в Європі скорочуються, попередив Жозеп Боррель",
		"https://www.cnbc.com/2022/09/05/russia-ukraine-live-updates.html"
	],
	[
		"2022-09-07",
		"The Pentagon's goal is to deliver 100,000 of 155 mm artillery rounds in 90 days and 15,000 a month after that.",
		"Мета Пентагону - поставити 100 000 артилерійських снарядів калібру 155 мм протягом 90 днів і 15 000 через місяць після цього.",
		"https://edition.cnn.com/2022/09/07/politics/us-military-ukraine-analysis/index.html"
	],
	[
		"2022-09-07",
		"According to the Minister of Digital Transformation Mykhailo Fedorov, the citizens of Ukraine collected UAH 64 million for the purchase of the \"army of drones\". With these funds, 40 Warmate drones were purchased",
		"За словами міністра цифрової трансформації Михайла Федорова, громадяни України зібрали 64 млн грн на закупівлю \"армії дронів\". За ці кошти було придбано 40 безпілотників Warmate",
		"https://en.interfax.com.ua/news/general/857113.html"
	],
	[
		"2022-09-08",
		"Norway sent 160 Hellfire missiles to Ukraine",
		"Норвегія відправила в Україну 160 ракет Hellfire",
		"https://www.tu.no/artikler/attende-vapendonasjon-fra-norge-denne-gang-er-det-hellfire-missiler/522074"
	],
	[
		"2022-09-08",
		"The new package of U.S. assistance to Ukraine valued at up to $675 million dollars includes HIMARS ammunition, 105 mm howitzers, artillery ammunition and HARM missiles, Humvees and armored ambulances, anti-tank systems and more",
		"Новий пакет допомоги США Україні на 675 мільйонів доларів включає боєприпаси для HIMARS, 105-мм гаубиці,  артилерійські боєприпаси та ракети HARM, Humvee та броньовані санітарні машини, протитанкові системи тощо",
		"https://www.defense.gov/News/Transcripts/Transcript/Article/3152582/secretary-of-defense-lloyd-j-austin-iii-and-chairman-of-the-joint-chiefs-of-sta/"
	],
	[
		"2022-09-09",
		"Secretary of State Antony Blinken pledged lasting U.S. support for Ukraine during a visit to Kyiv. His visit signals ongoing U.S. backing for the war, as the Biden administration pledged an additional $675 million in U.S. military supplies for Ukraine.The administration will also provide $1 billion in military financing for Ukraine, Blinken said, along with a similar amount for neighboring nations and countries elsewhere in Europe to strengthen their defenses.",
		"Держсекретар Ентоні Блінкен під час візиту до Києва пообіцяв постійну підтримку України з боку США. Його візит свідчить про постійну підтримку США у війні, оскільки адміністрація Байдена пообіцяла додаткові 675 мільйонів доларів США на військові поставки для України. Адміністрація також надасть 1 мільярд доларів військового фінансування для України, сказав Блінкен, а також аналогічну суму для сусідніх країн і країни в інших частинах Європи для зміцнення своєї оборони.",
		"https://www.washingtonpost.com/national-security/2022/09/08/blinken-visit-kyiv-security-aid/"
	],
	[
		"2022-09-09",
		"The President of Ukraine and the General Director of the Baikar company discussed cooperation in the defense sector",
		"Президент України та генеральний директор компанії «Байкар» обговорили співпрацю в оборонній сфері",
		"https://www.aa.com.tr/en/russia-ukraine-war/ukrainian-president-honors-ceo-of-turkish-defense-industry-firm-baykar/2681704"
	],
	[
		"2022-09-09",
		"Ukraine purchased from France 155-mm towed TRF1 howitzers, which are no longer in service with the French army.",
		"Україна закупила у Франції 155-мм буксирувані гаубиці TRF1, які вже не стоять на озброєнні французької армії.",
		"https://uk.topnews.media/ukraine/weapons-for-ukraine-ukraine-bought-155-mm-trf1-howitzers-from-france-mass-media-09-09-22-0125-war-in-ukraine/"
	],
	[
		"2022-09-11",
		"\"If Lambrecht (German Defense Minister) — quite correctly — concludes that our security is being defended in Ukraine, then it is also important that she and Chancellor Scholz credibly back this up with appropriate deliveries of armored vehicles to Ukraine,\" said Roderich Kiesewetter, a defense policy lawmaker from Germany's main opposition party, the center-right CDU.",
		"«Якщо Ламбрехт (міністр оборони Німеччини) — цілком правильно — робить висновок, що наша безпека захищається в Україні, то також важливо, щоб вона та канцлер Шольц це надійно підтвердили відповідними поставками бронетехніки в Україну», — сказав Родеріх Кізеветтер, законодавець із питань оборонної політики від головної опозиційної партії Німеччини, правоцентристського ХДС.",
		"https://www.politico.eu/article/eu-security-being-defended-in-ukraine-germanys-lambrecht-vows-continued-support-for-kyiv/"
	],
	[
		"2022-09-12",
		"Lithuanian Defense Minister Arvydas Anusauskas says Lithuania will purchase 37 kamikaze drones to provide to Ukraine, using the money raised by the Legion of Boom campaign.",
		"Міністр оборони Литви Арвідас Анусаускас заявив, що Литва закупить 37 безпілотних літальних апаратів-камікадзе для надання Україні на кошти, зібрані в рамках кампанії Legion of Boom.",
		"https://www.ukrinform.net/rubric-ato/3558850-lithuania-to-buy-37-kamikaze-drones-for-ukraine.html"
	],
	[
		"2022-09-12",
		"Deputy Prime Minister Richard Marles has pledged Australia will continue to back Ukraine as it resists Russian aggression.",
		"Віце-прем'єр-міністр Річард Марлз пообіцяв, що Австралія продовжить підтримувати Україну, яка протистоїть російській агресії.",
		"https://www.sheppnews.com.au/national/deputy-pm-praises-inspirational-ukraine/"
	],
	[
		"2022-09-12",
		"Lithianian Ministry of Defence announced that the shipment of 105 mm howitzers are on their way to Ukraine. The photo published by the Ministry shows a U.S.-made M101A1 howitzer.",
		"Міністерство оборони Литви повідомило, що партія 105-мм гаубиць прямує до України. На фото, опублікованому міністерством, зображена гаубиця М101А1 американського виробництва.",
		"https://twitter.com/Lithuanian_MoD/status/1567446474312540160?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1567446474312540160%7Ctwgr%5Ee93a9e4fedab573c043bf14c9755d023dcae9e34%7Ctwcon%5Es1_c10&ref_url=https%3A%2F%2Fmilitaryleak.com%2F2022%2F09%2F12%2Flithuania-sends-m101a1-105mm-towed-light-howitzer-to-ukraine%2F"
	],
	[
		"2022-09-13",
		"Ukrainian Foreign Minister Dmytro Kuleba condemned \"abstract fears and excuses\" behind Germany's reluctance as he pushed for further arms supplies.",
		"Міністр закордонних справ України Дмитро Кулеба засудив \"абстрактні страхи та виправдання\", які стоять за небажанням Німеччини, коли він наполягає на подальших поставках зброї.",
		"https://www.dw.com/en/russia-ukraine-updates-kyiv-decries-germanys-disappointing-signals-on-weapons/a-63101592"
	],
	[
		"2022-09-15",
		"German economy minister Robert Habeck vows to deliver more weapons to Ukraine",
		"Міністр економіки Німеччини Роберт Хабек обіцяє постачати більше зброї в Україну",
		"https://tvpworld.com/62772534/german-economy-minister-vows-to-deliver-more-weapons-to-ukraine"
	],
	[
		"2022-09-15",
		"Germany’s foreign minister is putting pressure on Chancellor Olaf Scholz to decide soon whether to supply Ukraine with advanced tanks as it seeks to reclaim more of its captured territory from Russia.",
		"Міністр закордонних справ Німеччини тисне на канцлера Олафа Шольца, щоб він незабаром вирішив, чи постачати Україні передові танки, оскільки вона прагне повернути більше захопленої території у Росії.",
		"https://abcnews.go.com/International/wireStory/german-fm-urges-swift-decision-tank-delivery-ukraine-89942868"
	],
	[
		"2022-09-15",
		"A. J. Blinken statement 09/15/2022: $600 Million in Additional U.S. Military Assistance for Ukraine: Together with our Allies and partners, we are delivering the arms and equipment that Ukraine’s forces are utilizing so effectively as they continue their successful counter-offensive against Russia’s invasion.  President Biden has been clear we will support the people of Ukraine for as long as it takes. ",
		"Заява А. Я. Блінкена 15/09/2022: 600 мільйонів доларів додаткової військової допомоги США Україні: Разом з нашими союзниками та партнерами ми доставляємо озброєння та техніку, які українські сили використовують настільки ефективно, що вони продовжують успішний контрнаступ проти вторгнення Росії. Президент Байден чітко дав зрозуміти, що ми будемо підтримувати народ України стільки, скільки буде потрібно.",
		"https://www.state.gov/600-million-in-additional-u-s-military-assistance-for-ukraine/"
	],
	[
		"2022-09-15",
		"According to German Defense Minister Christine Lambrecht, Greece will soon send to Ukraine 40 infantry fighting vehicles -- Soviet-built BMP-1 IFVs -- on the completion of a deal in which Greece would receive 40 German infantry fighting vehicles -- Marder IFVs.",
		"За словами міністра оборони Німеччини Крістін Ламбрехт, Греція незабаром надішле Україні 40 бойових машин піхоти радянського виробництва БМП-1 після завершення угоди, згідно з якою Греція отримає 40 німецьких БМП Marder.",
		"https://www.dw.com/en/russia-ukraine-updates-eu-vows-to-support-ukraine-for-as-long-as-it-takes/a-63128716"
	],
	[
		"2022-09-15",
		"Arvidas Anusauskas, Minister of National Defense of Lithuania, announced that Lithuania will repair Ukranian PzH 2000 ",
		"Міністр національної оборони Литви Арвідас Анусаускас заявив, що Литва відремонтує українські PzH 2000",
		"https://twitter.com/a_anusauskas/status/1570859783489728512?s=20&t=5cy1BJLDOmHggEGX9qBdTw"
	],
	[
		"2022-09-15",
		"Russia’s Foreign Ministry warned the U.S. against providing longer-range missiles to Ukraine.",
		"МЗС Росії застерегло США від надання Україні ракет більшої дальності.",
		"https://www.democracynow.org/2022/9/16/headlines/russia_warns_us_arms_shipments_to_ukraine_could_prompt_direct_military_clash"
	],
	[
		"2022-09-16",
		"The Biden administration announced it will send another $600 million in military aid to Ukraine. The new package will include only the same types of ammunition and equipment as before.",
		"Адміністрація Байдена оголосила, що направить Україні ще 600 мільйонів доларів військової допомоги. У новому пакеті будуть тільки ті ж типи боєприпасів і спорядження, що і раніше.",
		"https://www.wsaz.com/2022/09/16/us-sends-new-military-aid-ukraine-boost-momentum/"
	],
	[
		"2022-09-16",
		"Volodymyr Zelenskiy made an urgent appeal to allies to supply additional air- and missile-defense systems that he said are crucial to repelling Russia’s invasion and preventing further disruption to food and energy supplies.",
		"Володимир Зеленський звернувся до союзників з настійним закликом поставити додаткові системи протиповітряної та протиракетної оборони, які, за його словами, мають вирішальне значення для відбиття вторгнення Росії та запобігання подальшим перебоям у постачанні продовольства та енергії.",
		"https://www.bloomberg.com/news/articles/2022-09-16/ukraine-latest-zelenskiy-makes-urgent-appeal-for-air-defense"
	],
	[
		"2022-09-17",
		"After two moths of hesitation, the German federal government finally gave green light to the Ukraine for the purchasing of 18 howitzers RCH-155 weapon system worth 216 million euros from the Krauss-Maffei Wegmann (KMW) armaments group. However the shipment is expected not earlier than 2025.",
		"Після двох місяців коливань федеральний уряд Німеччини нарешті дав зелене світло Україні на закупівлю 18 гаубиць системи озброєння RCH-155 вартістю 216 мільйонів євро у групи озброєнь Krauss-Maffei Wegmann (KMW). Однак відвантаження очікується не раніше 2025 року.",
		"https://www.welt.de/politik/ausland/article241106455/Waffenhilfe-Deutschland-liefert-weitere-Geschuetze-an-die-Ukraine.html"
	],
	[
		"2022-09-17",
		"Spain sent Ukraine five transport planes with ammunition for large-caliber artillery systems",
		"Іспанія направила Україні п'ять транспортних літаків з боєприпасами для великокаліберних артилерійських систем.",
		"https://babel.ua/en/news/84361-spain-sent-five-planes-with-ammunition-for-large-caliber-artillery-to-ukraine"
	],
	[
		"2022-09-17",
		"Admiral Rob Bauer, the Chair of the NATO Military Committee, announced that the Alliance will increase supplies of modern weapons to Ukraine",
		"Голова Військового комітету НАТО адмірал Роб Бауер заявив, що Альянс збільшить поставки сучасної зброї в Україну",
		"https://english.nv.ua/nation/nato-to-increase-support-to-ukraine-news-50270768.html"
	],
	[
		"2022-09-18",
		"Germany’s Chancellor Olaf Scholz and Defence Minister Christine Lambrecht are not willing to supply Western-designed battle tanks to Ukraine, despite increasingly loud demands for them to do so.",
		"Канцлер Німеччини Олаф Шольц і міністр оборони Крістін Ламбрехт не бажають постачати Україні бойові танки західного виробництва, незважаючи на все гучніші вимоги до них.",
		"https://www.deutschland.de/en/news/ticker-solidarity-with-ukraine"
	],
	[
		"2022-09-19",
		"Senor Defence Official in the Department of Defense of the US: \"Now we're seeing the Russians retaliating for Ukrainian gains, they're targeting critical and civilian infrastructure.  So we here at the Department of Defense will continue -- we will continue to provide Ukraine with what they need for their current fight, when they need it.\"",
		"Старший представник оборонного відомства в Міністерстві оборони США: «Зараз ми бачимо, як росіяни мстять за українські здобутки, вони націлюються на критично важливу та цивільну інфраструктуру. Тому ми тут, у Міністерстві оборони, продовжуватимемо -- ми продовжуватимемо забезпечити Україну тим, що їй потрібно для їхньої нинішньої боротьби, коли вона потребує».",
		"https://www.defense.gov/News/Transcripts/Transcript/Article/3163547/senior-defense-official-and-senior-military-official-hold-a-background-briefing/"
	],
	[
		"2022-09-19",
		"Prime Minister of Slovenia Robert Golob and German Chancellor Scholz agreed in a telephone conference to a joint action, so that the Ukrainian side will receive 28 Slovenian M-55S tanks.",
		"Прем'єр-міністр Словенії Роберт Голоб і канцлер Німеччини Шольц на телефонній конференції домовилися про спільні дії, щоб українська сторона отримала 28 словенських танків М-55С.",
		"https://www.gov.si/en/news/2022-09-19-prime-minister-robert-golob-in-a-telephone-conversation-with-german-chancellor-olaf-scholz-about-current-european-affairs/"
	],
	[
		"2022-09-19",
		"Lithuanian President Gitanas Nauseda called to step up military support to Kyiv in its fight against Russia’s aggression after new mass graves and new evidence of torture were found in liberated Ukrainian territories.",
		"Президент Литви Гітанас Науседа закликав посилити військову підтримку Києва в боротьбі з російською агресією після того, як на звільнених українських територіях були виявлені нові масові поховання та нові докази тортур.",
		"https://www.baltictimes.com/nauseda_calls_to_step_up_military_support_to_kyiv_amid_russia_s_genocide_in_ukraine/"
	],
	[
		"2022-09-19",
		"The German government has decided to transfer four more Panzerhaubitze 2000 self-propelled artillery systems to Ukraine.",
		"Уряд Німеччини вирішив передати Україні ще чотири самохідні артилерійські системи Panzerhaubitze 2000.",
		"https://mil.in.ua/en/news/germany-will-supply-ukraine-with-an-additional-4-pzh-2000-self-propelled-guns/"
	],
	[
		"2022-09-20",
		"\nThree German political scientists from the European Council on International Relations - Gustav Gressel, Rafael Loss and Jana Puglierin – said that the supply of battle tanks, in particular Leopards, to Ukraine would be an urgent need rather than an escalation, and such a German initiative would create trust and serve the security of Europe.",
		"Троє німецьких політологів з Європейської ради з міжнародних відносин – Густав Грессель, Рафаель Лосс і Яна Пульєрін – заявили, що постачання Україні бойових танків, зокрема «Леопардів», буде нагальною потребою, а не ескалацією, і така німецька ініціатива створить довіру та послужить безпеці Європи.",
		"https://www.zeit.de/zustimmung?url=https%3A%2F%2Fwww.zeit.de%2Fpolitik%2Fausland%2F2022-09%2Fukraine-krieg-waffenlieferung-leopard-2"
	],
	[
		"2022-09-20",
		"Republican senators signaled tentative support for additional Ukraine aid that the Biden administration has requested following a classified briefing on Monday night. The Biden administration has asked for $12 billion in aid to Ukraine to be added to the continuing resolution that’s needed to keep the government open past September 30. GOP support for this is essential.",
		"Сенатори-республіканці повідомили про попередню підтримку додаткової допомоги Україні, яку запитала адміністрація Байдена після секретного брифінгу в понеділок увечері. Адміністрація Байдена попросила додати Україні допомогу в розмірі 12 мільярдів доларів до резолюції, необхідної для того, щоб уряд залишався відкритим до 30 вересня. Підтримка Республіканської партії для цього є важливою.",
		"https://www.cnn.com/2022/09/19/politics/ukraine-aid-government-funding-bill/index.html"
	],
	[
		"2022-09-20",
		"Russian Deputy Foreign Minister Alexander Grushko in a Tuesday meeting with France's ambassador to Moscow Pierre Levy warned Paris against the “unacceptable” delivery of weapons to Ukraine.",
		"Заступник міністра закордонних справ Росії Олександр Грушко під час зустрічі у вівторок із послом Франції в Москві П’єром Леві застеріг Париж від «неприйнятних» поставок зброї Україні.",
		"https://english.alarabiya.net/News/world/2022/09/20/Russia-warns-France-about-unacceptable-arms-deliveries-to-Ukraine-"
	],
	[
		"2022-09-21",
		"German Chancellor Olaf Scholz said at the UN General Assembly that Germany will not accept a peace dictated by Russia and will continue supporting “Ukraine with all our might financially, economically, with humanitarian assistance and also with weapons”",
		"Канцлер Німеччини Олаф Шольц заявив на Генасамблеї ООН, що Німеччина не прийме мир, який диктує Росія, і продовжить підтримувати Україну «всіма силами фінансово, економічно, гуманітарною допомогою, а також зброєю».",
		"https://www.aljazeera.com/news/2022/9/21/at-un-general-assembly-leaders-condemns-russias-war-in-ukraine"
	],
	[
		"2022-09-21",
		"Ukraine has presented Canada with a new list of its military hardware needs. The request was contained in a letter received by Defence Minister Anita Anand from her Ukrainian counterpart, Oleksii Reznikov.",
		"Україна представила Канаді новий список потреб військової техніки. Прохання містилося в листі, який міністр оборони Аніта Ананд отримала від свого українського колеги Олексія Резнікова.",
		"https://www.cbc.ca/news/politics/ukraine-russia-weapons-1.6589322"
	],
	[
		"2022-09-21",
		"Lawmakers in Bundestag are scheduled to debate German assistance for Ukraine. And there are indications that a majority is in favor of supplying the country with modern tanks.",
		"Депутати в Бундестазі мають обговорити допомогу Німеччини Україні. І є ознаки того, що більшість виступає за постачання країні сучасних танків.",
		"https://www.dw.com/en/ukraine-war-will-the-ukrainian-army-receive-german-battle-tanks/a-63191358"
	],
	[
		"2022-09-22",
		"Putin’s recent threat to use nuclear weapons will not staunch U.S. aid to Ukraine, the Pentagon’s top spokesperson said Thursday. ",
		"Нещодавня погроза Путіна застосувати ядерну зброю не зупинить допомогу США Україні, заявив у четвер головний представник Пентагону.",
		"https://thehill.com/policy/defense/3656740-pentagon-putins-nuclear-threat-wont-deter-us-aid-to-ukraine/"
	],
	[
		"2022-09-22",
		"Dutch Foreign Minister Wopke Hoekstra called on Wednesday for increased weapons supplies to Ukraine amid partial mobilization declared in Russia. \"It is crucial to continue and up our support for Ukraine: more sanctions, more weapons, more aid.\"",
		"Міністр закордонних справ Нідерландів Вопке Хьокстра закликав у середу збільшити постачання зброї в Україну на тлі часткової мобілізації, оголошеної в Росії. «Вкрай важливо продовжувати та збільшувати нашу підтримку України: більше санкцій, більше зброї, більше допомоги».",
		"https://www.urdupoint.com/en/world/dutch-foreign-minister-calls-for-more-arms-su-1566527.html"
	],
	[
		"2022-09-23",
		"Germany’s Defense Minister Christine Lambrecht stated that Putin's latest \"initiatives\" result in even greater support for Ukraine on the part of Europe, including through the supply of military equipment.",
		"Міністр оборони Німеччини Крістін Ламбрехт заявила, що останні «ініціативи» Путіна призводять до ще більшої підтримки України з боку Європи, в тому числі через постачання військової техніки.",
		"https://www.ukrinform.net/rubric-ato/3577281-berlin-to-pursue-arms-supplies-to-ukraine-despite-putins-statements-defense-chief.html"
	],
	[
		"2022-09-23",
		"Pope Francis said Ukraine had a right to defend itself from Russia's invasion, and lend support to other countries that are supplying Ukrainians with arms and war material.",
		"Папа Римський Франциск зазначив, що Україна має право захищатися від вторгнення Росії та надав підтримку іншим країнам, які постачають українцям зброю та військові засоби.",
		"https://www.ncronline.org/news/world/ukrainians-welcome-pope-francis-tougher-stance-russian-invasion"
	],
	[
		"2022-09-25",
		"Canada boosts capacity of key supply hub for weapons to Ukraine",
		"Канада нарощує потужності ключового центру постачання зброї в Україну",
		"https://www.cbc.ca/news/politics/canada-weapons-supply-lines-expanded-1.6594582"
	],
	[
		"2022-09-25",
		"Swedish Foreign Affairs Minister Ann Lind announced that Sweden evaluates the possibility to provide Archer 155mm wheeled self-propelled howitzers, RBS70 man-portable air defense missile systems, and other military equipment to Ukraine.",
		"Міністр закордонних справ Швеції Анн Лінд повідомила, що Швеція оцінює можливість надання Україні 155-мм колісних самохідних гаубиць Archer, переносних ракетних комплексів ППО RBS70 та іншої військової техніки.",
		"https://twitter.com/AnnLinde/status/1564937471028301824"
	],
	[
		"2022-09-26",
		"Secretary of State Antony Blinken said a conversation with Ukraine over the supply of U.S. weapons to aid the country’s war effort is “ongoing,” notably regarding a request from Kyiv for Army Tactical Missile Systems, or ATACMS",
		"Держсекретар Ентоні Блінкен заявив, що розмова з Україною щодо постачання зброї США для допомоги військовим зусиллям країни «триває», зокрема щодо запиту Києва на армійські тактичні ракетні системи (ATACMS)",
		"https://www.washingtonpost.com/world/2022/09/26/blinken-ukraine-weapons-60-minutes-nasams/"
	],
	[
		"2022-09-26",
		"The US Congress has approved $12.3bn in aid which includes $3bn for arms, supplies and salaries for Ukraine’s military.",
		"Конгрес США схвалив допомогу в розмірі 12,3 мільярда доларів, включаючи 3 мільярди доларів на озброєння, постачання та зарплати українським військовим.",
		"https://www.reuters.com/world/us/us-congress-negotiators-set-12-bln-new-ukraine-aid-2022-09-26/"
	],
	[
		"2022-09-27",
		"The United States will not start delivering sophisticated NASAMS air defenses to Ukraine for another two months or so",
		"Сполучені Штати не почнуть постачати Україні складні засоби протиповітряної оборони NASAMS ще приблизно два місяці.",
		"https://www.reuters.com/world/us-has-not-yet-delivered-nasams-air-defenses-ukraine-pentagon-2022-09-27/"
	],
	[
		"2022-09-28",
		"$1.1 billion security assistance package for Ukraine is announced on Sept. 28 by the U.S. Defense Department. The package include: 18 High Mobility Artillery Rocket Systems (HIMARS) and associated ammunition, 150 Armored High Mobility Multipurpose Wheeled Vehicles (HMMWVs), 150 Tactical Vehicles to tow weapons, 40 trucks and 80 trailers to transport heavy equipment, other military systems and supplies.",
		"Міністерство оборони США оголосило 28 вересня про пакет допомоги Україні в сфері безпеки на 1,1 мільярда доларів. Пакет включає: 18 ракетно-артилерійських систем високої мобільності (HIMARS) і пов’язаних боєприпасів, 150 броньованих багатоцільових колісних машин високої мобільності (HMMWV), 150 тактичних машин для буксирування зброї, 40 вантажівок і 80 причепів для транспортування важкого обладнання, інших військових систем і припасів",
		"https://www.msn.com/en-us/news/world/ukraine-situation-report-another-18-himars-launchers-for-ukraine/ar-AA12muql"
	],
	[
		"2022-09-28",
		"The HIMARS artillery system in the US’s latest security assistance package for Ukraine will take a few years to be built",
		"Виробництво систем HIMARS для останнього пакету допомоги Україні займе кілька років",
		"https://www.bloomberg.com/news/articles/2022-09-28/us-is-sending-more-artillery-to-ukraine-but-it-won-t-arrive-for-years"
	],
	[
		"2022-09-29",
		"Republicans so far have unsuccessfully pressed the Biden administration to use the leftover $2.1 billion in Ukraine military aid in time. The moves correspond with another Republican push to provide Ukraine with the long-range Army Tactical Missile System that Kyiv has asked for despite the Biden administration’s reluctance.",
		"Республіканці поки що безуспішно тиснули на адміністрацію Байдена, щоб вона вчасно використала залишки військової допомоги Україні в розмірі 2,1 мільярда доларів. Ці кроки відповідають ще одному поштовху республіканців щодо надання Україні армійської тактичної ракетної системи великої дальності, про яку просив Київ, незважаючи на небажання адміністрації Байдена.",
		"https://www.defensenews.com/congress/2022/09/29/republicans-push-biden-to-use-21-billion-ukraine-aid-set-to-expire/"
	],
	[
		"2022-09-30",
		"President Joe Biden announced that the United States \"will continue to support Ukraine's efforts to regain control of its territory by strengthening its hand militarily and diplomatically\".",
		"Президент Джо Байден оголосив, що Сполучені Штати «продовжуватимуть підтримувати зусилля України відновити контроль над своєю територією шляхом зміцнення своєї позиції військовим і дипломатичним шляхом».",
		"https://www.dailymail.co.uk/news/article-11266907/Putin-United-States-created-nuclear-precedent-bombing-Japan.html"
	],
	[
		"2022-09-30",
		"Minister of Defence Christine Lambrecht said during her visit to Odesa that Germany will deliver the first IRIS-T air defence system to Ukraine in the coming days.",
		"Міністр оборони Крістін Ламбрехт під час візиту в Одесу заявила, що Німеччина найближчими днями поставить в Україну першу систему ППО IRIS-T.",
		"https://www.zdf.de/nachrichten/politik/lambrecht-besuch-ukraine-krieg-russland-100.html"
	],
	[
		"2022-10-01",
		"France is preparing to supply Ukraine with a new series of Caesar guns, taken from an order originally intended for Denmark. This supply could relate to 6 to 12 howitzers",
		"Франція готується поставити в Україну нову серію гаубиць Caesar, взяту із замовлення, спочатку призначеного для Данії. Це постачання може стосуватися від 6 до 12 гаубиць",
		"https://www.lemonde.fr/international/article/2022/10/01/la-france-prepare-la-livraison-de-nouveaux-canons-caesar-a-l-ukraine_6143991_3210.html"
	],
	[
		"2022-10-02",
		"Germany, Denmark and Norway will buy 16 Slovak Zuzana-2 howitzers for Ukraine with delivery to begin next year.",
		"Німеччина, Данія та Норвегія закуплять для України 16 словацьких гаубиць Zuzana-2, постачання яких розпочнеться наступного року.",
		"https://www.usnews.com/news/world/articles/2022-10-02/germany-denmark-norway-to-give-ukraine-16-slovak-zuzana-2-howitzers"
	],
	[
		"2022-10-02",
		"The heads of nine European NATO members on Sunday issued a joint statement backing a path to membership for Ukraine in the U.S.-led security alliance, and calling on all 30 NATO nations to ramp up military aid for Kyiv.",
		"Глави дев'яти європейських країн-членів НАТО в неділю виступили зі спільною заявою, в якій підтримують шлях до членства України в очолюваному США безпековому альянсі та закликають усі 30 країн НАТО збільшити військову допомогу Києву.",
		"https://www.cnbc.com/2022/10/02/9-nato-members-urge-support-for-ukraine-after-annexation.html"
	],
	[
		"2022-10-03",
		"Arquus (France) will supply Ukraine with 20 Bastion armored vehicles.",
		"Arquus (Франція) поставить в Україну 20 броньованих машин Bastion.",
		"https://www.latribune.fr/entreprises-finance/industrie/aeronautique-defense/la-france-va-fournir-des-vehicules-blindes-bastion-arquus-a-l-ukraine-935022.html"
	],
	[
		"2022-10-04",
		"The Department of Defense (DoD) announced the authorization of a Presidential Drawdown of security assistance valued at up to $625 million. This package include: 4 High Mobility Artillery Rocket Systems (HIMARS); 16 155mm Howitzers; 16 105mm Howitzers; 200 MaxxPro Mine Resistant Ambush Protected Vehicles and associated ammunition.",
		"Міністерство оборони США оголосило про пакет допомоги на 625 мільйонів доларів. Цей пакет включає: 4 артилерійські ракетні системи високої мобільності (HIMARS); 16 155-мм гаубиць; 16 105-мм гаубиць; 200 протимінних транспортних засобів MaxxPro із захистом від засідки та відповідних боєприпасів.",
		"https://www.defense.gov/News/Releases/Release/Article/3179323/625-million-in-additional-security-assistance-for-ukraine/"
	],
	[
		"2022-10-05",
		"European Parliament speaker Roberta Metsola told that the European Union should deliver tanks to Ukraine and speed up the procedure of having the country join the bloc. \"The Ukrainians need weapons that they can fight with in order to regain their territory, and that means, for example, Leopard II tanks that several members states have.\"",
		"Спікер Європарламенту Роберта Мецола заявила, що Євросоюз має доставити Україні танки та прискорити процедуру вступу країни до блоку. «Українцям потрібна зброя, якою вони можуть воювати, щоб повернути свою територію, і це означає, наприклад, танки Leopard II, які є у кількох держав-членів».",
		"https://www.france24.com/en/live-news/20221005-eu-should-give-tanks-to-ukraine-european-parliament-chief"
	],
	[
		"2022-10-05",
		"Ukraine will receive new upgraded T-72M battle tanks called T-72 Avenger from Czech Republic. ",
		"Україна отримає від Чехії нові модернізовані бойові танки Т-72М під назвою Т-72 «Месник».",
		"https://www.armyrecognition.com/defense_news_october_2022_global_security_army_industry/czech_republic_delivers_t-72_avenger_tanks_to_ukraine_thanks_to_crowdfunding_campaign.html"
	],
	[
		"2022-10-07",
		"Estonian Minister of Defense Hanno Pevkur announced the next military aid package for Ukraine. According to a Ministry of Defence, the package will include artillery shells, anti-tank ammunition, winter uniforms and personal protective equipment.",
		"Міністр оборони Естонії Ханно Певкур анонсував черговий пакет військової допомоги Україні. За даними Міноборони, пакет міститиме артилерійські снаряди, протитанкові боєприпаси, зимову форму та засоби індивідуального захисту.",
		"https://news.err.ee/1608742171/estonia-sends-more-ammunition-protective-equipment-to-ukraine"
	],
	[
		"2022-10-07",
		"EU foreign policy chief Josep Borrell pushed the 27-nation bloc on Friday to earmark more money to pay for the military support of Ukraine.",
		"Верховний представник ЄС із закордонних справ Жозеп Боррель у п’ятницю підштовхнув блок із 27 країн виділити більше грошей на оплату військової підтримки України.",
		"https://www.reuters.com/world/europe/eu-needs-provide-more-money-pay-military-aid-ukraine-top-diplomat-2022-10-07/"
	],
	[
		"2022-10-08",
		"French President Emmanuel Macron has announced that he will step up arms supplies to Ukraine in the wake of criticism that Paris wasn't doing enough to help the war effort.",
		"Президент Франції Еммануель Макрон оголосив, що він збільшить постачання зброї в Україну після критики, що Париж робить недостатньо, щоб допомогти військовим зусиллям.",
		"https://newseu.cgtn.com/news/2022-10-08/Macron-ups-Ukraine-military-aid-after-criticism-over-low-spending-1dWJsVKfsJy/index.html"
	],
	[
		"2022-10-09",
		"The White House said on Sunday it would continue to arm Ukraine but declined direct comment on an explosion that damaged Russia's road-and-rail bridge to Crimea.",
		"У неділю Білий дім заявив, що продовжить озброювати Україну, але відмовився від прямих коментарів щодо вибуху, який пошкодив російський автомобільно-залізничний міст до Криму.",
		"https://www.usnews.com/news/world/articles/2022-10-09/u-s-says-it-will-continue-offering-security-assistance-to-ukraine"
	],
	[
		"2022-10-09",
		"Germany announced new deliveries of weapons to Ukraine, in particular IRIS-T air defense systems and 100 tanks from Greece and Slovakia, said German Defense Minister Christine Lambrecht during a visit to Lithuania.",
		"Німеччина оголосила про нові поставки зброї в Україну, зокрема систем ППО IRIS-T і 100 танків з Греції та Словаччини, повідомила міністр оборони ФРН Крістін Ламбрехт під час візиту до Литви.",
		"https://apa.az/en/europe/germany-announces-new-weapon-deliveries-to-ukraine-386667"
	],
	[
		"2022-10-09",
		"Jaroslaw Nagy, Slovakia's Defence Minister announced the transfer of two Zuzana 2 self-propelled artillery units to Ukraine.",
		"Міністр оборони Словаччини Ярослав Надь повідомив про передачу Україні двох самохідних артилерійських установок Zuzana 2.",
		"https://news.yahoo.com/gift-aggressor-putin-slovakia-handed-080018294.html"
	],
	[
		"2022-10-09",
		"Over the next few days, Spain will send 12 more heavy trucks to Ukraine. Spanish Defense Minister Margarita Robles said that starting from next month, more Ukrainian soldiers will arrive in the country for training.",
		"Найближчими днями Іспанія відправить в Україну ще 12 великовагових вантажівок. Міністр оборони Іспанії Маргарита Роблес повідомила, що з наступного місяця до країни прибуде більше українських військових для навчання.",
		"https://www.urdupoint.com/en/world/spain-sends-5-tons-of-humanitarian-aid-to-ukr-1574250.html"
	],
	[
		"2022-10-10",
		"French President Emmanuel Macron expressed his “extreme concern” about Russian strikes during a call with his Ukrainian counterpart Volodymyr Zelensky and promised that France would increase military aid.",
		"Президент Франції Еммануель Макрон під час телефонної розмови з українським колегою Володимиром Зеленським висловив «надзвичайну стурбованість» російськими ударами та пообіцяв, що Франція збільшить військову допомогу.",
		"https://www.thelocal.fr/20221010/macron-tells-zelensky-of-extreme-concern-and-pledges-more-military-aid/"
	],
	[
		"2022-10-10",
		"EU foreign policy chief Josep Borrell said he was \"deeply shocked\" by Russia's targeted missile strikes: \"We stand with Ukraine. Additional military support from the EU is on its way.\"",
		"Верховний представник ЄС із закордонних справ Жозеп Боррель заявив, що «глибоко шокований» цілеспрямованими ракетними ударами Росії: «Ми підтримуємо Україну. Додаткова військова підтримка з боку ЄС вже на шляху».",
		"https://www.msn.com/en-au/news/world/eu-foreign-policy-chief-josep-borrell-said-he-was-deeply-shocked-by-russias-targeted-missile-strikes-monday-on-kyiv-and-other-parts-of-ukraine/ar-AA12MO4k"
	],
	[
		"2022-10-10",
		"The United States will soon be unable to provide Ukraine with certain types of ammunition that are essential to battle against Russia’s invasion, as supplies are being used up faster than they can be replaced.",
		"Сполучені Штати незабаром не зможуть забезпечити Україну певними видами боєприпасів, які необхідні для боротьби з вторгненням Росії, оскільки запаси витрачаються швидше, ніж їх можна замінити.",
		"https://www.thedefensepost.com/2022/10/10/us-ammunition-supplies-dwindle/"
	],
	[
		"2022-10-11",
		"Australian government is preparing to deliver another round of military assistance to Ukraine. Their Defence personnel will travel to Europe to help train Ukrainian soldiers.",
		"Уряд Австралії готується надати Україні черговий пакет військової допомоги. Їхні військовослужбовці вирушать до Європи, щоб допомагати навчати українських військових.",
		"https://www.theage.com.au/politics/federal/australia-considers-sending-defence-staff-to-train-ukrainian-troops-20221011-p5bovw.html"
	],
	[
		"2022-10-11",
		"Canada said on Tuesday it will send 40 more combat engineers to help support Polish efforts to train Ukrainian forces, as part of its commitment to increasing military aid for Ukraine.",
		"Канада заявила, що відправить ще 40 інженерів для підтримки польських зусиль у навчанні українських військ, як частину свого зобов’язання щодо збільшення військової допомоги Україні.",
		"https://www.reuters.com/world/canada-send-40-combat-engineers-poland-train-ukraine-soldiers-minister-2022-10-11/"
	],
	[
		"2022-10-12",
		"Canadian Defence Minister Anita Anand announced a new military aid package over C$47 million ($34 million) to assist Ukraine in dealing with Russia's invasion, with the package including artillery rounds, satellite communications, winter clothing and drone cameras, among other assistance.",
		"Міністр оборони Канади Аніта Ананд оголосила про новий пакет військової допомоги на суму понад 47 мільйонів канадських доларів (34 мільйона доларів США), щоб допомогти Україні впоратися з вторгненням Росії, серед іншого пакет включає артилерійські снаряди, супутниковий зв’язок, зимовий одяг і камери для дронів.",
		"https://www.reuters.com/world/canada-announces-new-military-package-ukraine-after-russian-missile-attacks-2022-10-12/"
	],
	[
		"2022-10-12",
		"According to German Ministry of Defence's twitter, \"In the next few weeks, more PzH2000 and MARSII will be handed over to Ukraine\".",
		"Згідно з твіттером міністерства оборони Німеччини, «протягом наступних кількох тижнів Україні буде передано більше PzH2000 і MARSII».",
		"https://twitter.com/BMVg_Bundeswehr/status/1580177624516947971"
	],
	[
		"2022-10-13",
		"The UK and France have pledged to help improve Ukraine's defences. London promised to send air defence missiles, while Paris said it would deliver its own anti-aircraft defence systems.",
		"Велика Британія та Франція пообіцяли допомогти покращити оборону України. Лондон пообіцяв надіслати ракети протиповітряної оборони, а Париж заявив, що поставить власні системи протиповітряної оборони.",
		"https://www.euronews.com/my-europe/2022/10/12/nato-allies-set-to-boost-military-support-to-ukraine-at-two-day-meeting"
	],
	[
		"2022-10-13",
		"NATO chief Jens Stoltenberg said Spain was sending 4 medium-range air defense systems to Ukraine.",
		"Глава НАТО Єнс Столтенберг заявив, що Іспанія надсилає в Україну 4 системи ППО середньої дальності.",
		"https://www.thelocal.es/20221014/spain-to-send-air-defence-systems-to-ukraine-nato-chief/"
	],
	[
		"2022-10-13",
		"Portugal Defense Minister Helena Carreiras announced transfer of 6 Russian Kamov helicopters to Ukraine. ",
		"Міністр оборони Португалії Хелена Каррейрас повідомила про передачу Україні 6 російських вертольотів Камов.",
		"https://www.theportugalnews.com/news/2022-10-13/portugal-to-send-broken-helicopters-to-ukraine/71186"
	],
	[
		"2022-10-13",
		"Minister of National Defence of Lithuania Arvydas Anušauskas announced transfer of \"M113-mounted 120mm mortars, armoured vehicles, thermal vision devices, drones, and other equipment\" to Ukraine.",
		"Міністр національної оборони Литви Арвідас Анушаускас заявив про передачу Україні «120-мм мінометів, встановлених на М113, бронетехніки, тепловізійних приладів, безпілотників та іншої техніки».",
		"https://www.delfi.lt/en/politics/lithuania-transfers-to-ukraine-mortar-carriers-and-armoured-vehicles.d?id=91480615"
	],
	[
		"2022-10-14",
		"The Department of Defense announced the 23rd authorization of a Presidential Drawdown of security assistance to Ukraine valued at up to $725 million. This drawdown includes 200 High Mobility Multipurpose Wheeled Vehicles (HMMWV) HIMARS rockets, artillery rounds, anti-tank weapons, high-speed anti-radiation missiles (HARMs), small arms and ammunition.",
		"Міністерство оборони США оголосило про 23-й пакет допомоги Україні на суму до 725 мільйонів доларів. Він включає 200 багатоцільових колісних транспортних засобів високої мобільності (HMMWV), ракети HIMARS, артилерійські снаряди, протитанкову зброю, високошвидкісні протирадіаційні ракети (HARM), стрілецьку зброю та боєприпаси.",
		"https://www.defense.gov/News/Releases/Release/Article/3189571/725-million-in-additional-security-assistance-for-ukraine/"
	],
	[
		"2022-10-14",
		"Democrats on Capitol Hill have suggested transferring US weapons systems in Saudi Arabia to Ukraine and suspending a planned transfer of Patriot missiles to Riyadh",
		"Демократи на Капітолійському пагорбі запропонували передати Україні системи озброєнь США в Саудівській Аравії та призупинити заплановану передачу Ер-Ріяду ракет Patriot.",
		"https://www.theguardian.com/us-news/2022/oct/14/democrats-us-weapons-systems-saudi-arabia-ukraine"
	],
	[
		"2022-10-16",
		"Germany handed over Biber tank bridge-layers to Ukraine.",
		"Німеччина передала Україні танкові мостоукладачі Biber.",
		"https://en.defence-ua.com/events/ukraine_gets_16_bridge_laying_tanks_as_germany_hands_them_over-4552.html"
	],
	[
		"2022-10-16",
		"Ukraine on Tuesday received the first of four IRIS-T air defence systems Germany promised to supply",
		"Україна у вівторок отримала першу з чотирьох систем ППО IRIS-T, які Німеччина обіцяла поставити)",
		"https://www.reuters.com/world/europe/ukraine-has-received-iris-t-air-defence-system-germany-spiegel-2022-10-11/"
	],
	[
		"2022-10-16",
		"Israeli Minister of Diaspora Affairs Nachman Shai has said that military aid should be provided to Ukraine in view of recent reports about Iran's possible supply of ballistic missiles to Russia.",
		"Міністр у справах діаспори Ізраїлю Нахман Шаї заявив, що Україні необхідно надати військову допомогу з огляду на останні повідомлення про можливе постачання Іраном Росії балістичних ракет.",
		"https://twitter.com/DrNachmanShai/status/1581579455650492416"
	],
	[
		"2022-10-18",
		"Italy has provided Ukraine with the 5th military aid package. There was no disclosure what was included into it.",
		"Італія надала Україні 5-й пакет військової допомоги. Не було розголошено, що там було включено.",
		"https://finance.yahoo.com/news/italy-provides-ukraine-fifth-military-110100850.html"
	],
	[
		"2022-10-18",
		"The Biden administration laid out its vision for the Senate version of the annual Pentagon policy bill on a range of issues. It also asked Congress to include new authorities in the bill, including for military support to Ukraine.",
		"Адміністрація Байдена виклала своє бачення сенатської версії щорічного законопроекту про політику Пентагону з низки питань. Він також звернувся до Конгресу з проханням включити до законопроекту нові повноваження, включно з військовою підтримкою України.",
		"https://rollcall.com/2022/10/18/white-house-seeks-more-ukraine-weapons-support-in-senate-ndaa/"
	],
	[
		"2022-10-18",
		"NATO will deliver air defence systems to Ukraine in coming days to help the country defend itself against the drones, including those from Iran, that Russia is using to target critical infrastructure, the alliance's secretary-general said on Tuesday.",
		"Генеральний секретар альянсу заявив у вівторок, що найближчими днями НАТО доставить Україні системи ППО, щоб допомогти країні захиститися від безпілотників",
		"https://www.reuters.com/world/europe/ukraine-get-anti-drone-systems-coming-days-natos-stoltenberg-says-2022-10-18/"
	],
	[
		"2022-10-18",
		"The Pentagon is considering paying for Elon Musk’s Starlink satellite network in Ukraine",
		"Пентагон розглядає можливість оплати супутникової мережі Starlink Ілона Маска в Україні.",
		"https://www.euractiv.com/section/global-europe/news/pentagon-considers-funding-musks-starlink-network-for-ukraine/"
	],
	[
		"2022-10-18",
		"The French Defence Minister announced that France will supply Ukraine with Crotale air defence systems",
		"Міністр оборони Франції повідомив, що Франція поставить Україні системи ППО Crotale",
		"https://www.republicworld.com/amp/world-news/russia-ukraine-crisis/france-proposes-to-train-2000-ukrainian-soldiers-amid-russia-ukraine-war-articleshow.html"
	],
	[
		"2022-10-19",
		"Israel has refused a Ukrainian request for air defenses against the barrage of Russian attacks enabled by Iranian drones.",
		"Ізраїль відхилив прохання України про протиповітряну оборону від шквалу російських атак іранських безпілотників.",
		"https://www.washingtonexaminer.com/policy/defense-national-security/israel-rejects-ukraine-military-aid-russia-threat"
	],
	[
		"2022-10-20",
		"Czech Republic prepares new military aid package for Ukraine. Two weeks ago provided aid was almost CZK 400 million ($7.5 million), and today is CZK 22 million ($413,193). Defense minister apologized that she couldn't provide detailes.",
		"Чехія готує новий пакет військової допомоги Україні. Два тижні тому надана допомога становила майже 400 мільйонів чеських крон (7,5 мільйона доларів), а сьогодні – 22 мільйони чеських крон (413 193 доларів). Міністр оборони вибачилася, що не може надати подробиць.",
		"https://sports.yahoo.com/czech-republic-prepares-military-aid-091300386.html"
	],
	[
		"2022-10-20",
		"Germany delivers to Ukraine four Hensoldt’s TRML-4D multifunction radar for IRIS-T SLM air defence system.",
		"Німеччина поставить в Україну чотири багатофункціональні радари Hensoldt TRML-4D для системи ППО IRIS-T SLM.",
		"https://www.armyrecognition.com/defense_news_october_2022_global_security_army_industry/hensoldt_delivers_trml-4d_high-performance_air_defence_radars_for_ukraine.html"
	],
	[
		"2022-10-21",
		"\"Arguably, Ukraine would not have been able to sustain Russia’s aggression if it had relied solely on European support to fight the war\", says CEPS think tank in their recent report on military aid to Ukraine. They also point at \"absence of clear leadership within the EU in coordinating the delivery of military aid to Ukraine\"",
		"«Можливо, Україна не змогла б витримати агресію Росії, якби вона покладалася виключно на європейську підтримку для ведення війни», — йдеться в останньому звіті аналітичного центру CEPS про військову допомогу Україні. Також вказують на «відсутність чіткого лідерства всередині ЄС у координації постачання військової допомоги Україні».",
		"https://www.ceps.eu/ceps-publications/assessing-the-eus-military-assistance-to-ukraine/"
	],
	[
		"2022-10-23",
		"Israel is providing Ukraine with intelligence on Iranian-made drones.",
		"Ізраїль надає Україні інформацію щодо іранських безпілотників",
		"https://www.haaretz.com/israel-news/2022-10-13/ty-article/.premium/report-israel-providing-ukraine-with-intel-on-russias-iranian-drones/00000183-cfd6-d8cc-afc7-fffe2a4c0000"
	],
	[
		"2022-10-23",
		"Ukraine not cooperating with Israel on proposed missile alert system. Israeli officials believe Kyiv may be unhappy with the offer, as Jerusalem is refusing to supply it with interceptor systems. ",
		"Україна не співпрацює з Ізраїлем щодо запропонованої системи оповіщення про ракети. Ізраїльські офіційні особи вважають, що Київ може бути незадоволений цією пропозицією, оскільки Єрусалим відмовляється постачати системи перехоплення.",
		"https://www.timesofisrael.com/report-ukraine-not-cooperating-with-israel-on-proposed-missile-alert-system/amp/"
	],
	[
		"2022-10-23",
		"The Chicago Council on Global Affairs published report on its 2022 survey of American public opinion on U.S. foreign policy. It states that nearly three-quarters of Americans support continuing economic (71%) and military (72%) aid to Ukraine, and 58 percent are willing to continue to support the country “as long as it takes,” even if U.S. households will have to pay higher prices for gas and food.",
		"Чиказька Рада з Глобальних Справ (The Chicago Council on Global Affairs) опублікувала звіт про своє дослідження американської громадської думки щодо зовнішньої політики США у 2022 році. У ньому зазначено, що майже три чверті американців підтримують продовження економічної (71%) і військової (72%) допомоги Україні, а 58 відсотків готові продовжувати підтримувати країну «стільки, скільки буде потрібно», навіть якщо домогосподарства США будуть змушені платити вищі ціни за газ і їжу.",
		"https://www.globenewswire.com/Tracker?data=HXZ99wjde4jpd6JgTqs5_NgXH3mN-J5ItQVi_S1DYqudES_rYm6LC1OTT4EAapZeBRy3Nq4Jq0edpSI85VcjrWWkRgFtFNKz-0NeqK-t4NTDXPwKJzJteJFhpIsnMmBCHomLM9OI5mv8QFb5B9J1K61amudc5IuzoZ8sxzaAHZjnaQGAIP3t03b8os9wToOaKAMSsymXQMbGppdmNLi3ee-QQVzI3P2lPrjNTYfjUtcUOwE3-CwDv5nc6iwKXxRK3dwTvRqjxrXzrwJNDw5BVA=="
	],
	[
		"2022-10-25",
		"The United States is considering sending older HAWK air defense equipment from storage to Ukraine",
		"Сполучені Штати розглядають можливість відправлення Україні старих засобів протиповітряної оборони HAWK",
		"https://www.reuters.com/world/europe/exclusive-us-considers-hawk-air-defense-equipment-ukraine-say-us-officials-2022-10-25/"
	],
	[
		"2022-10-25",
		"30 lawmakers from the liberal wing of the Democratic Party pressed Biden in a letter to seek direct talks with Moscow. The letter didn’t explicitly threaten votes against further aid but it propose to \"pair the military and economic support the United States has provided to Ukraine with a proactive diplomatic push, redoubling efforts to seek a realistic framework for a ceasefire\". This letter has been recalled the next day.",
		"30 законодавців від ліберального крила Демократичної партії натиснули на Байдена в листі, щоб він домагався прямих переговорів з Москвою. У листі прямо не погрожували голосувати проти подальшої допомоги, але в ньому пропонується «поєднати військову та економічну підтримку, яку Сполучені Штати надали Україні, з активним дипломатичним поштовхом, подвоюючи зусилля для пошуку реалістичних рамок для припинення вогню». Цей лист був відкликаний наступного дня.",
		"https://www.washingtonpost.com/politics/2022/10/25/bidens-ukraine-policy-faces-bipartisan-squeeze/"
	],
	[
		"2022-10-25",
		"On Tuesday, October 25, 2022, German President Frank-Walter Steinmeier announced the delivery to Ukraine of two more MARS II M270 MLRS and four PzH 2000 155mm tracked self-propelled howitzers, as well as new air defense missile systems.",
		"Президент Німеччини Франк-Вальтер Штайнмаєр анонсував поставку в Україну ще двох РСЗВ MARS II M270 та чотирьох 155-мм гусеничних самохідних гаубиць PzH 2000, а також систем ППО",
		"https://www.armyrecognition.com/defense_news_october_2022_global_security_army_industry/germany_to_supply_ukraine_with_two_more_mars_ii_rocket_launchers_and_4_pzh_2000_155mm_howitzers.html"
	],
	[
		"2022-10-25",
		"Prime Minister Denys Shmyhal has announced an agreement with Germany on the increase of military aid for Ukraine in 2023 from EUR 690 million to more than EUR 2 billion.",
		"Прем'єр-міністр Денис Шмигаль заявив про домовленість з Німеччиною про збільшення військової допомоги Україні у 2023 році з 690 млн євро до понад 2 млрд євро.",
		"https://ukranews.com/en/news/890294-ukraine-agrees-with-germany-on-military-aid-increase-from-eur-690-million-to-eur-2-billion-in-2023"
	],
	[
		"2022-10-25",
		"The Biden administration's lifting of the U.S. arms embargo on Cyprus on Oct. 1 has rekindled the prospect of Nicosia transferring its Russian military arsenal to Ukraine in return for Western-made weaponry.",
		"Скасування адміністрацією Байдена ембарго США на постачання зброї на Кіпр 1 жовтня відродило перспективу того, що Нікосія передасть свій російський військовий арсенал Україні в обмін на зброю західного виробництва.",
		"https://www.forbes.com/sites/pauliddon/2022/10/25/cyprus-could-transfer-its-russian-weaponry-to-ukraine-if-guaranteed-swift-replacements/?sh=3a9ec7583d7d"
	],
	[
		"2022-10-26",
		"Up to 70 Australian defence force personnel will be deployed to the UK to train Ukrainian troops in the latest increase in Australia’s support for Kyiv. The Albanese government will provide Ukraine with 30 more Bushmaster protected mobility vehicles.",
		"До 70 військовослужбовців австралійських сил оборони буде направлено до Сполученого Королівства для навчання українських військових у рамках останнього збільшення підтримки Києва Австралією. Уряд Албанії надасть Україні ще 30 захищених мобілів Bushmaster.",
		"https://www.theguardian.com/australia-news/2022/oct/26/australian-defence-force-troops-to-train-ukrainian-soldiers-in-the-uk"
	],
	[
		"2022-10-26",
		"Sweden MoD could provide Ukraine with 12 of their 48 Archer 155mm 6x6 self-propelled howitzers",
		"Міноборони Швеції може надати Україні 12 із своїх 48 самохідних гаубиць Archer 155 мм 6x6",
		"https://www.armyrecognition.com/defense_news_october_2022_global_security_army_industry/sweden_mod_could_provide_ukraine_with_12_archer_155mm_8x8_self-propelled_howitzers.html"
	],
	[
		"2022-10-26",
		"Italian Prime Minister Giorgia Meloni said the only way to facilitate a peace deal between Russia and Ukraine is by helping Kyiv defend itself militarily.",
		"Прем’єр-міністр Італії Джорджія Мелоні заявила, що єдиний спосіб сприяти укладенню мирної угоди між Росією та Україною – це допомогти Києву захистити себе військовим шляхом.",
		"https://www.aljazeera.com/news/2022/10/26/meloni-wins-final-confidence-vote-pledges-support-for-ukraine"
	],
	[
		"2022-10-27",
		"The Pentagon is sending Ukraine a new $275 million package of weapons and other aid. Officials said there are no major new weapons in the package",
		"Пентагон надсилає Україні новий пакет зброї та іншої допомоги на суму 275 мільйонів доларів. Офіційні особи сказали, що в пакеті немає серйозної нової зброї",
		"https://apnews.com/article/russia-ukraine-europe-government-and-politics-db8dbbe1ce0032550208a43824853ad5"
	],
	[
		"2022-10-28",
		"South Korean President Yoon Suk-yeol has denied that Seoul provided any lethal weapons to Ukraine after Russian President Vladimir Putin said such a decision would destroy their bilateral relations.",
		"Президент Південної Кореї Юн Сук Йоль заперечив, що Сеул надав Україні будь-яку летальну зброю після того, як Путін заявив, що таке рішення зруйнує їхні двосторонні відносини",
		"https://www.aljazeera.com/news/2022/10/28/south-korea-denies-sending-weapons-to-ukraine-after-putin-remark"
	],
	[
		"2022-10-28",
		"At a conference in Moscow on Thursday, President Putin threatened South Korea with retaliation from North Korea if South Korea will continue to support Ukraine.",
		"На конференції в Москві в четвер Путін пригрозив Південній Кореї помстою з боку Північної Кореї, якщо Південна Корея продовжить підтримувати Україну.",
		"https://www.aljazeera.com/news/2022/10/28/south-korea-denies-sending-weapons-to-ukraine-after-putin-remark"
	],
	[
		"2022-10-29",
		"Slovenia handed over 28 modernized M-55S tanks to the Armed Forces of Ukraine.",
		"Словенія передала Збройним силам України 28 модернізованих танків М-55С.",
		"https://sundries.com.ua/en/ukraine-received-28-modernized-m-55s-tanks-with-a-new-gun-and-a-powerful-engine/"
	],
	[
		"2022-10-30",
		"Italy and France will supply Ukraine with SAMP-T Air Defense Systems. ",
		"Італія та Франція постачатимуть Україні ЗРК SAMP-T.",
		"https://www.reddit.com/r/UkrainianConflict/comments/yher1x/italy_and_france_will_supply_ukraine_with_sampt/"
	],
	[
		"2022-10-30",
		"The Swedish authorities are going to transfer more modern and heavier weapons to Ukraine, the new Swedish Defence Minister Paul Johansson has said, Dagens Nyheter reported. According to him, in particular, this applies to air defense systems.",
		"Влада Швеції збирається передати Україні більш сучасне та важке озброєння, заявив новий міністр оборони Швеції Пауль Йоханссон, повідомляє Dagens Nyheter. За його словами, зокрема, це стосується систем ППО.",
		"https://news.am/eng/news/727632.html"
	],
	[
		"2022-10-30",
		"The Italian Government has approved the supply of six PzH 2000 155mm self-propelled howitzers, two M270 MLRS (Multiple Launch Rocket System), 20 to 30 M109L 155mm self-propelled howitzers and dozen of M113 tracked APCs.",
		"Уряд Італії схвалив постачання шести 155-мм самохідних гаубиць PzH 2000, двох РСЗВ M270 (реактивних систем залпового вогню), від 20 до 30 155-мм самохідних гаубиць  M109L та дюжини гусеничних БТРів М113.",
		"https://www.repubblica.it/esteri/2022/10/29/news/ucraina_kiev_armi_italia-372176795/"
	],
	[
		"2022-10-31",
		"Bulgaria doesn’t send weapons to Ukraine but Bulgarian arms manufacturers has so far supplied at least €1 billion of weapons and ammunition to Ukraine via brokers.",
		"Болгарія не постачає зброї в Україну, але болгарські виробники зброї   через посередників наразі поставили в Україну зброї та боєприпасів щонайменше на 1 мільярд євро.",
		"https://www.euractiv.com/section/all/short_news/bulgaria-doesnt-send-weapons-to-ukraine-but-arms-industry-flourishes/"
	],
	[
		"2022-10-31",
		"Israel will provide Ukraine with military communication systems.",
		"Ізраїль надасть Україні військові системи зв'язку.",
		"https://m.jpost.com/breaking-news/article-721137"
	],
	[
		"2022-10-31",
		"Ukraine receives first Armtrac 400 mine clearing vehicle from UK.",
		"Україна отримала від Великобританії першу машину для розмінування Armtrac 400.",
		"https://www.armyrecognition.com/ukraine_-_russia_conflict_war_2022/ukraine_receives_first_armtrac_400_mine_clearing_vehicle_from_uk.html"
	],
	[
		"2022-10-31",
		"Recent poll shows that despite a large proportion of Britons saying the situation in Ukraine is impacting their cost of living, few oppose supporting Ukraine through the conflict. Six in 10 (60%) support Britain’s current role in the conflict, including providing a range of economic, humanitarian and defensive military assistance to Ukraine, as well as imposing additional sanctions on Russia and Belarus.",
		"Нещодавнє опитування показує, що незважаючи на те, що значна частина британців каже, що ситуація в Україні впливає на їхню вартість життя, мало хто виступає проти підтримки України в конфлікті. Шість із 10 (60%) підтримують нинішню роль Великобританії в конфлікті, включаючи надання Україні допомоги  в економічній, гуманітарній та військовій сферах , а також запровадження додаткових санкцій проти Росії та Білорусі.",
		"https://www.ipsos.com/en-uk/public-continues-support-britains-role-ukraine-conflict"
	],
	[
		"2022-11-02",
		"Turkish drone maker Baykar is planning to complete the construction of its manufacturing plant in Ukraine in two years.",
		"Турецький виробник безпілотників Baykar планує завершити будівництво свого заводу в Україні за два роки.",
		"https://militaryleak.com/2022/11/02/turkish-drone-maker-baykar-to-complete-plant-in-ukraine-in-two-years/"
	],
	[
		"2022-11-02",
		"According to journalist and political analyst Nikola Mikovic, the Jewish state could eventually start providing weapons to Ukraine – although Israeli officials are unlikely to publicly confirm it.",
		"За словами журналіста та політолога Ніколи Міковича, єврейська держава може зрештою почати постачати зброю в Україну, хоча ізраїльські офіційні особи навряд чи публічно це підтвердять.",
		"https://theloop.ecpr.eu/ukraine-has-asked-israel-for-weapons-support-and-they-might-eventually-get-it/"
	],
	[
		"2022-11-02",
		"The Jamestown Foundation has assessed that the true amount for Russian defense spending in 2022 may well reach as much as 5.5 trillion rubles ($90.9 billion) by the end of the year. If the rate of military aid to Ukranian will remain the same till the end of 2022, it will be just 62% of Russian military budget.",
		"За оцінкою Джеймстаунського фонду дійсна сума російських витрат на оборону в 2022 році цілком може сягнути 5,5 трильйонів рублів (90,9 мільярдів доларів) до кінця року. Якщо темп військової допомоги Україні залишиться таким же до кінця 2022 року, то він становитиме лише 62% російського військового бюджету.",
		"https://www.newsweek.com/fact-check-ukraine-military-aid-russia-defense-budget-1756393"
	],
	[
		"2022-11-03",
		"German Defence Minister Christine Lambrecht had written to the government in Bern asking for permission to supply 12,400 rounds of Swiss-made ammunition for Gepard anti-aircraft tanks, but Switzerland has again rejected an appeal from Germany to allow it to re-export Swiss-made ammunition to Ukraine. ",
		"Міністр оборони Німеччини Крістін Ламбрехт звернулася до уряду в Берні з проханням надати дозвіл на поставку 12 400 боєприпасів швейцарського виробництва для зенітних танків Gepard, але Швейцарія знову відхилила звернення Німеччини дозволити їй реекспорт швейцарського виробництва. боєприпасів в Україну.",
		"https://www.reuters.com/world/europe/swiss-government-rejects-german-request-re-export-swiss-ammunition-ukraine-2022-11-03/"
	],
	[
		"2022-11-03",
		"Bulgarian lawmakers approved the first military aid shipments to Ukraine, ending months of resistance from Russia-friendly political parties and the nation’s president.",
		"Болгарські законодавці схвалили перші поставки військової допомоги Україні, поклавши край місяцям опору з боку дружніх до Росії політичних партій і президента країни.",
		"https://www.bloomberg.com/news/articles/2022-11-03/bulgaria-breaks-taboo-and-backs-first-military-aid-for-ukraine"
	],
	[
		"2022-11-04",
		"France Plans to Provide Ukraine with Crotale Surface-to-air Missile System",
		"Франція планує надати Україні зенітно-ракетний комплекс Crotale",
		"https://militaryleak.com/2022/11/04/france-plans-to-provide-ukraine-with-crotale-surface-to-air-missile-system/"
	],
	[
		"2022-11-04",
		"The United States announced an additional $400 million in military aid to Ukraine from USAI fund, which includes money to refurbish HAWK air defense missiles and 45 Czech T-72B tanks, 1,100 Phoenix Ghost drones, 40 armored riverine boats, funding to refurbish 250 M-1117 armored vehicles, tactical secure communications systems, surveillance systems and funding for training, maintenance and sustainment.",
		"Сполучені Штати оголосили про виділення Україні додаткових 400 мільйонів доларів військової допомоги від фонду USAI, який включає кошти на відновлення ракет ППО HAWK, 45 оновлених танків T-72B, 1100 дронів Phoenix Ghost, 40 броньованих річкових катерів, фінансування на відновлення 250 броньованих машин M-1117, тактичні системи безпечного зв'язку, системи спостереження та фінансування навчання, технічного обслуговування та забезпечення.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3210698/aid-package-to-ukraine-includes-t-72b-tanks/"
	],
	[
		"2022-11-04",
		"Italian Premier Giorgia Meloni's new government is set to approve Italy's sixth package of military aid for Ukraine.",
		"Новий уряд прем'єр-міністра Італії Джорджії Мелоні має намір затвердити шостий пакет військової допомоги Італії Україні.",
		"https://www.ansa.it/english/news/politics/2022/11/04/ukraine-sixth-military-aid-package-coming-says-crosetto_eb40769e-b41e-4f0f-bdb9-5d2633ad7529.html"
	],
	[
		"2022-11-04",
		"The Norwegian Government is preparing to contribute approximately 1,5 billion NOK to the British-led International Fund for Ukraine. Norwegian Minister of defence Bjørn Arild Gram did not specify what type of military equipment will be purchased through this contribution.",
		"Уряд Норвегії готується внести близько 1,5 мільярда норвезьких крон до Міжнародного фонду для України під керівництвом Великобританії. Міністр оборони Норвегії Бйорн Арільд Грам не уточнив, який тип військової техніки буде закуплено за рахунок цього внеску.",
		"https://www.regjeringen.no/en/aktuelt/ukfund/id2946620/"
	],
	[
		"2022-11-05",
		"The Ministries of Defense of the Netherlands, the Czech Republic and the US Department of Defense jointly announced about reaching an agreement to support Ukraine by overhauling 90 T-72B tanks.",
		"Міністерства оборони Нідерландів, Чехії та Міністерства оборони США спільно заявили про досягнення домовленості про підтримку України капітальним ремонтом 90 танків Т-72Б.",
		"https://en.defence-ua.com/weapon_and_tech/the_czech_republic_to_update_90_t_72b_tanks_for_ukraine_worth_1_million_dollars_each_the_arrival_dates_of_vehles_are_named-4755.html"
	],
	[
		"2022-11-06",
		"Ukraine wants to raise funds for a fleet of maritime drones",
		"Україна хоче зібрати кошти на флот морських безпілотників",
		"https://www.brusselstimes.com/317853/ukraine-wants-to-raise-funds-for-a-fleet-of-maritime-drones"
	],
	[
		"2022-11-07",
		"The report by the Royal United Services Institute (Rusi) urges western governments to reconsider their decision not to include aircraft in the offensive weaponry supplied to Ukraine.",
		"У доповіді Королівського інституту об’єднаних служб (Rusi) закликають західні уряди переглянути своє рішення не включати літаки до складу наступальних озброєнь, які постачаються в Україну.",
		"https://www.thetimes.co.uk/article/send-ukraine-jets-to-counter-putins-drone-war-west-urged-lq2bj7p7c"
	],
	[
		"2022-11-08",
		"The Italian government is readying a new arms package for Ukraine including air defence systems, a governing coalition official said on Tuesday.",
		"Уряд Італії готує новий пакет озброєнь для України, включаючи системи протиповітряної оборони, заявив у вівторок представник правлячої коаліції.",
		"https://news.yahoo.com/italy-open-supplying-air-defence-160248852.html"
	],
	[
		"2022-11-08",
		"Sweden’s new center-right government has presented its budget for 2023. It says Sweden will increase its military aid to Ukraine & “the more advanced weapons systems requested by Ukraine will be prioritized.”",
		"Новий правоцентристський уряд Швеції представив свій бюджет на 2023 рік. У ньому говориться, що Швеція збільшить свою військову допомогу Україні, і «пріоритетом будуть більш досконалі системи озброєнь, які запитує Україна».",
		"https://twitter.com/visegrad24/status/1590049608583237632"
	],
	[
		"2022-11-10",
		"Spain will send two more U.S.-made HAWK air defence systems to Ukraine in addition to four shipped last week, Spanish Defence Minister Margarita Robles said on Thursday.",
		"Міністр оборони Іспанії Маргарита Роблес повідомила в четвер, що Іспанія надішле в Україну ще дві системи протиповітряної оборони американського виробництва HAWK на додаток до чотирьох, надісланих минулого тижня.",
		"https://www.usnews.com/news/world/articles/2022-11-10/spain-to-send-two-more-hawk-air-defence-systems-to-ukraine"
	],
	[
		"2022-11-10",
		"The Defence Department announced today $400 mln security assistance package which includes: HAWK missiles, the Avenger short-range air defense systems, ammunition for the High Mobility Artillery Rocket System, 21,000 155 mm artillery rounds, 500 precision-guided 155 mm artillery rounds, 10,000 120 mm mortar rounds, 100 High Mobility Multipurpose Wheeled Vehicles (HUMVEE), 400 grenade launchers, small arms, optics and more than 20,000,000 rounds of small arms ammunition. It also includes demolition equipment for obstacle clearing and cold weather protective gear.",
		"Сьогодні Міністерство оборони США оголосило про пакет допомоги у сфері безпеки на суму 400 мільйонів доларів США, який включає: ракети HAWK, системи протиповітряної оборони малої дальності Avenger, боєприпаси для артилерійської ракетної системи високої мобільності, 21 000 155-мм артилерійських снарядів, 500 високоточних 155-мм артилерійських снарядів, 10 000 120-мм міномети, 100 багатоцільових колісних машин високої мобільності (HUMVEE), 400 гранатометів, стрілецьку зброю, оптику та понад 20 000 000 набоїв до стрілецької зброї. Він також включає в себе обладнання для підриву для прибирання перешкод і захисне спорядження в холодну погоду.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3216745/400-million-security-package-headed-to-ukraine/"
	],
	[
		"2022-11-10",
		"Some 175 Bulgarian lawmakers voted in favor of a six-point plan to provide military aid to Ukraine, detailing which weapons could be delivered to Kyiv, Wilhelmine Preussen reports. Another 49 voted against the motion. ",
		"Близько 175 болгарських депутатів проголосували за план із шести пунктів надання військової допомоги Україні, в якому детально зазначено, яку зброю можна буде доставити до Києва, повідомляє Вільгельміна Пройссен. Ще 49 проголосували проти.",
		"https://www.armyrecognition.com/defense_news_november_2022_global_security_army_industry/bulgaria_could_deliver_sovit-era_tanks_and_apcs_to_ukraine_in_exchange_for_modern_replacements.html"
	],
	[
		"2022-11-11",
		"The U.S. will buy 100,000 rounds of howitzer artillery from South Korean manufacturers to provide to Ukraine, a U.S. official said Thursday, in a deal the two governments have been working on for some time.",
		"США закуплять у південнокорейських виробників 100 000 артилерійських снарядів для гаубиць, які вони нададуть Україні, заявив у четвер офіційний представник США, у рамках угоди, над якою обидва уряди працювали протягом деякого часу.",
		"https://apnews.com/article/russia-ukraine-europe-business-south-korea-government-and-politics-15569a7bfdb6c53404cfce5f0df1c28f"
	],
	[
		"2022-11-11",
		"The Swedish government will soon decide on the transfer of advanced weapons to Ukraine, Defense Minister Paul Jonsson said. What types of weapons are in question is still unknown.",
		"Уряд Швеції найближчим часом прийме рішення про передачу новітнього озброєння Україні, заявив міністр оборони Пауль Йонссон. Про які види зброї йдеться, поки невідомо.",
		"https://twitter.com/nexta_tv/status/1591133318451720193"
	],
	[
		"2022-11-14",
		"Canadian Prime Minister, Justin Trudeau, announced that Canada will provide $500 million in additional military assistance for Ukraine.",
		"Прем'єр-міністр Канади Джастін Трюдо заявив, що Канада надасть Україні 500 мільйонів доларів додаткової військової допомоги.",
		"https://pm.gc.ca/en/news/news-releases/2022/11/14/prime-minister-announces-additional-military-assistance-ukraine-and"
	],
	[
		"2022-11-14",
		"New Zealand is extending its defence commitments and providing further support and personnel to assist Ukraine. The NZ Defence Force infantry training for Ukrainian military personnel in the United Kingdom will be extended. There is more funding for equipment and supplies for Ukraine’s self-defence.",
		"Нова Зеландія продовжує свої оборонні зобов’язання та надає подальшу підтримку та персонал для допомоги Україні. Підготовка піхоти Сил оборони Нової Зеландії для українських військовослужбовців у Великій Британії буде продовжена. Збільшується фінансування на техніку та засоби для самооборони України.",
		"https://www.beehive.govt.nz/release/assistance-ukraine-extended-and-enhanced"
	],
	[
		"2022-11-15",
		"Germany will establish a maintenance hub in Slovakia to service and repair weapons it has delivered to Ukraine, German Defence Minister Christine Lambrecht said on Tuesday.",
		"Міністр оборони Німеччини Крістін Ламбрехт заявила у вівторок, що Німеччина створить у Словаччині центр технічного обслуговування для обслуговування та ремонту озброєння, яке вона постачала в Україну.",
		"https://news.yahoo.com/germany-set-hub-slovakia-repair-092525278.html"
	],
	[
		"2022-11-15",
		"Czech Company \"Excalibur Army\" has started the production of the \"Viktor\" a light self-propelled anti-aircraft weapon system for Ukraine",
		"Чеська компанія Excalibur Army почала виробництво для України легкої самохідної зенітної установки \"Віктор\".",
		"https://www.armyrecognition.com/ukraine_-_russia_conflict_war_2022/czech_company_excalibur_army_develops_for_ukraine_viktor_new_anti-aircraft_weapon_system.html"
	],
	[
		"2022-11-15",
		"President Joe Biden is asking Congress to provide more than $37.7 billion in emergency aid to Ukraine.",
		"Президент Джо Байден просить Конгрес надати Україні понад 37.7 мільярдів доларів надзвичайної допомоги.",
		"https://www.pbs.org/newshour/politics/biden-asks-for-more-than-37-billion-in-ukraine-emergency-aid"
	],
	[
		"2022-11-15",
		"Germany and Spain are planning to train thousands of Ukrainian troops under an EU program to help bolster Kyiv’s fightback against Russia,",
		"Німеччина та Іспанія планують навчити тисячі українських військових за програмою ЄС, щоб допомогти Києву протистояти Росії.",
		"https://www.thedefensepost.com/2022/11/15/germany-spain-train-ukraine-troops/amp/"
	],
	[
		"2022-11-16",
		"Sweden will deliver new military aid worth 3 billion crowns ($287 million) to Ukraine, its biggest package of defence material to date which included an air defence system, Prime Minister Ulf Kristersson said.",
		"Прем'єр-міністр Ульф Крістерссон заявив, що Швеція надасть Україні нову військову допомогу на суму 3 мільярди крон (287 мільйонів доларів США), найбільший на сьогодні пакет оборонних матеріалів, який включає систему протиповітряної оборони.",
		"https://www.reuters.com/world/europe/sweden-promises-287-mln-military-aid-package-ukraine-including-air-defence-2022-11-16/"
	],
	[
		"2022-11-16",
		"The Czech government plans to provide training to as many as 4,000 Ukrainian troops over the next year, Czech Defence Minister Jana Cernochova said on Wednesday.",
		"Міністр оборони Чехії Яна Чернохова заявила, що уряд Чехії планує протягом наступного року провести навчання 4000 українських військових.",
		"https://www.reuters.com/world/europe/czechs-plan-train-4000-ukrainian-troops-2022-11-16/"
	],
	[
		"2022-11-16",
		"Rheinmetall company will soon be supplying the Slovak Republic with Leopard 2A4 main battle tanks and other military hardware. In turn, the Slovak military will be transferring military equipment to Ukraine.",
		"Компанія Rheinmetall незабаром поставить до Словаччини основні бойові танки Leopard 2A4 та іншу військову техніку. У свою чергу словацькі військові передадуть Україні військову техніку.",
		"https://www.armyrecognition.com/defense_news_november_2022_global_security_army_industry/rheinmetall_supplying_slovak_army_with_leopard_2a4_mbts_in_tank_swap_for_ukraine.html"
	],
	[
		"2022-11-16",
		"Defence Minister of Canada Anita Anand has announced plans for spending $34 million of already-promised military aid to Ukraine from $500 mln. budget of 2022.  Around $5 million will be dedicated to providing critical satellite imagery to the Armed Forces of Ukraine (AFU), while more than $18 million will pay for high-resolution drone cameras. In addition, up to $10 million will go towards winter gear, which includes portable heaters, thermal blankets and sleeping bags.",
		"Міністр оборони Канади Аніта Ананд заявила про плани витратити Україні $34 млн вже обіцяної військової допомоги з $500 млн. бюджету на 2022 рік. Близько 5 мільйонів доларів буде спрямовано на забезпечення Збройних сил України (ЗСУ) критичними супутниковими знімками, а понад 18 мільйонів доларів – на камери з дронами високої роздільної здатності. Крім того, до 10 мільйонів доларів буде спрямовано на придбання зимового спорядження, яке включає портативні обігрівачі, термоковдри та спальні мішки.",
		"https://globalnews.ca/news/9282071/trudeau-ukraine-military-training/"
	],
	[
		"2022-11-18",
		"7th Slovak-made Zuzana 2 8x8 155mm self-propelled howitzer was delivered to Ukrainian armed forces. On June 1, 2022, the Army Recognition editorial team reported that Slovakia will deliver 8 Zuzana 2 155mm wheeled self-propelled howitzers to Ukraine. ",
		"До Збройних Сил України передано 7-му самохідну 155-мм гаубицю Zuzana 2 8х8 словацького виробництва. 1 червня 2022 року редакція видання Army Recognition повідомила, що Словаччина передасть Україні 8 155-мм колісних самохідних гаубиць Zuzana 2. ",
		"https://www.armyrecognition.com/defense_news_november_2022_global_security_army_industry/slovakia_delivers_the_7th_zuzana_2_155_mm_self-propelled_howitzers_to_ukraine.html"
	],
	[
		"2022-11-18",
		"The Israeli authorities allowed NATO member countries to supply Ukraine with weapons containing Israeli components and financed the purchase of “strategic materials” for Ukraine.",
		"Влада Ізраїлю дозволила країнам-членам НАТО постачати Україні зброю з ізраїльськими комплектуючими та профінансувала закупівлю «стратегічних матеріалів» для України.",
		"https://odessa-journal.com/israel-allowed-nato-members-to-supply-ukraine-with-weapons-with-israeli-components/"
	],
	[
		"2022-11-19",
		"Britain will provide a 50 million pound ($59.4 million) air defence package for Ukraine, including anti-aircraft guns and technology to counter Iranian-supplied drones, Prime Minister Rishi Sunak said on his first trip to Kyiv on Saturday.",
		"Британія надасть Україні пакет ППО вартістю 50 мільйонів фунтів стерлінгів (59,4 мільйона доларів США), включаючи зенітні гармати та технології для протидії поставленим Іраном безпілотникам, заявив прем’єр-міністр Ріші Сунак під час своєї першої поїздки до Києва в суботу.",
		"https://www.france24.com/en/europe/20221119-live-more-than-200-ukrainians-detained-or-disappeared-during-occupation-of-kherson-report-says"
	],
	[
		"2022-11-19",
		"Ukraine's army uses Romanian-made TAB-71M 8x8 armored personnel carrier. The layout of the vehicle is similar to the Soviet-made BTR-60PB 8x8 APC (Armored Personnel Carrier)",
		"На озброєнні української армії працює бронетранспортер TAB-71M 8x8 румунського виробництва. Компонування машини схоже на БТР радянського виробництва БТР-60ПБ 8х8.",
		"https://www.armyrecognition.com/ukraine_-_russia_conflict_war_2022/ukraine_army_uses_romanian-made_tab-71m_8x8_armored_personnel_carrier.html"
	],
	[
		"2022-11-20",
		"The Minister of Defence, Margarita Robles(Spain), announced yesterday that Spain will soon make new arms deliveries to Ukraine, which used the occasion of a NATO parliamentary meeting being held in Madrid to demand more military aid from allied countries to combat the Russian invasion.",
		"Міністр оборони Маргарита Роблес (Іспанія) оголосила вчора, що Іспанія незабаром здійснить нові поставки зброї в Україну, яка використала нагоду парламентської зустрічі НАТО, що проходила в Мадриді, щоб вимагати від країн-союзників додаткової військової допомоги для боротьби з російським вторгненням. .",
		"https://thediplomatinspain.com/en/2022/11/robles-announces-new-spanish-arms-deliveries-to-ukraine/"
	],
	[
		"2022-11-21",
		"It has now been revealed that the UK is supplying not just older Brimstone 1 but modern Brimstone 2 Dual Mode missiles to the AFU.",
		"Тепер стало відомо, що Сполучене Королівство постачає ЗСУ не тільки старі ракети Brimstone 1, але й сучасні дворежимні ракети Brimstone 2.",
		"https://twitter.com/UAWeapons/status/1594631837867020288"
	],
	[
		"2022-11-21",
		"Three Western countries, the United States, Germany, and the Netherlands, already sent SeaFox AUV, 10 Autonomous Surface Vessels, and 10 Dauntless Sea Ark Patrol boats to Ukraine.",
		"Три країни Заходу – США, Німеччина та Нідерланди – вже відправили в Україну АНПА SeaFox, 10 автономних надводних кораблів і 10 катерів Dauntless Sea Ark Patrol.",
		"https://www.armyrecognition.com/defense_news_november_2022_global_security_army_industry/lockheed_martin_awarded_us_army_contract_to_replenish_stock_of_gmlrs_rockets_provided_to_ukraine.html"
	],
	[
		"2022-11-21",
		"According to US Congress Senator Jim Risch, a Republican, he himself supports the provision of Western-model fighter jets to Ukraine, but there is still no majority for this step among members of Congress.",
		"За словами сенатора Конгресу США, республіканця Джима Ріша, він сам виступає за надання Україні винищувачів західного зразка, але серед конгресменів досі немає більшості за цей крок.",
		"https://censor.net/en/news/3382095/republican_senator_risch_on_fighter_jets_for_ukraine_when_we_fought_in_vietnam_russians_supplied_planes"
	],
	[
		"2022-11-21",
		"Luxembourg has sent additional High Mobility Multipurpose Wheeled Vehicles (HMMWV) to Ukraine",
		"Люксембург відправив в Україну додаткові багатофункціональні колісні транспортні засоби високої мобільності (HMMWV).",
		"https://twitter.com/Francois_Bausch/status/1594639091064258560"
	],
	[
		"2022-11-21",
		"Ukraine army to receive 8 Oshkosh M1070 tank transport tractors from Germany",
		"Українська армія отримає від Німеччини 8 тягачів-цистерн Oshkosh M1070",
		"https://www.armyrecognition.com/defense_news_november_2022_global_security_army_industry/ukraine_army_to_receive_8_oshkosh_m1070_tank_transport_tractors_from_germany.html"
	],
	[
		"2022-11-21",
		"Turkey has delivered to Ukraine high-precision TRLG-230-230 MLRS and SUNGUR air-to-air missiles. Turkey opted keep publications about these deliveries to a minimum, exact quantities of delivered items are unknown.",
		"Туреччина поставила в Україну високоточні РСЗВ TRLG-230-230 і ракети класу «повітря-повітря» SUNGUR. Туреччина вирішила звести публікації про ці поставки до мінімуму, точні обсяги доставлених товарів невідомі.",
		"https://www.oryxspioenkop.com/2022/11/the-stalwart-ally-turkiyes-arms.html"
	],
	[
		"2022-11-22",
		"Lawmakers from both sides of the aisle push Biden administration to provide Ukraine with lethal 'Gray Eagle' drones.",
		"Законодавці з обох сторін підштовхують адміністрацію Байдена надати Україні смертоносні дрони «Сірий орел».",
		"https://www.businessinsider.com/lawmakers-urge-biden-to-provide-ukraine-lethal-gray-eagle-drones-2022-11"
	],
	[
		"2022-11-23",
		"Three Sea King helicopters will be provided to Ukraine, the first of which has already arrived in Ukraine. The UK would also send an additional 10,000 artillery rounds",
		"Україні буде надано три гелікоптери Sea King, перший з яких вже прибув в Україну. Великобританія також надішле додатково 10 000 артилерійських снарядів.",
		"https://www.bbc.com/news/uk-63725431"
	],
	[
		"2022-11-23",
		"The Department of Defense (DoD) announced the authorization of a Presidential Drawdown of security assistance valued at $400 million to meet Ukraine's critical security and defense needs. This assistance package will include: additional munitions for National Advanced Surface-to-Air Missile Systems (NASAMS); 150 heavy machine guns with thermal imagery sights to counter Unmanned Aerial Systems (UAS); additional ammunition for High Mobility Artillery Rocket Systems (HIMARS); 200 precision-guided 155mm artillery rounds; 10,000 120mm mortar rounds; high-speed Anti-radiation missiles (HARMs); 150 High Mobility Multipurpose Wheeled Vehicles (HMMWVs); over 100 light tactical vehicles; over 20,000,000 rounds of small arms ammunition; over 200 generators; spare parts for 105mm Howitzers and other equipment.",
		"Міністерство оборони США оголосило про надання пакету допомоги вартістю 400 мільйонів доларів для задоволення критичних потреб України в сфері безпеки та оборони. Цей пакет включатиме: додаткові боєприпаси для національних передових зенітно-ракетних систем (NASAMS); 150 великокаліберних кулеметів з тепловізійними прицілами для протидії безпілотним літальним комплексам (БЛА); додаткові боєприпаси для ракетно-артилерійських систем високої мобільності (HIMARS); 200 високоточних 155-мм артилерійських снарядів; 10 000 мінометних снарядів калібру 120 мм; високошвидкісні протирадіаційні ракети (HARMs); 150 багатоцільових колісних транспортних засобів високої мобільності (HMMWV); понад 100 легких тактичних автомобілів; понад 20 000 000 боєприпасів до стрілецької зброї; понад 200 генераторів; запчастини до 105-мм гаубиць та іншої техніки.",
		"https://www.defense.gov/News/Releases/Release/Article/3227217/400-million-in-additional-assistance-for-ukraine/"
	],
	[
		"2022-11-25",
		"NATO has supplied Ukraine with jammers to defend against Russian drone attacks, the alliance's Secretary General Jens Stoltenberg said in Brussels on November 25.",
		"НАТО поставило Україні засоби перешкод для захисту від атак російських безпілотників, заявив 25 листопада в Брюсселі генсек альянсу Єнс Столтенберг.",
		"https://www.rferl.org/a/nato-jammers-drone-defense-ukraine/32148577.html"
	],
	[
		"2022-11-25",
		"Six Czech-made Primoco One 150 UAVs (Unmanned Aerial Vehicles) were delivered to Ukraine by Luxembourg. These drones were purchased by Luxembourg as part of military aid to the Ukrainian armed forces.",
		"Люксембург доставив в Україну шість безпілотних літальних апаратів Primoco One 150 чеського виробництва. Ці безпілотники були закуплені Люксембургом у рамках військової допомоги Збройним силам України.",
		"https://www.armyrecognition.com/defense_news_november_2022_global_security_army_industry/luxembourg_delivers_to_ukraine_six_czech-made_primoco_one_150_drones.html"
	],
	[
		"2022-11-25",
		"Norway sends 1 self-propelled artillery M109 155 mm to Ukraine. The cargo also contains around 55,000 bandages and individual packages. In addition, 30,000 field rations and 55,000 articles of winter clothing are sent. Also 20,000 unique spare parts for the M109 are packed and sent on this donation.",
		"Норвегія відправляє в Україну 1 самохідну артилерійську установку М109 калібру 155 мм. У вантажі також близько 55 тисяч перев'язувальних матеріалів та індивідуальних пакунків. Крім того, надсилається 30 тис. польових пайків і 55 тис. одиниць зимового одягу. Крім того, 20 000 унікальних запчастин для M109 упаковані та відправлені на цю пожертву.",
		"https://www.tv2.no/nyheter/innenriks/pakket-og-sendt-i-all-hemmelighet/15282815/"
	],
	[
		"2022-11-28",
		"The Pentagon is considering a Boeing proposal to supply Ukraine with longer range GLSDB missiles for GMLRS. If confirmed they could be delivered in spring 2023.",
		"Пентагон розглядає пропозицію Boeing про постачання Україні ракет GLSDB більшої дальності для GMLRS. У разі підтвердження вони можуть бути доставлені навесні 2023 року.",
		"https://www.reuters.com/business/aerospace-defense/100-mile-strike-weapon-weighed-ukraine-arms-makers-wrestle-with-demand-sources-2022-11-28/"
	],
	[
		"2022-11-28",
		"The Norwegian Government has agreed to provide Nkr150m ($15.13m) to support the European Union’s training mission for the Ukrainian troops.",
		"Уряд Норвегії погодився надати 150 мільйонів крон (15,13 мільйонів доларів) на підтримку місії Європейського Союзу з підготовки українських військових",
		"https://www.army-technology.com/news/norway-eumam-ukraine-mission/"
	],
	[
		"2022-11-28",
		"Belgium will send Remotely Operated Underwater Vehicles (ROV) 7 to Ukraine built by ECA Robotics Belgium.",
		"Бельгія надішле в Україну дистанційно керовані підводні апарати (ROV) 7, виготовлені бельгійською компанією ECA Robotics.",
		"https://navyrecognition.com/index.php/naval-news/naval-news-archive/2022/november/12535-belgium-to-deliver-r7-remotely-operated-vehicles-to-ukraine.html"
	],
	[
		"2022-11-29",
		"Milrem Robotics and the German defence company Krauss-Maffei Wegmann (KMW) have signed a contract to deliver 14 THeMIS unmanned ground vehicles (UGV) configured for mine clearance to Ukraine. ",
		"Milrem Robotics і німецька оборонна компанія Krauss-Maffei Wegmann (KMW) підписали контракт на поставку в Україну 14 безпілотних наземних транспортних засобів (UGV) THEMIS, налаштованих для розмінування.",
		"https://www.armyrecognition.com/defense_news_november_2022_global_security_army_industry/milrem_robotics_to_deliver_14_themis_ugvs_to_ukraine_in_cooperation_with_kmw.html"
	],
	[
		"2022-11-29",
		"A senior Ukrainian military delegation visited Israel in a bid to secure defense assistance. The Ukrainians reportedly sought to push ahead with creating a missile alert system and to supply weapons systems, which Israel has so far refused to do, sending only humanitarian aid and protective equipment.",
		"Українська військова делегація відвідала Ізраїль з метою отримання оборонної допомоги. Повідомляється, що українці прагнули продовжити створення системи оповіщення про ракети та постачання систем озброєння, від чого Ізраїль досі відмовлявся, надсилаючи лише гуманітарну допомогу та захисне обладнання.",
		"https://www.timesofisrael.com/senior-ukraine-military-delegation-visits-israel-in-bid-for-defense-aid-report/"
	],
	[
		"2022-11-30",
		"Croatia’s parliament has started discussing Croatian military aid to Ukraine, which should be provided within the framework of EUMAM, European Union Assistance to Ukraine. It follows a public disagreement between Prime Minister Andrej Plenkovic and President Zoran Milanovic over training Ukrainian soldiers in Croatia, which Plenkovic supports and Milanovic opposes. Unable to resolve the dispute between themselves, this issue has been put to parliament, to decide on it with a two-thirds majority.",
		"Парламент Хорватії почав обговорення військової допомоги Хорватії Україні, яка має бути надана в рамках EUMAM, допомоги Європейського Союзу Україні. Це сталося після публічних розбіжностей між прем’єр-міністром Андреєм Пленковичем і президентом Зораном Мілановичем щодо навчання українських солдатів у Хорватії, яку Пленкович підтримує, а Міланович – проти. Не в змозі вирішити суперечку між собою, це питання було передано на розгляд парламенту, щоб вирішити його більшістю у дві третини.",
		"https://balkaninsight.com/2022/11/30/croatia-parliament-debates-training-ukrainian-soldiers/"
	],
	[
		"2022-12-01",
		"The US Army awarded a $1.2bn contract to Raytheon Technologies Co for six national advanced surface-to-air missile systems (Nasams) for Ukraine over three years",
		"Армія США уклала контракт на 1,2 мільярда доларів з Raytheon Technologies Co на шість національних передових зенітно-ракетних систем (Nasam) для України за три роки",
		"https://www.theguardian.com/world/live/2022/dec/01/russia-ukraine-war-live-us-hands-raytheon-12bn-ukraine-missile-systems-contract-6-million-without-power-as-winter-begins?filterKeyEvents=false&page=with:block-63883b098f08f5eb2e314d3b#block-63883b098f08f5eb2e314d3b"
	],
	[
		"2022-12-01",
		"Germany has committed a new batch of military aid to Ukraine, which includes unmanned surface vessels, bridge-laying tanks and border protection vehicles.",
		"Німеччина надала Україні нову партію військової допомоги, яка включає безпілотні надводні кораблі, мостоукладальні танки та машини охорони кордону.",
		"https://www.bundesregierung.de/breg-en/news/military-support-ukraine-2054992"
	],
	[
		"2022-12-01",
		"Ronald Reagan Institute published results of their survey, which states that a majority of Americans (57%) believe the United States should continue sending military and financial aid to the people of Ukraine in their fight against Russian aggression.",
		"Інститут Рональда Рейгана опублікував результати свого опитування, згідно з яким більшість американців (57%) вважають, що Сполучені Штати повинні продовжувати надсилати військову та фінансову допомогу народу України в боротьбі з російською агресією.",
		"https://www.voanews.com/a/poll-majority-of-americans-support-continued-aid-for-ukraine/6858460.html"
	],
	[
		"2022-12-01",
		"NATO Secretary General Jens Stoltenberg has said that it was too early to make conclusions about continuing talks on Poland’s request to move Patriot systems offered by Germany to Ukraine.",
		"Генеральний секретар НАТО Єнс Столтенберг заявив, що поки рано робити висновки щодо продовження переговорів щодо запиту Польщі щодо переміщення в Україну запропонованих Німеччиною систем Patriot.",
		"https://www.aljazeera.com/news/liveblog/2022/12/1/russia-ukraine-live-news-the-west-missed-their-chance-lavrov"
	],
	[
		"2022-12-01",
		"US Trying to Persuade More Allies to Send NASAMS Missiles to Ukraine, Raytheon CEO Says. If U.S. officials can broker a deal, Kyiv won’t have to wait for factory-produced interceptors.",
		"США намагаються переконати більше союзників відправити ракети NASAMS в Україну, – генеральний директор Raytheon. Якщо офіційні особи США зможуть домовитися, Києву не доведеться чекати перехоплювачів заводського виробництва.",
		"https://www.defenseone.com/business/2022/12/exclusive-us-trying-persuade-more-allies-send-nasams-missiles-ukraine-raytheon-ceo-says/380382/"
	],
	[
		"2022-12-01",
		"Defense Secretary Lloyd Austin and other top Pentagon officials are weighing a major expansion in training for the Ukrainian military, a move that could significantly enhance its ability to evict Russian forces from occupied areas even as it deepens U.S. involvement in the war.",
		"Міністр оборони Ллойд Остін та інші високопосадовці Пентагону обдумують суттєве розширення підготовки українських військових, навіть якщо це поглиблює участь США у війні.",
		"https://www.washingtonpost.com/national-security/2022/12/01/ukraine-us-military-training/"
	],
	[
		"2022-12-01",
		"France has unofficially admitted that it is unable to provide Ukraine with more weapons due to dwindling stocks, but promised to continue helping Kiev in other ways, Politico reported.",
		"Франція неофіційно визнала, що не може надати Україні більше зброї через скорочення запасів, але пообіцяла продовжувати допомагати Києву іншими способами, повідомляє Politico.",
		"https://thepressunited.com/updates/france-has-no-more-weapons-to-send-to-ukraine-politico/"
	],
	[
		"2022-12-05",
		"Polish surface-to-air missile system S-125SC Newa-SC has been spotted on photos in Ukraine. This delivery was not announced officially.",
		"На фото в Україні помітили польський зенітно-ракетний комплекс S-125SC Newa-SC. Офіційно про цю поставку не повідомлялося.",
		"https://defence-blog.com/polish-air-defense-system-spotted-in-ukraine/"
	],
	[
		"2022-12-06",
		"Finland is moving ahead with its 10th military aid package (MAP) to Ukraine. The latest shipment of weapons, which is valued at $58.5 million, includes specialist sniper rifles, mortars, munitions, in addition to extreme climate combat equipment and clothing.",
		"Фінляндія надає 10-й пакет військової допомоги (ПДЧ) Україні. Остання поставка зброї, яка оцінюється в 58,5 мільйонів доларів, включає спеціальні снайперські гвинтівки, міномети, боєприпаси, зимове спорядження та одяг.",
		"https://www.defensenews.com/global/europe/2022/12/05/nordic-nations-may-pool-their-growing-military-support-to-ukraine/"
	],
	[
		"2022-12-06",
		"Sweden has ratified a new MAP for Ukraine, worth $290 million, that will include an air defense system and munitions from the Swedish Armed Force’s (SAF) stockpile",
		"Швеція ратифікувала новий пакет військової допомоги для України вартістю 290 мільйонів доларів, який включатиме систему протиповітряної оборони та боєприпаси із запасів Збройних сил Швеції (SAF).",
		"https://www.defensenews.com/global/europe/2022/12/05/nordic-nations-may-pool-their-growing-military-support-to-ukraine/"
	],
	[
		"2022-12-06",
		"The European Union and Hungary are in disagreement on financial aid to Kyiv. On Tuesday (Dec. 7) Budapest vetoed an 18 billion euro ($18.93 billion) package.",
		"Євросоюз та Угорщина розходяться щодо фінансової допомоги Києву. У вівторок (7 грудня) Будапешт наклав вето на пакет вартістю 18 мільярдів євро (18,93 мільярда доларів).",
		"https://apnews.com/article/europe-business-hungary-budapest-viktor-orban-6bdcc94f8db8e5a9ca0b26cf1c3b7157"
	],
	[
		"2022-12-06",
		"Lithuanian Prime Minister Ingrida Šimonytė met with Vice President Kamala Harris and members Of Congress. Her message was to stay the course on supporting Ukraine and to do more. Šimonytė asked to provide Ukraine with long-range missiles like US-made ATACMS or a European equivalent to help Kyiv defend Itself.",
		"Прем’єр-міністр Литви Інгріда Шимоніте зустрілася з віце-президентом Камалою Гарріс та членами Конгресу. Її меседж полягав у тому, щоб продовжувати курс на підтримку України та робити більше. Шимоніте попросила надати Україні ракети великої дальності, такі як ATACMS американського виробництва або європейський еквівалент, щоб допомогти Києву захистити себе.",
		"https://www.politico.com/newsletters/national-security-daily/2022/12/06/give-ukraine-long-range-missiles-lithuanias-pm-00072511"
	],
	[
		"2022-12-06",
		"The Pentagon secretly modified advanced rocket systems it sent to Ukraine to make the weapons unable to fire into Russia and escalate the war.",
		"Пентагон таємно модифікував передові ракетні системи, які він надіслав в Україну, щоб зробити зброю нездатною для вогню по Росії та ескалації війни.",
		"https://www.wsj.com/articles/u-s-altered-himars-rocket-launchers-to-keep-ukraine-from-firing-missiles-into-russia-11670214338"
	],
	[
		"2022-12-06",
		"Lawmakers agreed to provide Ukraine at least $800 million in additional security assistance next year. The Fiscal 2023 National Defense Authorization Act, or NDAA, authorizes the additional spending for the Ukraine Security Assistance Initiative, an increase of $500 million over President Joe Biden's request earlier this year.",
		"Законодавці погодилися надати Україні щонайменше 800 мільйонів доларів додаткової безпекової допомоги наступного року. Закон про дозвіл на національну оборону на 2023 фінансовий рік, або NDAA, дозволяє додаткові витрати на Ініціативу сприяння безпеці в Україні, збільшення на 500 мільйонів доларів порівняно з проханням президента Джо Байдена на початку цього року.",
		"https://www.newsmax.com/politics/defense-ukraine/2022/12/06/id/1099415/"
	],
	[
		"2022-12-07",
		"Germany plans to supply Ukraine with 18 RCH 155 wheeled howitzers, according to the government's updated list of arms deliveries to Ukraine. The delivery is in \"preparation/implementation\" phase.",
		"Німеччина планує поставити Україні 18 колісних гаубиць RCH 155, йдеться в оновленому урядом переліку поставок озброєнь в Україну. Доставка знаходиться на етапі «підготовка/реалізація».",
		"https://edition.cnn.com/europe/live-news/russia-ukraine-war-news-12-07-22/h_6e80e40ec76fb9fa08afeead1a6098f9"
	],
	[
		"2022-12-07",
		"According to Frankfurter Allgemeine Zeitung information, the US Government doesn't encorage nor restricts Germany in sending Leopard battle tanks to Ukraine. \"We leave that to the Germans and do not address any requests to them\".",
		"За інформацією Frankfurter Allgemeine Zeitung, уряд США не заохочує і не обмежує Німеччину відправляти в Україну бойові танки Leopard. «Ми залишаємо це німцям і не звертаємося до них із жодними проханнями»",
		"https://www.faz.net/aktuell/politik/inland/ukraine-usa-ueberlaesst-deutschland-die-entscheidung-ueber-leopard-2-18516545.html"
	],
	[
		"2022-12-08",
		"The Department of Defense (DoD) announced the authorization of a Presidential Drawdown of security assistance valued at up to $275 million. This package include: additional ammunition for high mobility artillery rocket systems (himars); 80,000 155mm artillery rounds; counter-unmanned aerial systems equipment; counter air defense capability; high mobility multipurpose wheeled vehicles (HMMWVs) ambulances and medical equipment; approximately 150 generators and field equipment.",
		"Міністерство оборони США оголосило про надання чергового пакету допомоги на суму до 275 мільйонів доларів. У комплект входять: додаткові боєприпаси для HIMARS; 80 000 артилерійських снарядів калібру 155 мм; обладнання протидії безпілотним авіаційним комплексам; контр-ППО система; високомобільні багатоцільові колісні транспортні засоби (HMMWV), машини швидкої допомоги та медичне обладнання; близько 150 генераторів",
		"https://www.reuters.com/world/europe/us-send-ukraine-anti-drone-air-defense-aid-worth-275-million-2022-12-08/"
	],
	[
		"2022-12-08",
		"The US Army has detailed recent accelerated contracting efforts to “significantly increase production capacity” for 155mm artillery shells. IMT Defense was awarded a sole-source contract on Nov. 22 to produce M795 155mm projectile shell bodies and General Dynamics Ordnance and Tactical Systems [GD] was awarded a new task order on Nov. 23 to build a new 155mm artillery metal parts production line.",
		"Армія США детально розповіла про нещодавнє прискорене укладання контрактів на «значне збільшення виробничих потужностей» для 155-мм артилерійських снарядів. 22 листопада компанія IMT Defense отримала єдиний контракт на виробництво корпусів 155-мм снарядів M795, а компанія General Dynamics Ordnance and Tactical Systems [GD] 23 листопада отримала нове замовлення на будівництво нової лінії виробництва металевих деталей 155-мм артилерії. .",
		"https://www.armyrecognition.com/defense_news_december_2022_global_security_army_industry/us_army_contract_actions_to_increase_155_mm_artillery_shell_body_capacity.amp.html"
	],
	[
		"2022-12-08",
		"Former NATO Secretary-General Anders Rasmussen has joined a growing chorus of voices calling for the United States and its European allies to furnish Ukraine with more advanced weapons systems.",
		"Колишній генеральний секретар НАТО Андерс Расмуссен приєднався до дедалі більшого хору голосів, які закликають Сполучені Штати та їх європейських союзників надати Україні більш передові системи озброєнь.",
		"https://www.voanews.com/a/former-nato-chief-joins-calls-to-better-arm-ukraine/6868974.html"
	],
	[
		"2022-12-08",
		"The Slovak government has agreed on another package of military assistance to Ukraine. This was announced by Rastislav Kacher, the Slovak Foreign Minister, during a joint briefing with his Ukranian counterpart Dmytro Kuleba. The minister didn’t specify ammunition types and quantities.",
		"Уряд Словаччини погодив черговий пакет військової допомоги Україні. Про це заявив міністр закордонних справ Словаччини Растислав Качер під час спільного брифінгу з українським колегою Дмитром Кулебою. Види та кількість боєприпасів міністр не уточнив.",
		"https://mil.in.ua/en/news/slovakia-approves-new-military-aid-package-to-ukraine/"
	],
	[
		"2022-12-09",
		"Germany is to send two additional air defence systems to Ukraine of the type Skynex by Rheinmetall (RHMG.DE), the Handelsblatt daily reported on Friday, citing unnamed sources in Berlin. The systems are to be delivered in early 2024.",
		"Німеччина має надіслати в Україну дві додаткові системи протиповітряної оборони типу Skynex від Rheinmetall (RHMG.DE), повідомляє в п’ятницю газета Handelsblatt з посиланням на неназвані джерела в Берліні. Системи мають бути поставлені на початку 2024 року.",
		"https://www.reuters.com/business/aerospace-defense/germany-send-skynex-air-defence-systems-ukraine-handelsblatt-2022-12-09/"
	],
	[
		"2022-12-09",
		"Bulgaria will send its first military aid to Ukraine since the Russian invasion after parliament on Friday approved a list of arms drawn up by the interim government. The list of arms is classified, but government officials have said Sofia would mainly send light weaponry and ammunition.",
		"Болгарія надішле першу військову допомогу Україні після російського вторгнення після того, як парламент у п’ятницю схвалив список озброєнь, складений тимчасовим урядом. Список озброєнь є засекреченим, але урядовці заявили, що Софія надішле в основному легке озброєння та боєприпаси.",
		"https://www.reuters.com/world/europe/bulgaria-send-its-first-military-aid-ukraine-2022-12-09/"
	],
	[
		"2022-12-09",
		"The European Union is to add 2 billion euros ($2.1 billion) to a fund used to help arm Ukraine, as paying for weapon deliveries has drained the coffers, European diplomats said Friday. Diplomats said a preliminary agreement had been struck among the 27-member bloc to bolster the European Peace Facility, which has already committed over 3 billion euros to covering the cost of weaponry for Kyiv.",
		"Євросоюз має додати 2 мільярди євро (2,1 мільярда доларів) до фонду, який використовується для допомоги озброєнню України, оскільки оплата за поставки зброї виснажила скарбницю, повідомили європейські дипломати в п’ятницю. Дипломати повідомили, що між 27 членами блоку було досягнуто попередньої угоди щодо підтримки Європейського фонду миру, який уже виділив понад 3 мільярди євро на покриття вартості зброї для Києва.",
		"https://www.zawya.com/en/world/uk-and-europe/eu-to-bolster-fund-used-for-arming-ukraine-my69kxg7"
	],
	[
		"2022-12-09",
		"The Prime Minister of the UK said in a tepephone call with President Zelensky that more anti-air guns and further short range air defence missiles would arrive in Ukraine in the coming weeks.",
		"У телефонній розмові з президентом Зеленським прем’єр-міністр Великої Британії заявив, що найближчими тижнями в Україну надійде більше зенітної зброї та ракет ППО малої дальності.",
		"https://www.gov.uk/government/news/pm-call-with-president-zelenskyy-of-ukraine-9-december-2022"
	],
	[
		"2022-12-10",
		"US diplomats reportedly managed to convince the official Morocco to transfer spare parts for T-72 tanks to Kyiv “in the greatest secrecy.” The Royal Moroccan Armed Forces have several dozen tanks of the T-72B/BK type, purchased in 1999-2001 from Belarus, the report said.",
		"Повідомляється, що американським дипломатам вдалося переконати офіційне Марокко передати Києву запчастини для танків Т-72 «під найвищою таємницею». Королівські збройні сили Марокко мають кілька десятків танків типу Т-72Б/БК, закуплених у 1999-2001 роках у Білорусі, йдеться у повідомленні.",
		"https://euromaidanpress.com/2022/12/10/morocco-to-become-first-african-country-to-provide-military-aid-to-ukraine-media/"
	],
	[
		"2022-12-11",
		"The German arms manufacturer Rheinmetall has received an order for two Skynex anti-aircraft missile systems for Ukraine.",
		"Німецький виробник зброї Rheinmetall отримав замовлення на два зенітно-ракетних комплекси Skynex для України.",
		"https://www.handelsblatt.com/unternehmen/industrie/ruestungsindustrie-rheinmetall-baut-neue-skynex-flugabwehr-fuer-die-ukraine/28859200.html"
	],
	[
		"2022-12-11",
		"Ukrainian soldiers have received an undisclosed number of Titan-S, a 4x4 armored vehicle produced by the company Inkas Vehicles LLC.",
		"Українські військові отримали нерозголошену кількість броньованого автомобіля Титан-С виробництва компанії Inkas Vehicles LLC",
		"https://www.armyrecognition.com/defense_news_december_2022_global_security_army_industry/inkas_titan-s_4x4_armored_vehicles_are_now_in_service_with_ukrainian_army.html"
	],
	[
		"2022-12-12",
		"European Union foreign ministers meeting in Brussels agreed to put another 2 billion euros ($2.1 billion) into a fund that has been used to pay for military support for Ukraine.",
		"Міністри закордонних справ Європейського Союзу на зустрічі в Брюсселі домовилися вкласти ще 2 мільярди євро (2,1 мільярда доларів) у фонд, який використовувався для оплати військової підтримки України.",
		"https://www.euronews.com/2022/12/12/eu-to-provide-two-billion-euros-to-top-up-ukraine-military-aid-fund"
	],
	[
		"2022-12-12",
		"Slovakia is restarting production of 122 mm and 152 mm Soviet rounds, to meet the demand in Ukraine. Rastislav Kacher, Slovak Minister of Foreign Affairs, noted that the government is currently working on a strategy needed to launch the manufacturing of large-calibre munitions.",
		"Словаччина відновлює виробництво радянських снарядів калібру 122 і 152 мм, щоб задовольнити попит в Україні. Міністр закордонних справ Словаччини Растислав Качер зазначив, що уряд зараз працює над стратегією, необхідною для запуску виробництва боєприпасів великого калібру.",
		"https://defence24.com/armed-forces/slovakia-restarts-production-of-post-soviet-munitions-to-support-ukraine"
	],
	[
		"2022-12-13",
		"Pentagon's plan related to Patriot missile defense system delivery for Ukraine is awaiting approval from White House.",
		"План Пентагону щодо постачання Україні систем протиракетної оборони Patriot очікує затвердження Білого Дому.",
		"https://edition.cnn.com/2022/12/13/politics/us-patriot-missile-defense-system-ukraine/index.html"
	],
	[
		"2022-12-13",
		"Arms supplies from Italy to Ukraine will stop as soon as peace talks on ending the Russian invasion begin, the Italian defence minister told parliament on Tuesday, as lawmakers endorsed a government decision to extend military aid throughout 2023.",
		"Поставки зброї з Італії в Україну припиняться, як тільки почнуться мирні переговори про припинення російського вторгнення, заявив міністр оборони Італії парламенту у вівторок, оскільки законодавці схвалили рішення уряду продовжити військову допомогу протягом 2023 року.",
		"https://www.saltwire.com/atlantic-canada/news/world/italian-arms-supplies-to-ukraine-will-stop-with-peace-talks-100805377/"
	],
	[
		"2022-12-14",
		"The Biden administration is planning to send Ukraine advanced electronic equipment that converts unguided aerial munitions into “smart bombs” that can target Russian military positions with a high degree of accuracy, according to senior U.S. officials familiar with the matter.",
		"Адміністрація Байдена планує надіслати в Україну сучасне електронне обладнання, яке перетворює некеровані авіаційні боєприпаси на «розумні бомби», здатні з високою точністю націлювати позиції російських військ, за словами високопоставлених чиновників США, знайомих із цим питанням.",
		"https://www.washingtonpost.com/national-security/2022/12/14/ukraine-smart-bomb-jdams/"
	],
	[
		"2022-12-14",
		"T-72B Main Battle Tanks (MBTs) modernized by the Czech company Excalibur Army for Morocco will be delivered to Ukraine. Excalibur Army commercial director Richard Kuběna said, the first batch of five modernized T-72 tanks will be delivered in the next few days and a total of 18 T-72 tanks will be supplied to Ukraine by the end of the year.",
		"Модернізовані чеською компанією Excalibur Army для Марокко основні бойові танки (ОБТ) Т-72Б будуть доставлені в Україну. Комерційний директор Excalibur Army Річард Кубена повідомив, що перша партія з п’яти модернізованих танків Т-72 буде поставлена найближчими днями, а загалом до кінця року в Україну буде поставлено 18 танків Т-72.",
		"https://www.armyrecognition.com/defense_news_december_2022_global_security_army_industry/morocco_agrees_to_donate_its_czech_modernized_t-72_tanks_to_ukraine.html"
	],
	[
		"2022-12-14",
		"Slovakia is ready to transfer some of their MiG-29 to Ukraine, according to Rastislav Kacher, the Minister of Foreign Affairs of Slovakia.",
		"Словаччина готова передати Україні частину своїх МіГ-29, заявив міністр закордонних справ Словаччини Растислав Качер.",
		"https://www.airrecognition.com/index.php/news/defense-aviation-news/2022-news-aviation-aerospace/december/8839-slovak-air-force-likely-to-hand-over-mig-29-fighters-to-ukraine-air-force.html"
	],
	[
		"2022-12-14",
		"European Parliament President Roberta Metsola: Ukraine needs to be provided with the necessary aid, including lethal weapons.",
		"Президент Європейського Парламенту Роберта Метсола: Україна потребує необхідної допомоги, у тому числі летальної зброї.",
		"https://www.europarl.europa.eu/news/pt/press-room/20221205IPR60903/european-parliament-press-kit-for-the-european-council-of-15-december-2022"
	],
	[
		"2022-12-15",
		"Sweden does not intend to supply Ukraine with its Saab JAS39 Gripen fighters, “at least for the time being”, said the Swedish Defence Minister. Kyiv had previously said it would welcome modern aircraft from Western sponsors, including Stockholm.",
		"Швеція не має наміру постачати Україні свої винищувачі Saab JAS39 Gripen, «принаймні на даний момент», заявив міністр оборони Швеції. Раніше Київ заявляв, що вітатиме сучасні літаки від західних спонсорів, зокрема Стокгольма.",
		"https://www.turdef.com/Article/sweden-rejects-ukraine-s-request-to-send-gripen-fighter-jets/2547"
	],
	[
		"2022-12-15",
		"Ukraine to receive soon new DANA M2 8x8 152mm howitzers from Czech Republic",
		"Невдовзі Україна отримає нові самохідні 155-мм артилерійські установки Дана М2 від Чехії",
		"https://www.armyrecognition.com/defense_news_december_2022_global_security_army_industry/ukraine_to_receive_soon_new_dana_m2_8x8_152mm_howitzers_from_czech_republic.html"
	],
	[
		"2022-12-15",
		"Soldiers from U.S. Army Europe and Africa Command's 7th Army Training Command will provide the combined arms and joint maneuver training for Ukranian Armed Forces in Germany. They will begin in the January timeframe and will include up to 500 Ukranian soldiers. ",
		"Військовослужбовці 7-го армійського командування армії США в Європі та Африці забезпечуватимуть загальновійськову підготовку та тренування спільних маневрів для Збройних сил України в Німеччині. Вони розпочнуться у січні та охоплять до 500 українських військових.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3248075/us-plans-combined-arms-training-for-ukrainian-soldiers/"
	],
	[
		"2022-12-15",
		"In his interview to the Economist Gen. Zaluzhny (UA) is asking for more weapons from the western countries. \"I need 300 tanks, 600-700 IFVs, 500 Howitzers. Then, I think it is completely realistic to get to the lines of February, 23rd.\"",
		"В інтерв'ю Economist генерал Залужний просить більше озброєнь із західних країн. «Мені потрібно 300 танків, 600-700 БМП, 500 гаубиць. Тоді, я думаю, цілком реально вийти на рубежі 23 лютого».",
		"https://www.economist.com/zaluzhny-transcript"
	],
	[
		"2022-12-15",
		"The United States is finalizing plans to send Patriot missiles to aid Ukraine’s fight against the unprovoked Russian invasion, according to U.S. officials.",
		"За словами офіційних осіб США, Сполучені Штати завершують плани надсилання ракет Patriot для допомоги Україні у боротьбі проти неспровокованого російського вторгнення.",
		"https://www.voanews.com/a/us-finalizing-plans-to-send-patriot-missile-systems-to-ukraine-/6878914.html"
	],
	[
		"2022-12-16",
		"Croatian lawmakers on December 16 rejected a proposal for Croatia to join an EU mission in support of the Ukrainian military.",
		"Хорватські депутати 16 грудня відхилили пропозицію про приєднання Хорватії до місії ЄС на підтримку українських військових.",
		"https://www.rferl.org/a/croatia-parliament-rejects-proposal-support-eu-military-mission-ukraine/32180237.html"
	],
	[
		"2022-12-17",
		"Olaf Scholz: Germany will not provide Leopard tanks for Ukraine unilaterally, and this condition will remain in the next year.",
		"Олаф Шольц: Німеччина не буде передавати танки для України в односторонньому порядку, і ця умова збережеться і в наступному (2023) році.",
		"https://bulgarianmilitary.com/2022/12/18/berlin-will-not-send-leopard-tanks-to-kyiv-not-now-or-in-2023/"
	],
	[
		"2022-12-17",
		"The German Ministry of Defense announced on December 15, 2022, the delivery of more IRIS-T SLM surface-to-air missiles to Ukraine.",
		"Міністерство оборони Німеччини 15 грудня 2022 року оголосило про поставку в Україну додаткової кількості ракет класу «земля-повітря» IRIS-T SLM.",
		"https://www.armyrecognition.com/defense_news_december_2022_global_security_army_industry/germany_delivers_additional_iris-t_slm_surface-to-air_missiles_to_ukraine.html"
	],
	[
		"2022-12-18",
		"UK sends Brimstone 2 precision-guided missiles to Ukrainian Armed Forces",
		"Велика Британія відправляє ЗСУ високоточні ракети Brimstone 2",
		"https://en.mehrnews.com/news/195079/UK-sends-Brimstone-2-precision-guided-missiles-to-Ukraine"
	],
	[
		"2022-12-18",
		"According to a video posted on Twitter, the Ukrainian armed forces use BATT UMG 4x4 armored vehicles on the battlefield. The vehicles are designed by American company The Armored Group, but have never been reported in US military aid supplies.",
		"Згідно з відео, опублікованим у Twitter, українські Збройні сили використовують на полі бою бронетехніку БАТТ UMG 4x4. Транспортні засоби розроблені американською компанією The Armored Group, але про них ніколи не повідомлялося у військовій допомозі США.",
		"https://www.armyrecognition.com/defense_news_december_2022_global_security_army_industry/batt_umg_4x4_armored_vehicles_from_us_manufacturer_are_in_service_with_ukrainian_army.html"
	],
	[
		"2022-12-19",
		"The $430.9 million Pentagon contract awarded on Dec. 2 will ramp up production of  HIMARS M142 launchers at Lockheed Martin’s sprawling manufacturing campus in East Camden. The new contract calls for full-rate production of four HIMARS launchers and 18 M777 howitzers headed for Ukraine. ",
		"Контракт Пентагону на суму 430,9 мільйона доларів США, укладений 2 грудня, дозволить збільшити виробництво пускових установок HIMARS M142 у розгалуженому виробничому містечку Lockheed Martin в Іст-Камдені. Новий контракт передбачає повномасштабне виробництво чотирьох пускових установок HIMARS і 18 гаубиць M777 для України.",
		"https://arkansasadvocate.com/2022/12/19/camden-made-rocket-launcher-and-missiles-changing-ukraine-conflict/"
	],
	[
		"2022-12-20",
		"House and Senate lawmakers have agreed to an omnibus package —a massive spending bill to keep the government going after Friday and into next year — that includes “about $45 billion” in new Ukraine aid. That’s eight billion more than what President Biden was reportedly asking for to finish out the year.",
		"Законодавці Палати представників і Сенату погодилися з комплексним пакетом — законопроектом про значні витрати, щоб уряд міг працювати після п’ятниці й наступного року — який включає «близько 45 мільярдів доларів» нової допомоги Україні. Це на вісім мільярдів більше, ніж просив президент Байден, щоб завершити рік.",
		"https://responsiblestatecraft.org/2022/12/20/about-45-billion-in-new-ukraine-aid-tucked-into-omnibus-bill/"
	],
	[
		"2022-12-21",
		"\"In recent days, France has sent Ukraine more arms, rocket launchers, Crotale (air defence batteries), equipment beyond what we had already done... We are also working with the armed forces minister (Sebastien Lecornu) to be able to deliver useful arms and ammunition again in the first quarter (of 2023), so that the Ukrainians would be able to defend themselves against bombardments\", Macron told France’s TF1 and LCI television.",
		"«Останніми днями Франція надіслала Україні більше зброї, ракетних установок, Crotale (батареї ППО), обладнання понад те, що ми вже зробили... Ми також працюємо з міністром збройних сил (Себастьєном Лекорню), щоб мати можливість доставити знову корисну зброю та боєприпаси в першому кварталі (2023 року), щоб українці могли захистити себе від бомбардувань», — сказав Макрон французьким телеканалам TF1 і LCI.",
		"https://www.firstpost.com/world/france-has-sent-air-defence-missiles-more-arms-to-ukraine-emmanuel-macron-11846461.html"
	],
	[
		"2022-12-21",
		"On December 21, as part of President Zelenskyy's visit to the White House, the Department of Defense (DoD) announced $1.85 billion in additional security assistance for Ukraine. This includes the authorization of a Presidential Drawdown of security assistance valued at up to $1 billion, as well as $850 million in assistance via the Ukraine Security Assistance Initiative (USAI).",
		"21 грудня в рамках візиту президента Зеленського до Білого дому Міністерство оборони (DoD) оголосило про надання Україні додаткової допомоги на безпеку в розмірі 1,85 мільярда доларів",
		"https://www.defense.gov/News/Releases/Release/Article/3252782/185-billion-in-additional-security-assistance-for-ukraine/"
	],
	[
		"2022-12-21",
		"Denmark has allocated more than $42 million (DKK 300 million) of additional military aid for Ukraine, according to the country’s Defense Ministry. The funds will be donated to the International Fund for Ukraine (IFU), an initiative launched by the U.K. and responsible for purchasing weapons for Ukraine.",
		"Данія виділила Україні понад 42 мільйони доларів (300 мільйонів датських крон) додаткової військової допомоги, повідомляє Міністерство оборони країни. Кошти будуть передані до Міжнародного фонду для України (IFU), ініціативи Великобританії, яка відповідає за закупівлю зброї для України.",
		"https://www.fmn.dk/da/nyheder/2022/danmark-donerer-300-mio.-kr.-til-fond-til-indkob-af-vaben-til-ukraine/"
	],
	[
		"2022-12-22",
		"Politico: Pentagon considers to provide Patriot missile system operations training for Ukrainian soldiers in the US.",
		"Politico: Пентагон розглядає можливість проведення навчань з обслуговування системи Patriot для ЗСУ на території США.",
		"https://www.politico.com/news/2022/12/22/military-training-ukrainians-patriot-united-states-00075284"
	],
	[
		"2022-12-23",
		"The Washington Post citing US defense officials that the Pentagon will not supply Abrams M1 tanks to Ukraine. The reason is that Abrams tanks are \"too difficult to maintain and complex to operate,\" and \"Ukraine has enough tanks already\".",
		"The Washington Post з посиланням на представників Міноборони США повідомляє, що Пентагон не буде поставляти Україні танки Abrams M1. Причина в тому, що танки «Абрамс» «надто складні в обслуговуванні та складні в експлуатації», а «в Україні вже достатньо танків».",
		"https://www.washingtonpost.com/national-security/2022/12/23/ukraine-weapons-biden/"
	],
	[
		"2022-12-23",
		"Poles have no doubts that they should continue to arm Ukrainian soldiers fighting against Russian aggression. This is the result of a study conducted by IBRiS on behalf of \"Rzeczpospolita\". ",
		"Поляки не сумніваються, що їм слід і надалі озброювати українських військових, які воюють проти російської агресії. Такий результат дослідження, проведеного IBRiS на замовлення «Rzeczpospolita».",
		"https://www.rp.pl/spoleczenstwo/art37662071-sondaz-polacy-chca-by-ukraina-dostala-od-nas-wiecej-broni"
	],
	[
		"2022-12-23",
		"Bulgaria Ministry of Defense announced start of the logistical operation in order to provide millitary aid for Ukraine. The message appeared on the official website of the organization. Earlier, official reports of help from Bulgaria conducted only small arms transportation.",
		"Міноборони Болгарії виступило з заявою про розгортання логістичних компонентів для надання військової допомоги для України. В повідомленні на сторінці міністерства йдеться про передачу озброєння та техніки. Раніше Болгарія повідомляла тільки про допомогу в якості стрілецької зброї.",
		"https://www.mod.bg/bg/news.php"
	],
	[
		"2022-12-23",
		"Estonia sends more military equipment to Ukraine. The latest military aid package announced by Minister of Defense Hanno Pevkur in a statement on Friday, includes drones, personal protective equipment and winter uniforms.",
		"Естонія надсилає Україні більше військової техніки. Останній пакет військової допомоги, оголошений міністром оборони Ганно Певкур у заяві в п’ятницю, включає безпілотники, засоби індивідуального захисту та зимову форму.",
		"https://news.err.ee/1608829969/estonia-sends-more-military-equipment-to-ukraine"
	],
	[
		"2022-12-23",
		"Prime Minister of Netherlands Mark Rutte made an announcement in a telephone call with Ukraine President Volodimir Zelenskyy that Netherlands reserves €2.5 billion to support Ukraine in 2023.",
		"Прем’єр-міністр Нідерландів Марк Рютте під час телефонної розмови з президентом України Володимиром Зеленським заявив, що Нідерланди резервують 2,5 мільярда євро на підтримку України у 2023 році.",
		"https://nltimes.nl/2022/12/23/netherlands-earmark-eu25-billion-support-ukraine-2023"
	],
	[
		"2022-12-24",
		"Minister of Defense of Lithuania: we're planning to provide $40mln. in millitary aid to Ukraine in 2023.",
		"Міністр Оборони Литви: ми запланували надати $40млн. військової допомоги Україні у 2023 році.",
		"https://www.delfi.lt/news/daily/lithuania/anusauskas-ivertino-ukrainieciams-suteikta-karine-pagalba-neatmesciau-kad-ateityje-galesime-perduoti-ir-tam-tikra-ginkluote.d?id=92122423"
	],
	[
		"2022-12-24",
		"Germany will co-finance the refurbishment and expansion of a Soviet-era factory in Romania to produce both NATO-standard shells and types compatible with Soviet-standard weapons used by Ukraine, according to German and Romanian officials. The project, which hasn’t been previously reported, could be unveiled by the end of this month.",
		"За словами офіційних осіб Німеччини та Румунії, Німеччина буде співфінансувати реконструкцію та розширення заводу радянських часів у Румунії для виробництва як стандартних снарядів НАТО, так і типів, сумісних із зброєю радянських стандартів, яку використовує Україна. Проект, про який раніше не повідомлялося, може бути представлений до кінця цього місяця.",
		"https://www.wsj.com/articles/europe-is-rushing-arms-to-ukraine-but-running-out-of-ammo-11671707775?mod=mhp"
	],
	[
		"2022-12-24",
		"Writing on Twitter on Saturday, Ukrainian presidential aide Mykhailo Podolyak said Iran \"blatantly humiliates the institution of international sanctions\", before calling for the destruction of Iranian weapon factories in response.",
		"У суботу в Twitter помічник президента України Михайло Подоляк заявив, що Іран \"відверто принижує інститут міжнародних санкцій\", а потім закликав у відповідь знищити іранські збройові заводи.",
		"https://www.reuters.com/world/middle-east/ukraine-official-urges-liquidation-iranian-weapon-factories-2022-12-24/"
	],
	[
		"2022-12-27",
		"Premier Giorgia Meloni on Tuesday voiced Italy's full political and military support for Ukraine in a telephone conversation with President Volodymyr Zelensky",
		"Прем'єр-міністр Джорджія Мелоні у вівторок у телефонній розмові з президентом Володимиром Зеленським висловила повну політичну та військову підтримку України з боку Італії.",
		"https://www.ansa.it/english/news/2022/12/27/ukraine-meloni-voices-full-political-and-military-support_e2de812e-f8f4-4c6d-8817-00b3fdc89253.html"
	],
	[
		"2022-12-27",
		"Anders Adlercreutz and other members of Parliament of Finland called the government for providing Ukraine with Leopard 2 battle tanks.",
		"Андерс Адлеркройц та інші депутати парламенту Фінляндії закликали уряд надати Україні бойові танки Leopard 2.",
		"https://andersadlercreutz.fi/blog/blog/ukraine-needs-a-leopard-operation/?lang=en"
	],
	[
		"2022-12-27",
		"Ukrainian President Volodymyr Zelenskyy announced on his Twitter account that Italy will provide an additional €10 million of aid to Ukraine and also considering providing air defense systems.",
		"Президент України Володимир Зеленський у своєму Twitter повідомив, що Італія надасть Україні додаткові €10 млн допомоги, а також розглядає можливість надання систем ППО.",
		"https://twitter.com/ZelenskyyUa/status/1607762593682161667"
	],
	[
		"2022-12-27",
		"Russian Foreign Minister Sergey Lavrov stated that the Kremlin will continue to pursue a military solution to the war until the Ukrainian government capitulates to Russia’s demands.",
		"Міністр закордонних справ Росії Сергій Лавров заявив, що Кремль продовжуватиме домагатися військового вирішення війни, поки український уряд не капітулює перед вимогами Росії.",
		"https://twitter.com/MIL_STD/status/1608474827098296320"
	],
	[
		"2022-12-28",
		"The U.S. Army Contracting Command (ACC) last month put out a notification for possible future delivery of International Field Artillery Tactical Data Systems (IFATDS) to Ukraine. IFATDS would increase HIMARS lethality by providing a secure communications system stitching together incoming information from various sources across the battlefield for a better common operating picture and greater situational awareness.",
		"Минулого місяця Контрактне командування Сухопутних військ США (ACC) оприлюднило повідомлення про можливу майбутню поставку в Україну Міжнародної системи тактичних даних для польової артилерії (IFATDS). IFATDS підвищить летальність HIMARS шляхом забезпечення захищеної системи зв'язку, яка об'єднує інформацію, що надходить з різних джерел з усього поля бою, для покращення загальної оперативної картини та більшої обізнаності щодо ситуації.",
		"https://www.thedrive.com/the-war-zone/ukraine-situation-report-pentagon-may-give-kyiv-advanced-himars-fire-control-system"
	],
	[
		"2022-12-28",
		"France's armed forces minister Sebastien Lecornu promised more military support for Kyiv on Wednesday, during his first visit to Ukraine. He told about \"innovative fund of 200 million euros\" which allows Ukraine to buy equipment directly from French manufacturers.\"",
		"Міністр збройних сил Франції Себастьєн Лекорню пообіцяв посилити військову підтримку Києва в середу, під час свого першого візиту в Україну. Він розповів про «інноваційний фонд у 200 млн євро», який дозволяє Україні купувати обладнання безпосередньо у французьких виробників».",
		"https://www.25newsnow.com/2022/12/28/frances-defense-minister-goes-ukraine-boost-support/"
	],
	[
		"2022-12-29",
		"Ukraine Weapons Tracker posted a photo of a dozen Pantera T6 4x4 APC delivered to Ukraine. No country has reported this transfer.",
		"Ukraine Weapons Tracker опублікував фото десятка БТРів Pantera T6 4x4, доставлених в Україну. Жодна країна не повідомила про цю передачу.",
		"https://twitter.com/UAWeapons/status/1608204566331285504"
	],
	[
		"2022-12-29",
		"Defence Secretary of the United Kingdom Ben Wallace has said that Russia must face “long-term consequences” for its actions in Ukraine. “But also, in parallel, it’s making sure that Ukraine can win on the ground, that it can push back Russia’s forces.”",
		"Міністр оборони Великої Британії Бен Воллес заявив, що Росія повинна зіткнутися з \"довгостроковими наслідками\" своїх дій в Україні. «Але також, паралельно, це гарантує, що Україна може перемогти на землі, що вона може відкинути сили Росії».",
		"https://www.greatyarmouthmercury.co.uk/news/national/23218535.russia-must-face-long-term-consequences-ukraine-says-wallace/"
	],
	[
		"2022-12-29",
		"US government considers providing Ukraine forces with Bradley armored fighting vehicles.",
		"Влада США розглядає можливості постачання БМП Бредлі для ЗСУ.",
		"https://www.bloomberg.com/news/articles/2022-12-29/us-weighs-sending-bradley-fighting-vehicles-to-bolster-ukraine"
	],
	[
		"2022-12-30",
		"NATO Secretary General Jens Stoltenberg called on NATO member states to supply more weapons to Ukraine. \"I call on allies to do more. It is in all our security interests to make sure Ukraine prevails and (Russian President Vladimir) Putin does not win.\"",
		"Генеральний секретар НАТО Єнс Столтенберг закликав країни-члени НАТО постачати Україні більше зброї. «Я закликаю союзників зробити більше. Це в інтересах нашої безпеки — переконатися, що Україна переможе, а (президент Росії Володимир) Путін не переможе».",
		"https://www.reuters.com/world/europe/natos-stoltenberg-calls-more-weapons-ukraine-dpa-2022-12-30/"
	],
	[
		"2022-12-30",
		"The UK has donated more than 1,000 VALLON metal detectors and 100 bomb de-arming kits to Ukraine to help clear minefields and make safe reclaimed territory, civilian homes, and infrastructure.",
		"Великобританія передала Україні понад 1000 металошукачів VALLON і 100 комплектів для знешкодження бомб, щоб допомогти розмінувати поля та зробити безпечними відвойовані території, цивільні будинки та інфраструктуру.",
		"https://www.gov.uk/government/news/uk-military-support-for-ukraine-continues-with-delivery-of-counter-explosive-ordnance-equipment"
	],
	[
		"2022-12-31",
		"The Czech crowdfunding campaign \"Gift for Putin\" has successfully raised new funds to purchase 15 Viktor mobile short-range air defense systems for Ukraine. The vehicle is developed and manufactured by the Czech company Excalibur Army",
		"Чеська краудфандингова кампанія «Подарунок для Путіна» успішно зібрала нові кошти на закупівлю для України 15 мобільних ЗРК ближнього радіусу дії «Віктор». Машину розробляє та виробляє чеська компанія Excalibur Army",
		"https://www.armyrecognition.com/defense_news_december_2022_global_security_army_industry/ukraine_to_receive_15_czech_viktor_air_defense_systems_thanks_to_crowdfunding_campaign_gift_for_putin.html"
	],
	[
		"2023-01-02",
		"Krauss-Maffei Wegmann from Germany starts production of RCH 155 155mm howitzers for Ukraine",
		"Krauss-Maffei Wegmann з Німеччини починає виробництво 155-мм гаубиць RCH 155 для України",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/kmw_from_germany_starts_production_of_rch_155_155mm_howitzers_for_ukraine.amp.html"
	],
	[
		"2023-01-02",
		"Canadian armored vehicle maker Roshel has delivered Senator high-tech armoured personnel carriers to Ukrainian Armed Forces. “Roshel company delivered over 100 vehicles. Over 300 on their way to Ukraine,” senior company representatives said.",
		"Канадський виробник бронетехніки Roshel поставив Збройним Силам України високотехнологічні бронетранспортери Senator.\n«Компанія «Рошел» поставила понад 100 автомобілів. Понад 300 їдуть в Україну», – повідомили в компанії.",
		"https://defence-blog.com/ukraine-receives-hundreds-of-senator-armored-vehicles-from-canada/"
	],
	[
		"2023-01-03",
		"Ukrainian army receives two Swedish Bandvagn 202 all-terrain vehicles. In the future, the Armed Forces of Ukraine should receive another 10-12 vehicles.",
		"Українська армія отримала два шведські всюдиходи Bandvagn 202. У перспективі Збройні сили України мають отримати ще 10-12 одиниць.",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/ukrainian_army_receives_swedish_bandvagn_202_all-terrain_vehicles.htmll"
	],
	[
		"2023-01-03",
		"Paris will transfer AMX-10RC high-armored vehicles to Ukraine. Information has been provided by France officials, after the phone call between E. Macron and V. Zelenskyi.",
		"Париж надасть Україні важкоброньовані автомобілі AMX-10RC. Цю інформацію виданню надав один із посадовців Франції після розмови Еманнуеля Макрона з Володимиром Зеленським.",
		"https://www.reuters.com/world/europe/russia-blames-its-soldiers-mobile-phone-use-deadly-missile-strike-2023-01-03/"
	],
	[
		"2023-01-04",
		"Germany to supply Ukraine with twenty 70mm rocket launchers mounted on pickup trucks.",
		"Німеччина поставить Україні двадцять 70-мм реактивних систем залпового вогню, встановлених на пікапах.",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/germany_to_supply_ukraine_with_70mm_rocket_launchers_mounted_on_pickup_trucks.html"
	],
	[
		"2023-01-05",
		"Germany announced it will provide armored personnel carriers and a Patriot missile battery to Ukraine.",
		"Німеччина оголосила, що надасть Україні бронетранспортери та батарею ракет Patriot.",
		"https://www.pbs.org/newshour/politics/watch-live-pentagon-holds-news-briefing-after-u-s-announces-more-military-aid-to-ukraine"
	],
	[
		"2023-01-05",
		"The Norwegian government announced that it has delivered another 10,000 155mm shells to Ukraine. ",
		"Уряд Норвегії оголосив про доставку в Україну ще 10 тисяч 155-мм снарядів.",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/norway_donates_additional_artillery_ammunition_to_ukraine.html"
	],
	[
		"2023-01-06",
		"Department of Defense officials unveiled the more than $3 billion package of military capabilities for Ukraine. This is the largest drawdown authority the United States has committed to so far. It includes 50 M2-A2 Bradley Fighting Vehicles, 100 M-113 armored personnel carriers, 50 mine-resistant, ambush-protected vehicles and 138 Humvees. The PDA will provide 18 self-propelled 155 mm Paladin howitzers, 36 105 mm towed howitzers and thousands of rounds to supply both systems.",
		"Міністерство оборони США оприлюднило пакет військових можливостей для України вартістю понад 3 мільярди доларів. Він включає 50 бойових машин M2-A2 Bradley, 100 бронетранспортерів M-113, 50 протимінно-захищених машин і 138 Humvee. Це фінансування також забезпечить 18 самохідних 155-мм гаубиць Paladin, 36 105-мм буксируваних гаубиць і тисячі снарядів для цих систем.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3261583/us-3-billion-military-package-to-ukraine-looks-to-change-battlefield-dynamics/"
	],
	[
		"2023-01-07",
		"Condoleezza Rice and Robert Gates published their open letter in Washington Post in which they state that any negotiated ceasefire agreement with Russia under current circumstances is unacceptable. \"The only way to avoid such a scenario is for the United States and its allies to urgently provide Ukraine with a dramatic increase in military supplies and capability — sufficient to deter a renewed Russian offensive and to enable Ukraine to push back Russian forces in the east and south.\"",
		"Кондоліза Райс і Роберт Гейтс оприлюднили свою думку в Washington Post, в якій вони стверджують, що будь-яка домовленість про припинення вогню з Росією за нинішніх обставин є неприйнятною. «Єдиний спосіб уникнути такого сценарію — це терміново надати Україні та їхнім союзникам різке збільшення військових поставок і можливостей — достатніх, щоб стримати новий російський наступ і дати Україні змогу відкинути російські сили на сході і на півдни.",
		"https://www.washingtonpost.com/opinions/2023/01/07/condoleezza-rice-robert-gates-ukraine-repel-russia/"
	],
	[
		"2023-01-08",
		"On January 6, 2023, during an interview with the Finnish TV channel MTV, Antti Häkkänen Chairman of the Finnish Defense Committee and member of the Finnish Parliament said that Finland is ready to supply Leopard 2 Main Battle tanks to Ukraine.",
		"Голова Комітету з питань оборони Фінляндії та член парламенту Фінляндії Антті Хаккянен заявив, що Фінляндія готова поставити Україні основні бойові танки Leopard 2.",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/finland_is_ready_to_supply_ukraine_with_leopard_2_mbts_main_battle_tanks.html"
	],
	[
		"2023-01-09",
		"The U.S. is considering sending Stryker armored combat vehicles to Ukraine in an upcoming aid package.",
		"США розглядають можливість відправки Україні бойових броньованих машин Stryker в рамках майбутнього пакету допомоги.",
		"https://www.politico.com/news/2023/01/09/pentagon-stryker-combat-vehicles-ukraine-00077083"
	],
	[
		"2023-01-09",
		"Poland Presidential Minister Jakub Kumoch in his interview to Radio ZET said about possible deliveries of Leopard tanks transfer to Ukraine: \"The case is pending. We are talking about symbolic support, a few, a dozen pieces.\"",
		"Міністр президента Польщі Якуб Кумох в інтерв'ю Radio ZET заявив про можливі поставки Україні танків Leopard: \"Справа знаходиться на розгляді. Мова йде про символічну підтримку, дюжина штук\".",
		"https://wiadomosci.radiozet.pl/Gosc-Radia-ZET/jakub-kumoch-o-leopardach-dla-ukrainy-kilka-kilkanascie-sztuk-dzis-bbn-w-tej-sprawie-9012023"
	],
	[
		"2023-01-10",
		"European Commission President Ursula von der Leyen and NATO Secretary General Jens Stoltenberg support providing Ukraine with modern weapons systems. They outlined this position on Tuesday in Brussels at a press conference, answering a question about possible deliveries of offensive weapons, in particular, German Leopard-2 tanks.",
		"Президент Єврокомісії Урсула фон дер Ляєн і генсек НАТО Єнс Столтенберг підтримують надання Україні сучасних систем озброєння. Таку позицію вони виклали у вівторок у Брюсселі на прес-конференції, відповідаючи на запитання про можливі поставки наступального озброєння, зокрема німецьких танків Leopard-2.",
		"https://en.interfax.com.ua/news/general/883455.html"
	],
	[
		"2023-01-10",
		"Czech company Excalibur Army invests 27 millions Euro in the expansion of production facilities in Šternberk to increase their output of military aid to Ukraine. Earlier in December Deputy Defence Minister Tomáš Kopečný said in an interview to Czech Radio that Czech Republic is intended to invite thousands of Ukrainian weapons experts to fill thousands of job vacancies in the Czech arms industry to help meet Ukrainian armed forces demand.",
		"Чеська компанія Excalibur Army інвестує 27 мільйонів євро в розширення виробництва в Штернберку, щоб збільшити випуск військової допомоги Україні. Раніше в грудні заступник міністра оборони Томаш Копечні заявив в інтерв'ю Чеському радіо, що Чеська Республіка має намір запросити тисячі українських експертів із зброї для заповнення тисяч вакансій у чеській збройовій промисловості, щоб допомогти задовольнити потреби українських збройних сил.",
		"https://en.interfax.com.ua/news/investments/883461.html"
	],
	[
		"2023-01-10",
		"Sweden confirms the delivery to Ukraine of ARCHER 155mm self-propelled howitzers",
		"Швеція підтвердила поставку в Україну 155-мм самохідних гаубиць ARCHER",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/sweden_confirms_the_delivery_to_ukraine_of_archer_155mm_self-propelled_howitzers.html"
	],
	[
		"2023-01-10",
		"The Canadian government has announced it will buy a National Advanced Surface-to-Air Missile System (NASAMS) from the United States and donate it to Ukraine. In addition to NASAMS, the government will also supply Ukraine with all associated munitions.",
		"Уряд Канади оголосив, що придбає у США Національну вдосконалену зенітно-ракетну систему (NASAMS) і подарує її Україні. Крім NASAMS, уряд також постачатиме в Україну всі супутні боєприпаси.",
		"https://www.canada.ca/en/department-national-defence/news/2023/01/defence-minister-anita-anand-announces-air-defence-system-donation-to-ukraine.html"
	],
	[
		"2023-01-10",
		"Pakistan set to dispatch 159 containers of ammunition to Ukraine",
		"Пакистан має намір відправити в Україну 159 контейнерів боєприпасів",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/canada_purchases_from_us_one_nasams_air_defense_missile_system_for_ukraine.amp.html"
	],
	[
		"2023-01-11",
		"Greece suspended an arms swap deal with Germany that included the transfer of BMP-1 armored vehicles from its inventory to Ukraine in return for receiving German Marder 1A3s infantry fighting vehicles.\n40 Marder vehicles will be delivered directly to Ukraine by Germany. \nGreece refused to send the BMP-1s to Ukraine unless it received six more of the German military vehicles, in addition to the 14 shipped so far.",
		"Греція призупинила угоду з Німеччиною про обмін озброєннями, яка передбачала передачу Україні бронетехніки БМП-1 зі свого складу в обмін на отримання німецьких бойових машин піхоти Marder 1A3s.\n40 автомобілів Marder Німеччина поставить безпосередньо в Україну.\nГреція відмовилася надіслати Україні БМП-1, якщо не отримає ще шість німецьких військових машин на додаток до 14 поставлених на даний момент.",
		"https://www.aa.com.tr/en/europe/greece-suspends-arms-swap-deal-with-germany-says-local-media/2785053"
	],
	[
		"2023-01-12",
		"Croatian Prime Minister Andrej Plenkovic met with Estonian Prime Minister Kaja Kallas in Tallinn. During the meeting he confirmed that his country will continue to support Ukraine in the war with Russia. Plenkovic expressed regret that the Croatian parliament did not support the symbolic step and did not allow military instructors to be sent to train Ukrainians as part of the European Union mission.",
		"У Таллінні прем'єр-міністр Хорватії Андрей Пленкович зустрівся з прем'єр-міністром Естонії Каєю Каллас. Під час зустрічі він підтвердив, що його країна й надалі підтримуватиме Україну у війні з Росією. Пленкович висловив жаль, що хорватський парламент не підтримав символічний крок і не дозволив відправити військових інструкторів для навчання українців у складі місії Євросоюзу.",
		"https://www.err.ee/1608848515/horvaatia-peaminister-jatkame-ukraina-abistamist"
	],
	[
		"2023-01-12",
		"Germany will send around 40 Marder infantry fighting vehicles to Ukraine before the end of March.",
		" До кінця березня Німеччина надішле Україні близько 40 бойових машин піхоти Marder.",
		"https://www.euronews.com/2023/01/12/germany-to-send-up-to-40-armoured-fighting-vehicles-to-ukraine"
	],
	[
		"2023-01-14",
		"Sending Challenger 2 tanks to Ukraine is the start of a gear change in the UK’s support. A squadron of 14 tanks will go into the country in the coming weeks after the Prime Minister told President Zelenskyy that the UK would provide additional support to aid Ukraine’s land war. Around 30 AS90s, which are large, self-propelled guns, operated by five gunners, are expected to follow. The Defence Secretary will set out further details of this support in the House of Commons on Monday.",
		"Відправка танків Challenger 2 в Україну є початком зміни передач у підтримці Великобританії. Ескадрилья з 14 танків відправиться в країну найближчими тижнями після того, як прем’єр-міністр сказав президенту Зеленському, що Великобританія надасть додаткову підтримку для допомоги Україні у сухопутній війні. Очікується, що слідом за ними буде близько 30 великих самохідних гармат AS90, якими керуватимуть п’ять стрільців. Міністр оборони викладе додаткові подробиці цієї підтримки в Палаті громад у понеділок.",
		"https://www.gov.uk/government/news/pm-accelerates-ukraine-support-ahead-of-anniversary-of-putins-war"
	],
	[
		"2023-01-15",
		"Chairman of the Board of Directors of Rheinmetall, Armin Papperger stated that the preparation of tanks and related equipment deliveries to Ukraine may take up to one year. This applies for tanks that are Rheinmetall property, he emphasised in his interview for the BILD.",
		"Керівник ради директорів військового концерну Rheinmetall, Армін Паппенгер заявив, що підготовка передачі танків та допоміжного спорядження для України може зайняти до року. У інтерв'ю виданню BILD він наголосив, що мова йдеться про танки у власності самого концерну.",
		"https://www.bild.de/politik/inland/politik-inland/rheinmetall-chef-wir-koennen-2023-keine-leopard-panzer-liefern-82554802.bild.html"
	],
	[
		"2023-01-15",
		"Germany delivers to Ukraine 4 Minenräumpanzer MiRPz Keiler mine clearing armored vehicles",
		"Німеччина поставила в Україну 4 бронемашини для розмінування Minenräumpanzer MiRPz Keiler",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/germany_delivers_to_ukraine_4_minenraumpanzer_mirpz_keiler_mine_clearing_armored_vehicles.amp.html"
	],
	[
		"2023-01-15",
		"British Ministry of Defense denied media reports it plans to supply its AH-64 Apache attack helicopters to Ukraine.",
		"Міністерство оборони Великої Британії спростувало повідомлення ЗМІ про плани постачати Україні ударні вертольоти AH-64 Apache.",
		"https://defence-blog.com/uk-denies-media-report-it-plans-to-supply-apache-helicopters-to-ukraine/"
	],
	[
		"2023-01-16",
		"NATO Secretary General Jens Stoltenberg told Handelsblatt he expected Western nations to send more \"heavy warfare equipment ... in the near future.\" \"We are in a decisive phase of the war,\" Stoltenberg added. \"Therefore, it is important that we provide Ukraine with the weapons it needs to win.\"",
		"Генеральний секретар НАТО Єнс Столтенберг сказав Handelsblatt, що очікує, що західні країни надішлють більше «важкої військової техніки... найближчим часом». \"Ми перебуваємо у вирішальній фазі війни\", - додав Столтенберг. «Тому важливо, щоб ми надали Україні зброю, необхідну для перемоги».",
		"https://www.handelsblatt.com/politik/international/nato-chef-jens-stoltenberg-wir-leben-jetzt-in-einer-gefaehrlicheren-welt/28923730.html"
	],
	[
		"2023-01-16",
		"Poland's Prime Minister Mateusz Morawiecki said that he wants the German government to supply a wide range of weapons to Kyiv and voiced hope that Germany would soon approve a transfer of battle tanks to strengthen Ukraine's defense against Russian forces in the war.",
		"Прем'єр-міністр Польщі Матеуш Моравецький заявив, що хоче, щоб уряд Німеччини постачав Києву широкий спектр озброєнь, і висловив сподівання, що Німеччина незабаром схвалить передачу бойових танків для зміцнення оборони України від російських військ у війні.",
		"https://www.usnews.com/news/business/articles/2023-01-16/polands-pm-calls-on-germany-to-send-more-weapons-to-ukraine"
	],
	[
		"2023-01-16",
		"German Foreign Minister Annalena Baerbock in her speech in Hague called for special tribunal to prosecute Russian leaders over invasion of Ukraine.",
		"Міністр закордонних справ Німеччини Анналена Бербок у своїй промові в Гаазі закликала створити спеціальний трибунал для судового переслідування лідерів Росії за вторгнення в Україну.",
		"https://www.politico.eu/article/germany-annalena-baerbock-russia-ukraine-war-proposes-special-tribunal-to-prosecute-russian-leadership/"
	],
	[
		"2023-01-16",
		"Britain's defence minister Ben Wallace outlined further military support for Ukraine, confirming the supply of 14 Challenger 2 tanks. \"Today, I can announce the most significant package of combat power to date to accelerate Ukrainian success. This includes a squadron of Challenger 2 tanks with armoured recovery and repair vehicles,\" Wallace said to parliament. The package also includes 8 AS90 self-propelled artillery, hundreds more armoured and protective vehicles including Bulldog personnel carriers, a manoeuvre support package including minefield breaching and bridging capabilities, dozens more \"uncrewed aerial systems\" to support artillery, 100,000 artillery rounds, hundreds more sophisticated missiles including Guided Multiple Launch Rocket System (GMLRS), Starstreak air defence, medium range air defence missiles.",
		"Міністр оборони Великої Британії Бен Уоллес окреслив подальшу військову підтримку України, підтвердивши постачання 14 танків Challenger 2. «Сьогодні я можу оголосити про найбільш значний пакет бойової потужності на сьогоднішній день для прискорення успіху України. Це включає ескадрилью танків Challenger 2 з броньованими евакуаційно-ремонтними машинами», — сказав Воллес у парламенті. Пакет також включає в себе 8 самохідних артилерійських установок AS90, сотні інших броньованих і захисних машин, включаючи транспортери Bulldog, пакет підтримки маневру, включаючи можливості пробивання мінних полів і мостів, десятки інших «безпілотних літальних систем» для підтримки артилерії, 100 000 артилерійських снарядів, сотні інших. складні ракети, включаючи керовану ракетну систему залпового вогню (GMLRS), систему ППО Starstreak, ракети ППО середньої дальності.",
		"https://www.reuters.com/world/europe/uk-defence-minister-sets-out-further-military-aid-package-ukraine-2023-01-16/"
	],
	[
		"2023-01-16",
		"Ukrainian soldiers are in Spain to be trained on Hawk air defense missile system",
		"Українські військові навчаються в Іспанії на зенітно-ракетному комплексі Hawk",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/ukrainian_soldiers_are_in_spain_to_be_trained_on_hawk_air_defense_missile_system.amp.html"
	],
	[
		"2023-01-16",
		"Lithuanian President Gitanas Nausėda attended the second Lublin Triangle summit meeting in Lviv with the Presidents of Ukraine and Poland. President Gitanas Nausėda announced at a post-meeting press conference that Lithuania will deliver Bofors L70 short-range automatic anti-aircraft systems and related munitions to Ukraine",
		"Президент Литви Гітанас Науседа взяв участь у другому саміті Люблінського трикутника у Львові з президентами України та Польщі. Президент Гітанас Науседа оголосив на прес-конференції після зустрічі, що Литва поставить Україні автоматичні зенітні системи малої дальності Bofors L70 і відповідні боєприпаси.",
		"https://www.overtdefense.com/2023/01/16/lithuania-to-supply-ukraine-with-bofors-l70-anti-aircraft-guns/"
	],
	[
		"2023-01-17",
		"The Pentagon is tapping into a vast but little-known stockpile of American ammunition in Israel to help meet Ukraine’s dire need for artillery shells in the war with Russia, American and Israeli officials say.",
		"Пентагон використовує величезні, але маловідомі запаси американських боєприпасів в Ізраїлі, щоб допомогти задовольнити гостру потребу України в артилерійських снарядах під час війни з Росією, кажуть американські та ізраїльські офіційні особи.",
		"https://www.nytimes.com/2023/01/17/us/politics/ukraine-israel-weapons.html"
	],
	[
		"2023-01-17",
		"The Netherlands plans to join the US and Germany in sending a Patriot missile defense system to Ukraine, Dutch Prime Minister Mark Rutte said",
		"Нідерланди планують приєднатися до США та Німеччини в відправці в Україну системи протиракетної оборони Patriot, заявив прем'єр-міністр Нідерландів Марк Рютте",
		"https://edition.cnn.com/europe/live-news/russia-ukraine-war-news-1-17-23/index.html"
	],
	[
		"2023-01-18",
		"British Foreign Secretary James Cleverly said Tuesday during a visit to Washington the West needs to ramp up military assistance to Ukraine to ensure the war with Russia does not turn into a bloody, open-ended stalemate. That is why “we think now is the right time to intensify our support for Ukraine,” he said. “We can’t allow this to drag on and become a kind of First World War attritional-type stalemate.” ",
		"Міністр закордонних справ Великої Британії Джеймс Клеверлі заявив під час візиту до Вашингтона, що Заходу необхідно збільшити військову допомогу Україні, щоб гарантувати, що війна з Росією не перетвориться на криваву безстрокову безвихідь. Тому «ми вважаємо, що зараз слушний час, щоб активізувати нашу підтримку України», — сказав він. «Ми не можемо дозволити, щоб це затягнулося і стало своєрідним глухим кутом Першої світової війни».",
		"https://www.nbcnews.com/news/world/west-must-increase-aid-ukraine-avoid-russia-war-stalemate-rcna66215"
	],
	[
		"2023-01-18",
		"Minister of Defense of Canada Anita Anand anounced new military aid package for Ukraine. It will include 200 armored Senator APC vehicles.",
		"Міністр оборони Канади Аніта Ананд заявила про новий пакет військової допомоги для України. До нього увійдуть 200 броньованих машин Senator APC.",
		"https://nationalpost.com/news/canada-purchasing-200-armoured-personnel-carriers-for-ukraine"
	],
	[
		"2023-01-18",
		"Belgian M109A4BE Howitzers were spotted in Ukraine in 17th Kryvyj Rih separate tank brigade. Earlier, in June 2022, the chief of Minister of Defence of the UK Ben Wallace announced that 20 Belgium 155-mm howitzers were purchased on global market for Ukraine.",
		"Бельгійські артилерийські установки M109A4BE були помічені у використанні 17-ої окремої танкової Криворізької бригади. Раніше, у червні 2022 року, міністр оборони Великої Британії Бен Уоллес анонсував, що 20 бельгійських 155-мм установок були придбані для України на глобальному ринку.",
		"https://www.facebook.com/17otbr/posts/pfbid0qiMMjEwUqk3LcXajJ8gyANTEUFhrrnJgTKaTofwG3DYMb5Vdt1J4ra12aojDBf2fl"
	],
	[
		"2023-01-18",
		"Minister of Defense of Latvia confirmed new military aid for Ukraine. It includes anti-aircraft Stinger manpads, helicopters, machine guns with ammunition. In addition, unmanned aerial vehicles have been shipped.",
		"Міністр Оборони Латвії оголосила про передачу нового пакету військової допомоги для України. До нього увійшли системи протиповітряної оборони Стінгер, гелікоптери, кулемети та амуніція до них. Додатково, безпілотні літальні апарати.",
		"https://odessa-journal.com/latvia-sent-ukraine-helicopters-and-stinger-air-defense-systems/"
	],
	[
		"2023-01-18",
		"NATO chief Jens Stoltenberg calls for significant increase of arms supply for Ukraine. In his interview with Reuters at the economic forum in Davos, he also emphasized that this is necessary to achieve the prerequisites for potential negotiations.",
		"Генеральний секретар НАТО Єнс Столтенберг закликав країни-члени НАТО значно збільшити постачання зброї для України. У свому інтерв'ю виданню Reuters на економічному форумі в Давосі, він також підкреслив, що це необхідно для досягнення передумов для потенційних переговорів.",
		"https://www.reuters.com/world/europe/davos-2023-nato-chief-calls-significant-boost-arms-ukraine-2023-01-18/"
	],
	[
		"2023-01-19",
		"Poland would supply Ukraine with German-made Leopard battle tanks if Germany doesn’t grant approval for the transfer soon, Polish Prime Minister Mateusz Morawiecki said, increasing pressure on Berlin.",
		"Польща постачатиме Україні бойові танки Leopard німецького виробництва, навіть якщо Німеччина найближчим часом не дасть дозвіл на передачу, заявив польський прем’єр-міністр Матеуш Моравецький, посилюючи тиск на Берлін.",
		"https://www.wsj.com/articles/poland-suggests-it-would-send-german-made-tanks-to-ukraine-without-berlins-consent-11674123217"
	],
	[
		"2023-01-19",
		"The Swedish government announced a new package of military aid to Ukraine that will include 50 armoured infantry fighting vehicles and undisclosed number of 155-mm Archer artillery systems. The package is worth 4.3 billion Swedish crowns ($419 million) and will also include light, portable NLAW anti-tank weapons, mine-clearing equipment and assault rifles.",
		"Уряд Швеції оголосив про новий пакет військової допомоги Україні, який включатиме 50 броньованих бойових машин піхоти та невідому кількість 155-мм артилерійських систем Archer. Пакет вартістю 4,3 мільярда шведських крон (419 мільйонів доларів) також включатиме легку портативну протитанкову зброю NLAW, обладнання для розмінування та штурмові гвинтівки.",
		"https://www.reuters.com/world/europe/sweden-send-infantry-fighting-vehicles-ukraine-2023-01-19/"
	],
	[
		"2023-01-19",
		"The Estonian Ministry of Defense announced a new military aid package to Ukraine including a large number of heavy weapons such as FH-70 155mm and D-30 122mm towed howitzers that are worth €113 million.",
		"Міністерство оборони Естонії оголосило про новий пакет військової допомоги Україні, який включає велику кількість важкого озброєння, такого як буксирувані гаубиці FH-70 155 мм і D-30 122 мм, вартістю 113 мільйонів євро.",
		"https://www.kaitseministeerium.ee/en/news/estonian-minister-defence-allies-must-give-ukraine-heavy-weaponry"
	],
	[
		"2023-01-19",
		"The Danish government has decided to donate all of the 19 Caesar self-propelled howitzers it is buying from France to Ukraine.",
		"Уряд Данії вирішив передати Україні всі 19 самохідних гаубиць Caesar, які вона купує у Франції.",
		"https://defbrief.com/2023/01/19/denmark-donating-all-of-its-caesar-howitzers-to-ukraine/"
	],
	[
		"2023-01-19",
		"The Department of Defense (DoD) announced the authorization of a Presidential Drawdown of security assistance to meet Ukraine’s critical security and defense needs. This authorization, which is valued at up to $2.5 billion, contains hundreds of armored vehicles, critical support for Ukraine’s air defense, and other important capabilities including: additional munitions for National Advanced Surface-to-Air Missile Systems (NASAMS); 8 Avenger air defense systems; 59 Bradley Infantry Fighting Vehicles (IFVs) with 590 TOW anti-tank missiles and 295,000 rounds of 25mm ammunition; 90 Stryker Armored Personnel Carriers (APCs) with 20 mine rollers; 53 Mine Resistant Ambush Protected Vehicles (MRAPs); 350 High Mobility Multipurpose Wheeled Vehicles (HMMWVs); 20,000 155mm artillery rounds; 600 precision-guided 155mm artillery rounds; 95,000 105mm artillery rounds; 11,800 120mm mortar rounds; additional ammunition for High Mobility Artillery Rocket Systems (HIMARS);12 ammunition support vehicles; 6 command post vehicles; 22 tactical vehicles to tow weapons; High-speed Anti-radiation missiles (HARMs); approximately 2,000 anti-armor rockets; over 3,000,000 rounds of small arms ammunition; demolition equipment for obstacle clearing; claymore anti-personnel munitions; night vision devices; spare parts and other field equipment.",
		"Міністерство оборони США оголосило про новий пакет допомоги, який оцінюється в 2,5 мільярда доларів США, містить сотні бронетехніки, критично важливу підтримку для протиповітряної оборони України та інші важливі можливості, зокрема: додаткові боєприпаси для національних передових зенітно-ракетних систем (NASAMS); 8 ЗРК «Авенджер»; 59 бойових машин піхоти «Бредлі» (БМП) з 590 протитанковими ракетами TOW і 295 000 снарядів калібру 25 мм; 90 бронетранспортерів (БТР) «Страйкер» з 20 мінними установками; 53 протимінно-стійкі транспортні засоби (MRAP); 350 багатоцільових колісних транспортних засобів високої мобільності (HMMWV); 20 000 артилерійських снарядів калібру 155 мм; 600 високоточних 155-мм артилерійських снарядів; 95 000 артилерійських снарядів калібру 105 мм; 11 800 120-мм мінометних снарядів; додаткові боєприпаси для ракетно-артилерійських систем високої мобільності (HIMARS); 12 машин підтримки; 6 командно-штабних машин; 22 тактичних автомобіля для буксирування зброї; Високошвидкісні протирадіаційні ракети (HARMs); приблизно 2000 протитанкових ракет; понад 3 000 000 боєприпасів до стрілецької зброї; підривне обладнання для усунення перешкод; протипіхотні боєприпаси Клеймор; прилади нічного бачення; запчастини та інше польове обладнання.",
		"https://www.defense.gov/News/Releases/Release/Article/3272866/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-01-20",
		"The Polish Ministry of Defense Mariusz Błaszczak announced that Poland will provide more T-72 tanks and BWP-1 IFV, a Polish version of the Soviet-made BMP-1 to equip one brigade of the Ukrainian army.",
		"Міністр оборони Польщі Маріуш Блащак повідомив, що Польща надасть додаткові танки Т-72 і БМП BWP-1, польську версію радянської БМП-1, для оснащення однієї бригади української армії.",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/poland_will_equip_one_ukrainian_army_brigade_with_more_t-72_tanks_and_bwp-1_ifvs.html"
	],
	[
		"2023-01-20",
		"According to information published by the German Newspaper \"Handelsblatt\", Germany could propose refurbished ex-Jordanian army Challenger 1 Main Battle Tanks to Ukraine. Two countries in the Middle East including Oman and Jordan have a large quantity of Challenger 1 tanks that have been withdrawn from service.",
		"Згідно з інформацією, опублікованою німецькою газетою «Handelsblatt», Німеччина може запропонувати Україні відремонтовані колишні йорданські армійські основні бойові танки Challenger 1. Дві країни Близького Сходу, включаючи Оман і Йорданію, мають велику кількість танків Challenger 1, які були зняті з озброєння.",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/germany_could_propose_refurbished_challenger_1_main_battle_tanks_to_ukraine.html"
	],
	[
		"2023-01-20",
		"The Dutch Cabinet will look into supplying F-16 fighter jets to Ukraine.",
		"Кабмін Нідерландів розгляне постачання Україні винищувачів F-16.",
		"https://nltimes.nl/2023/01/20/netherlands-consider-helping-ukraine-f-16-fighters-leopard-2-tanks"
	],
	[
		"2023-01-22",
		"Germany will not keep Poland from sending tanks to Ukraine",
		"Німеччина не буде утримувати Польщу від відправлення танків в Україну",
		"https://amp.dw.com/en/ukraine-updates-germany-will-not-keep-poland-from-sending-tanks-to-ukraine/a-64480279"
	],
	[
		"2023-01-22",
		"According to an Algerian news outlet Menadefense, the Moroccan army sent nearly 20 T-72B tanks to the Ukriane last week. They have been reportedly modernized by the Czech company Excalibur Army in the Czech town of Sternbeck.",
		"За даними алжирського інформаційного видання Menadefense, минулого тижня марокканська армія відправила в Україну близько 20 танків Т-72Б. Повідомляється, що їх модернізувала чеська компанія Excalibur Army в чеському місті Штернбек.",
		"https://www.i24news.tv/en/news/ukraine-conflict/1674409784-morocco-gives-tanks-to-ukraine-report"
	],
	[
		"2023-01-22",
		"France does not rule out delivering Leclerc heavy combat tanks to Ukraine in its war against the Russian invader, announced Emmanuel Macron.",
		"Франція не виключає поставки Україні важких бойових танків Leclerc у війні проти російського окупанта, заявив Еммануель Макрон.",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/france_does_not_rule_out_delivering_leclerc_main_battle_tanks_to_ukraine.html"
	],
	[
		"2023-01-23",
		"Britain has “not ruled out” supplying Ukraine with missiles with sufficient range to destroy missile systems in Russia which may be targeting civilian infrastructure in Ukraine",
		"Британія «не виключила» постачання Україні ракет з достатньою дальністю, щоб знищити ракетні системи в Росії, які можуть бути націлені на цивільну інфраструктуру в Україні",
		"https://ukdefencejournal.org.uk/uk-not-ruling-out-giving-ukraine-missiles-to-reach-russia/"
	],
	[
		"2023-01-23",
		"Boris Johnson says Ukrainians should get ‘all the tools they need’",
		"Борис Джонсон каже, що українці повинні отримати «всі необхідні інструменти»",
		"https://www.theguardian.com/world/live/2023/jan/22/russia-ukraine-war-think-faster-and-send-tanks-now-ukraine-and-baltic-states-urge-germany-live?filterKeyEvents=false&page=with:block-63cd32ae8f080b4868cee9ce#block-63cd32ae8f080b4868cee9ce"
	],
	[
		"2023-01-24",
		"Estonian Ambassador to Ukraine Kaimo Kuusk said: \"We are giving all of our 155mm howitzers to Ukraine and we want to set a precedent in this way so that other countries don’t have excuses why they can’t give Ukraine the weapons to win the war”.",
		"Посол Естонії в Україні Каймо Кууск заявив: «Ми передаємо всі наші 155-мм гаубиці Україні і таким чином хочемо створити прецедент, щоб інші країни не мали виправдань, чому вони не можуть дати Україні зброю. виграти війну».",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/ukrainian_army_to_receive_all_remaining_estonian_fh-70_155mm_and_d-30_122mm_howitzers.html"
	],
	[
		"2023-01-24",
		"Cancellor Olaf Scholz approved the resolution to send Leopard 2 mod.2A6 to Ukraine.",
		"Канцлер Олаф Шольц підтвердив рішення надати танки Leopard модифікації 2А6 Україні.",
		"https://www.spiegel.de/politik/deutschland/krieg-in-der-ukraine-deutschland-schickt-leopard-panzer-a-e2dde871-88d0-4cf5-8aae-482d58fd850f"
	],
	[
		"2023-01-24",
		"12 countries considering sending their Leopard tanks after Germany approval",
		"12 країн розглядають можливість відправки своїх танків Leopard після схвалення Німеччини",
		"https://abcnews.go.com/International/ukraine-expects-100-leopard-2-tanks-12-countries/story?id=96620510"
	],
	[
		"2023-01-25",
		"German government annouced the delivery of 14 Leopard tanks for Ukraine from its Bundeswehr stocks. In addition, this militarry aid will include logistics and ammunition along with vehicle maintenance components.",
		"Уряд Німеччини оголосив про надання 14 танків Leopard для України з запасів Бундесверу. Додатково, даний пакет військової допомоги включатиме логістику, амуніцію та ремонтні компоненти і запчастини.",
		"https://www.bundesregierung.de/breg-de/aktuelles/bundesregierung-kuendigt-lieferung-von-leopard-2-panzern-an-die-ukraine-an-2160236"
	],
	[
		"2023-01-25",
		"Swedish Defense Minister Pål Jonson announced that Sweden does not exclude sending \"Stridsvagn 122 Main Battle Tank\" to Ukraine. The \"Stridsvagn 122\" is a Swedish variant of the German-made Leopard 2A5 tank.",
		"Міністр оборони Швеції Пол Йонсон заявив, що Швеція не виключає відправлення в Україну «Основного бойового танка Stridsvagn 122». \"Stridsvagn 122\" є шведським варіантом німецького танка Leopard 2A5.",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/sweden_could_follow_germany_with_the_delivery_of_stridsvagn_122_tanks_to_ukraine.htmll"
	],
	[
		"2023-01-25",
		"The Department of Defense (DoD) announces the procurement of Abrams tanks for Ukraine via the Ukraine Security Assistance Initiative (USAI), to support Ukraine's defense against Russian aggression. The capabilities in this package include: 31 Abrams tanks with 120mm rounds and other ammunition; 8 Tactical Vehicles to recover equipment; support vehicles and equipment; funding for training, maintenance, and sustainment.",
		"Міністерство оборони США оголосило про закупівлю танків Abrams для України через Ініціативу сприяння безпеці України (USAI) для підтримки захисту України від російської агресії. Цей пакет включає: 31 танк Abrams зі 120-мм снарядами та іншими боєприпасами; 8 тактичних машин для відновлення обладнання; допоміжні транспортні засоби та обладнання; фінансування навчання, обслуговування та підтримки.",
		"https://www.defense.gov/News/Releases/Release/Article/3277443/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-01-25",
		"The Dutch Cabinet is prepared to consider supplying modern Leopard 2 battle tanks to Ukraine. Prime Minister Rutte told in his interview that although Netherlands doesn’t own any tanks but leases from Germany, the Netherlands can buy these 18 Leopard 2 tanks and give them to Ukraine if necessary.",
		"Кабмін Нідерландів готовий розглянути постачання Україні сучасних бойових танків Leopard 2. Прем’єр-міністр Рютте сказав у своєму інтерв’ю, що хоча Нідерланди не володіють жодними танками, а орендують у Німеччини, Нідерланди можуть придбати ці 18 танків Leopard 2 і передати їх Україні, якщо це необхідно.",
		"https://nltimes.nl/2023/01/25/netherlands-considering-providing-ukraine-leopard-2-tanks"
	],
	[
		"2023-01-25",
		"Spain will join the delivery of Leopard tanks to kyiv once Germany, after months of resisting delivering it, has agreed to supply this powerful German-made battle tank to the Ukrainian Army.",
		"Іспанія приєднається до поставок танків «Леопард» Києву, коли Німеччина, після місяців спротиву щодо їх доставки, погодиться поставити українській армії цей потужний бойовий танк німецького виробництва.",
		"https://elpais.com/espana/2023-01-25/espana-se-suma-al-plan-europeo-para-entregar-tanques-leopard-a-ucrania.html"
	],
	[
		"2023-01-26",
		"Canada will supply Ukraine with four Leopard 2 A4 main battle tanks and Canadian Armed Forces trainers to teach Ukrainian soldiers how to operate the vehicles. These four tanks are combat-ready and will be deployed over the coming weeks.",
		"Канада передасть Україні чотири основні бойові танки Leopard 2 A4 протягом найближчих тижнів",
		"https://www.cbc.ca/news/politics/anita-anand-ukraine-military-assistance-1.6726949"
	],
	[
		"2023-01-26",
		"Nuland: The US will not have time to send tanks to Ukraine until spring, when an attack is expected",
		"Нуланд: США не встигнуть відправити танки в Україну до весни, коли очікується атака",
		"https://newsunrolled.com/world/169053.html"
	],
	[
		"2023-01-26",
		"Estonia is considering including 155 mm cluster munition projectiles among its military aid to Ukraine. Many Western countries condemn the use of munitions clusters and have ceased their use, noting that it poses a threat to civilian populations. Estonia, however, has considered it an effective tool against an overwhelming adversary.",
		"Естонія розглядає можливість включити 155-мм касетні снаряди до військової допомоги Україні. Багато західних країн засуджують використання касетних боєприпасів і припинили їх використання, зазначивши, що це становить загрозу для цивільного населення. Естонія, однак, вважала це ефективним інструментом проти переважаючого супротивника.",
		"https://news.err.ee/1608864767/estonia-weighing-giving-ukraine-cluster-munitions"
	],
	[
		"2023-01-27",
		"The majority of Germans support the decision to deliver Leopard 2 tanks to Ukraine. 54% of respondents voted for holding this decision, 38% voted against.",
		"Більшість громадян Німеччини підтримують рішення надати танки Leopard 2 Україні. Свій голос \"за\" віддали 54%, \"проти\" проголосувало 38% респондентів.",
		"https://www.zdf.de/nachrichten/politik/politbarometer-leopard-panzer-lieferung-ukraine-krieg-russland-100.html"
	],
	[
		"2023-01-27",
		"Prime Minister of Beligium Alexander De Croo announced a new military support package of more than 90 million euros for Ukraine. The package includes vehicles, including light armored vehicles, AMRAAM missiles (“Advanced Medium Range Air-to-Air Missiles”), light anti-tank weapons (LAW) and anti-tank grenades would be sent. In addition, there are Minimi machine guns and automatic rifles of the SCAR type.",
		"Прем'єр-міністр Бельгії Александр де Кроо анонсував новий пакет військової підтримки для України на понад 90 мільйонів євро. Пакет включає транспортні засоби, в тому числі легку броньовану техніку, ракети AMRAAM («Удосконалені ракети повітря-повітря середньої дальності»), легку протитанкову зброю (LAW) і протитанкові гранати. Крім того, є кулемети Мінімі та автоматичні гвинтівки типу SCAR.",
		"https://www.hln.be/binnenland/premier-de-croo-bevestigt-ruim-90-miljoen-euro-aan-militaire-steun-voor-oekraine-grootste-steunpakket-tot-nu-toe~a1c0f487/"
	],
	[
		"2023-01-27",
		"Polish premier Mateusz Morawiecki announced in his interview that Poland has agreed to send 60 more tanks to Ukraine in addition to the 14 German-made Leopard 2 tanks it already announced it will send. 30 of the 60 tanks Poland will transfer would be PT-91 tanks, a heavily updated version of the Russian-made T-72 tank with local and Western components.",
		"Прем'єр-міністр Польщі Матеуш Моравецький заявив в інтерв'ю, що Польща погодилася відправити в Україну ще 60 танків на додаток до 14 німецьких танків Leopard 2, про які вона вже оголосила. 30 із 60 танків, які Польща передасть, будуть танками PT-91, оновленою версією танка T-72 російського виробництва з місцевими та західними компонентами.",
		"https://www.aa.com.tr/en/russia-ukraine-war/poland-to-send-60-more-tanks-to-ukraine-in-addition-to-14-leopard-2/2799176"
	],
	[
		"2023-01-28",
		"Ukrainian presidential adviser Mykhailo Podolyak reported that Ukraine and its Western allies are engaged in “fast-track” talks on the possibility of equipping the invaded country with long-range missiles and military aircrafts.",
		"Радник президента України Михайло Подоляк повідомив, що Україна та її західні союзники ведуть \"прискорені\" переговори щодо можливості оснащення України ракетами великої дальності та військовою авіацією",
		"https://www.cnbc.com/2023/01/28/fast-track-talks-are-underway-between-ukraine-and-western-allies-for-missiles-and-planes.html"
	],
	[
		"2023-01-29",
		"Former Defense Secretary Robert Gates said that a lot of the U.S.’s military aid to Ukraine “could have been done sooner.” “I think the only thing I would have said is that a lot of this could have been done sooner,” Gates said when asked by Chuck Todd on NBC’s “Meet the Press” if he would have advised President Biden to do anything differently.",
		"Колишній міністр оборони Роберт Гейтс заявив, що велику частину військової допомоги США Україні \"можна було зробити раніше\". Гейтс відповів на запитання Чака Тодда в ефірі NBC «Знайомство з пресою», чи порадив би він президенту Байдену зробити щось інакше.",
		"https://thehill.com/homenews/sunday-talk-shows/3835113-gates-a-lot-of-us-military-aid-to-ukraine-could-have-been-done-sooner/"
	],
	[
		"2023-01-30",
		"US to increase artillery rounds production by 500% for US armed forces and Ukraine",
		"США збільшить виробництво артилерійських снарядів на 500% для збройних сил США та України",
		"https://www.armyrecognition.com/defense_news_january_2023_global_security_army_industry/us_to_increase_artillery_rounds_production_by_500_for_us_armed_forces_and_ukraine.amp.html"
	],
	[
		"2023-01-30",
		"The Nato secretary-general has called on South Korea to supply military assistance to Ukraine, stressing Kyiv's “urgent need” for more ammunition.",
		"Генсек НАТО закликав Південну Корею надати військову допомогу Україні, наголосивши на «нагальній потребі» Києва в додаткових боєприпасах.",
		"https://www.ft.com/content/68417c45-3f3c-4162-8cd4-5111de03884a"
	],
	[
		"2023-01-31",
		"France will send 12 additional Caesar howitzers to Ukraine according to the defence minister of France Sébastien Lecornu.",
		"Франція надішле в Україну 12 додаткових гаубиць Caesar, повідомив міністр оборони Франції Себастьєн Лекорню.",
		"https://www.theguardian.com/world/live/2023/jan/31/russia-ukraine-war-live-biden-says-the-us-will-not-provide-f-16-fighter-jets-to-ukraine"
	],
	[
		"2023-01-31",
		"France and Australia have agreed to join forces to produce thousands of artillery shells to help Ukraine.",
		"Франція та Австралія домовилися об’єднати зусилля для виробництва тисяч артилерійських снарядів для допомоги Україні.",
		"https://www.voanews.com/a/australia-and-france-to-supply-artillery-shells-to-ukraine-/6941224.html"
	],
	[
		"2023-02-01",
		"Israel Prime Minister Benjamin Netanyahu said in an interview with CNN that Israel does not reject sending military aid to Ukraine and he was \"definitely considering\" providing military support to Kyiv. He separately noted that Israel was ready to consider the delivery of the Iron Dome antimissile defense system to Ukraine. ",
		"Прем'єр-міністр Ізраїлю Біньямін Нетаньяху заявив в інтерв'ю CNN, що Ізраїль не відкидає надсилання військової допомоги Україні і він \"безумовно розглядає можливість\" надання військової підтримки Києву. Він окремо зазначив, що Ізраїль готовий розглянути постачання Україні системи протиракетної оборони Iron Dome.",
		"https://www.rferl.org/a/ukraine-netanyahu-israel-military-aid/32251955.html"
	],
	[
		"2023-02-02",
		"The EU has pledged to double a military aid programme for Ukraine by training an extra 15,000 soldiers as part of a blizzard of announcements aimed at showing that it will “stand by Ukraine for the long-haul”.",
		"ЄС пообіцяв подвоїти програму військової допомоги Україні, підготувавши додаткові 15 000 солдатів у рамках низки заяв, спрямованих на те, щоб продемонструвати, що він «буде поруч з Україною в довгостроковій перспективі».",
		"https://www.theguardian.com/world/2023/feb/02/eu-pledges-to-double-military-aid-programme-for-ukraine"
	],
	[
		"2023-02-02",
		"The European Union approved on Thursday another €545 million ($600 million) in military aid to Ukraine, bringing its total support for the Ukrainian army to €3.6 billion. The new fund will cover non-lethal equipment, supplies and services to the Ukrainian soldiers trained by the EU.",
		"У четвер Європейський Союз схвалив ще 545 мільйонів євро (600 мільйонів доларів) військової допомоги Україні, довівши загальну підтримку української армії до 3,6 мільярда євро. Новий фонд покриватиме нелетальне обладнання, припаси та послуги українським військовим, яких навчає ЄС.",
		"https://www.aa.com.tr/en/europe/eu-approves-another-600m-in-military-aid-to-ukraine/2804820"
	],
	[
		"2023-02-02",
		"In Paris after meeting Ukrainian Defence Minister Oleksii Reznikov, French Defence Minister Sebastien Lecornu said \"there was no taboo\" about supplying Kyiv with fighter planes.",
		"Міністр оборони Франції Себастьян Лекорню після зустрічі з міністром оборони України Олексієм Резніковим у Парижі заявив, що «немає табу» щодо постачання Києву винищувачів.",
		"https://www.thehindu.com/news/international/russia-presses-ahead-with-donetsk-campaign-ukraine-wants-fighter-jets/article66459017.ece"
	],
	[
		"2023-02-03",
		"Berlin approves the request of Rheinmetall to sell 88 Leopard 1 tanks to Ukraine.",
		"Берлін затвердив прохання компанії виробника зброї Rheinmetall продати 88 одиниць танків Leopard 1 Україні.",
		"https://www.sueddeutsche.de/politik/ukraine-panzer-munition-bundesregierung-1.5744165"
	],
	[
		"2023-02-03",
		"The Defense Department announced a new package of security assistance for Ukraine. This includes the authorization of a presidential drawdown of security assistance, valued at up to $425 million, as well as $1.75 billion in Ukraine Security Assistance Initiative funds.The presidential drawdown package includes: additional ammunition for High Mobility Artillery Rocket Systems; additional 155 mm artillery rounds; additional 120 mm mortar rounds; 190 heavy machine guns with thermal imagery sights and associated ammunition to counter unmanned aerial systems; 181 Mine Resistant Ambush Protected vehicles; 250 Javelin anti-armor systems; 2,000 anti-armor rockets; Claymore anti-personnel munitions; demolitions munitions; cold weather gear, helmets and other field equipment.\nUnder USAI, the DOD will provide Ukraine with: 2 HAWK air defense firing units; anti-aircraft guns and ammunition; equipment to integrate Western air defense launchers, missiles and radars with Ukraine's air defense systems; equipment to sustain Ukraine's existing air defense capabilities; air defense generators; counter-unmanned aerial systems; four air surveillance radars; 20 counter-mortar radars; spare parts for counter-artillery radars; Puma unmanned aerial systems; precision-guided rockets; secure communications equipment; medical supplies; funding for training, maintenance, and sustainment.",
		"Міноборони США анонсувало новий пакет безпекової допомоги для України. \n\n- 425 мільйонів доларів по фонду PDA (короткострокова допомога): додаткові боєприпаси для високомобільних артилерійських ракетних систем; додаткові артилерійські снаряди калібру 155 мм; додаткові мінометні снаряди калібру 120 мм; 190 великокаліберних кулеметів з тепловізійними прицілами та супутніми боєприпасами для протидії безпілотним літальним комплексам; 181 протимінно-захисна машина із засідкою; 250 протитанкових систем Javelin; 2000 протитанкових ракет; протипіхотні боєприпаси Claymore; підривні боєприпаси; спорядження для холодної погоди, каски та інше польове спорядження.\n- 1,75 мільярда доларів по фонду USAI (довгострокова допомога): 2 вогневі установки ППО HAWK; зенітні гармати та боєприпаси; обладнання для інтеграції західних пускових установок, ракет і радарів із системами протиповітряної оборони України; обладнання для підтримки наявних можливостей протиповітряної оборони України; генератори ППО; протидії безпілотним літальним комплексам; чотири РЛС повітряного спостереження; 20 протимінометних РЛС; запчастини до РЛС протидії артилерії; безпілотні літальні комплекси Puma; високоточні ракети; обладнання безпечного зв'язку; медичне приладдя; фінансування навчання, обслуговування та підтримки.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3288155/air-defense-systems-long-range-fires-capability-to-be-sent-to-ukraine/"
	],
	[
		"2023-02-03",
		"France said it has completed technical talks with Italy for the joint delivery of a SAMP/T-MAMBA air defence system, the only European-made system that can intercept ballistic missiles, to Ukraine in the spring.",
		"Франція повідомила, що завершила технічні переговори з Італією щодо спільної поставки в Україну навесні системи протиповітряної оборони SAMP/T-MAMBA, єдиної системи європейського виробництва, яка може перехоплювати балістичні ракети.",
		"https://www.reuters.com/world/europe/france-italy-ready-deliver-sampt-anti-missile-system-ukraine-2023-02-03/"
	],
	[
		"2023-02-04",
		"\"Battle tanks are on their way to help Ukraine.\" wrote Canadian Defense Minister Anita Anand in her twitter. Attached to the tweet was a video of loading Leopard 2 tank in a military plane.",
		"«Бойові танки їдуть на допомогу Україні». – написала міністр оборони Канади Аніта Ананд у своєму Twitter. До твіту було прикріплено відео завантаження танка Leopard 2 у військовий літак.",
		"https://twitter.com/AnitaAnandMP/status/1621946130056577026?s=20&t=As2o2kCgfg3aMh_UdjEmQQ"
	],
	[
		"2023-02-04",
		"China is providing military aid to Russia in violation of U.S.-led sanctions placed by western countries, according to Russian trade data reported by the Wall Street Journal. China’s state-owned defense companies have shipped navigation equipment and parts to fighter jets and other military technology equipment to Russian defense companies, according to Russian customs data.",
		"Китай надає військову допомогу Росії всупереч санкціям, введеним США західними країнами, згідно з даними російської торгівлі, наданими Wall Street Journal. За даними російської митниці, державні оборонні компанії Китаю відправили навігаційне обладнання та запчастини до винищувачів та інше військове технологічне обладнання російським оборонним компаніям.",
		"https://www.forbes.com/sites/brianbushard/2023/02/04/china-helping-russias-war-with-ukraine-with-military-aid-violating-sanctions-reports-show"
	],
	[
		"2023-02-06",
		"Over five years, Norway will provide Ukraine with 15 billion Norwegian kroner ( NOK ) per year – a total of NOK 75 billion.  The 15 billion donated in 2023 would be distributed 50% for military aid and 50% for civil and humanitarian aid. But that fraction may change in the coming years.",
		"Протягом п’яти років Норвегія надаватиме Україні 15 мільярдів норвезьких крон (NOK) на рік – загалом 75 мільярдів норвезьких крон. 15 мільярдів, пожертвуваних у 2023 році, будуть розподілені 50% на військову допомогу та 50% на цивільну та гуманітарну допомогу. Але ця частка може змінитися в найближчі роки.",
		"https://wataha.no/en/2023/02/06/The-government-will-transfer-75-billion-NOK-to-Ukraine/"
	],
	[
		"2023-02-06",
		"The new Israel government is under pressure to send more military aid to Ukraine.",
		"На новий уряд Ізраїлю тиснуть, щоб він надіслав більше військової допомоги Україні.",
		"https://www.voanews.com/a/israel-under-pressure-to-send-military-aid-to-ukraine-/6949779.html"
	],
	[
		"2023-02-07",
		"According to Spiegel sources the Federal Security Council of Germany has approved delivery of 178 Leopard-1 tank to Ukraine. ",
		"Німеччина схвалила поставку Україні 178 танків Leopard-1.",
		"https://www.spiegel.de/politik/deutschland/ukraine-bundesregierung-genehmigt-lieferung-von-178-leopard-1-panzern-a-100fcfdc-332d-471e-9d1d-f78fd8c27cd5"
	],
	[
		"2023-02-07",
		"Germany, Denmark and the Netherlands said Tuesday they are planning to send at least 100 older, refurbished Leopard 1 tanks to Ukraine",
		"Німеччина, Данія та Нідерланди заявили, що планують відправити в Україну щонайменше 100 старих відремонтованих танків Leopard 1.",
		"https://www.voanews.com/a/ukrainian-defense-minister-expresses-thanks-for-support-amid-rumors-of-replacement/6951199.html"
	],
	[
		"2023-02-07",
		"British Shadow Defence Secretary John Healey said that Britain must set out a new strategy to boost military production and overhaul wasteful procurement to better support Ukraine and signal to Russia that things can only get worse.",
		"Міністр оборони Великої Британії Джон Хілі заявив, що Британія має розробити нову стратегію збільшення військового виробництва та перегляду марнотратних закупівель, щоб краще підтримувати Україну та дати сигнал Росії, що ситуація може погіршитися.",
		"https://www.reuters.com/world/europe/britain-needs-new-stockpile-strategy-support-ukraine-says-labour-2023-02-06/"
	],
	[
		"2023-02-07",
		"Poland has announced its intention to train two battalions of the Ukrainian Armed Forces every month.",
		"Польща оголосила про намір щомісяця навчати по два батальйони Збройних сил України.",
		"https://www.ukrinform.net/rubric-ato/3667070-poland-ready-to-train-two-battalions-of-ukrainian-armed-forces-every-month.html"
	],
	[
		"2023-02-08",
		"First German Leopard 2A6 tanks will join Ukrainian army at the end of March 2023",
		"Перші німецькі танки Leopard 2A6 надійдуть на озброєння української армії наприкінці березня 2023 року",
		"https://www.armyrecognition.com/defense_news_february_2023_global_security_army_industry/first_german_leopard_2a6_tanks_will_join_ukrainian_army_at_the_end_of_march_2023.amp.html"
	],
	[
		"2023-02-08",
		"Portugal Ministry of Defence confirmed earlier announcement to give Leopard 2 tanks to Ukraine. 3 machines of type Leopard 2A6 will be delivered to Ukraine in march.",
		"Міністерство Оборони Португалії підтвердило наміри надати танки Leopard 2 Україні. Всього, у березні буде надіслано 3 одиниці модифікаці Leopard 2A6.",
		"https://www.reuters.com/world/europe/portugal-send-ukraine-three-leopard-2-tanks-2023-02-08/"
	],
	[
		"2023-02-08",
		"The U.K. is considering sending advanced jets to Ukraine and will begin training Ukrainian pilots in coming months",
		"Сполучене Королівство розглядає можливість надсилання передових реактивних літаків в Україну та розпочне навчання українських пілотів найближчими місяцями",
		"https://www.wsj.com/articles/ukraines-zelensky-to-visit-u-k-as-britain-steps-up-training-military-aid-11675848644"
	],
	[
		"2023-02-08",
		"The Sweden Parliament voted in favour of the Government’s proposal for an additional amending budget. According to plan, military equipment that the Swedish Armed Forces can do without for a limited period will be donated to Ukraine. The package includes anti-tank weapons, mine-clearance equipment, light anti-tank weapon Robot 57 and Combat Vehicle 90, at a maximum value of SEK 4.3 billion ($410 mln.).",
		"Парламент Швеції проголосував за пропозицію уряду про додаткові зміни до бюджету. Згідно з планом, Україні передадуть військову техніку, без якої збройні сили Швеції зможуть обійтися протягом обмеженого періоду. Пакет включає протитанкову зброю, обладнання для розмінування, легку протитанкову зброю Robot 57 і Combat Vehicle 90 вартістю 4,3 мільярда шведських крон (410 мільйонів доларів).",
		"https://www.riksdagen.se/en/news/2023/feb/8/additional-amending-budget-support-to-ukraine-as-well-as-measures-aimed-at-businesses-and-households-in-response-to-high-energy-prices/"
	],
	[
		"2023-02-08",
		"German federal government announced it will deliver an additional batch of Gepard anti-aircraft tanks to Ukraine.",
		"Федеральний уряд Німеччини оголосив про поставку Україні додаткової партії зенітних танків Gepard.",
		"https://www.armyrecognition.com/defense_news_february_2023_global_security_army_industry/germany_announces_additional_delivery_of_gepard_anti-aircraft_tanks_to_ukraine.html"
	],
	[
		"2023-02-09",
		"Norwegian authorities are considering sending CV90 infantry fighting vehicles to Ukraine from the reserves of the country's armed forces.",
		"Влада Норвегії розглядає можливість відправлення в Україну бойових машин піхоти CV90 із резерву збройних сил країни.",
		"https://www.ukrinform.net/rubric-ato/3663735-norway-considering-sending-cv90-ifvs-to-ukraine.html"
	],
	[
		"2023-02-09",
		"SpaceX will no longer support certain Ukrainian military operations through its Starlink satellite-communications service, the company’s president said on Wednesday, explaining that the tech was “never meant to be weaponized.”",
		"SpaceX більше не підтримуватиме певні українські військові операції через свою службу супутникового зв’язку Starlink, заявив у середу президент компанії, пояснивши, що ця технологія «ніколи не була призначена для використання у вигляді зброї».",
		"https://www.defenseone.com/technology/2023/02/spacex-now-says-they-dont-want-starlink-be-weaponized-ukraine/382797/"
	],
	[
		"2023-02-09",
		"A group of House Republicans is calling for an immediate halt of US aid in Ukraine, arguing that such support for the country's defense in the face of Russia's invasion is \"inadvertently contributing to civilian casualties.\" A non-binding resolution introduced Thursday would, if passed, express the sense of Congress that the US \"must end its military and financial aid to Ukraine.\"",
		"Група республіканців у Палаті представників закликає до негайного припинення допомоги США Україні, стверджуючи, що така підтримка оборони країни перед обличчям вторгнення Росії «ненавмисно сприяє жертвам серед цивільного населення». Резолюція, яка не має обов’язкової сили, представлена в четвер, якщо вона буде прийнята, виражатиме думку Конгресу про те, що США «повинні припинити свою військову та фінансову допомогу Україні».",
		"https://www.businessinsider.com/republicans-introduce-bill-calling-for-halting-us-aid-to-ukraine-2023-2"
	],
	[
		"2023-02-09",
		"NATO members and partner countries should send fighter jets to Ukraine, Estonia's foreign minister Urmas Reinsalu said, arguing that there is no substantial reason not to do so. He also told that the countries backing Kyiv's fight should \"of course\" send fighter jets to Ukraine.",
		"Міністр закордонних справ Естонії Урмас Рейнсалу заявив, що країни-члени НАТО та країни-партнери повинні відправити в Україну винищувачі, стверджуючи, що немає вагомих причин не робити цього. Він також сказав, що країни, які підтримують боротьбу Києва, повинні \"звичайно\" відправити в Україну винищувачі.",
		"https://www.businessinsider.com/only-zombie-arguments-for-not-giving-ukraine-fighter-jets-estonia-2023-2"
	],
	[
		"2023-02-10",
		"French President Emmanuel Macron said he did not rule out sending fighter jets to Ukraine at some point.",
		"Президент Франції Еммануель Макрон заявив, що не виключає відправки винищувачів в Україну в якийсь момент.",
		"https://www.globalvillagespace.com/france-did-not-reject-military-assistance-to-ukraine/"
	],
	[
		"2023-02-10",
		"President Biden will travel to Poland later this month to mark the one-year anniversary of Russia's invasion of Ukraine. The White House did not say whether the U.S. would announce any specific new aid packages for Ukraine around Biden's trip, but Kirby did say that the president \"will certainly make clear that additional security assistance, additional financial assistance, additional help for Ukraine will be coming from the United States.\"",
		"Пізніше цього місяця президент Байден відвідає Польщу, щоб відзначити річницю вторгнення Росії в Україну. У Білому домі не сказали, чи США оголосять про якісь конкретні нові пакети допомоги для України під час візиту Байдена, але Кірбі сказав, що президент «безумовно дасть зрозуміти, що додаткова допомога з безпеки, додаткова фінансова допомога, додаткова допомога для України надійде зі Сполучених Штатів».",
		"https://www.axios.com/2023/02/10/biden-poland-1-year-russia-invasion-ukraine"
	],
	[
		"2023-02-10",
		"Lithuania is in the process of delivery of 36 L-70 air defense guns to Ukraine, which were announced earlier in January. ",
		"Литва перебуває в процесі поставки Україні 36 гармат ППО L-70, про які було оголошено раніше в січні.",
		"https://www.lrt.lt/naujienos/lietuvoje/2/1887198/lietuva-perduoda-ukrainai-oro-gynybos-pabuklu"
	],
	[
		"2023-02-10",
		"The former commanding US general in Europe, Ben Hodges, has told in his interview to Deutsche Welle that the West should provide Kyiv with fighter jets. He said that providing Ukraine with the planes could lead to a victory for Kyiv within the year. \"The sooner we deliver them the capability to achieve a decisive outcome, the sooner that [the war] could be over.\"",
		"Колишній командувач США в Європі Бен Ходжес в інтерв'ю Deutsche Welle заявив, що Захід повинен надати Києву винищувачі. За його словами, надання Україні літаків може призвести до перемоги Києва протягом року. «Чим швидше ми надамо їм можливість досягти вирішального результату, тим швидше [війна] може закінчитися».",
		"https://www.dw.com/en/former-top-us-general-jets-could-seal-quick-ukraine-victory/a-64666557"
	],
	[
		"2023-02-10",
		"\"We are talking to Kyiv about exporting the KF51 Panther tanks\", Rheinmetall CEO Armin Papperger told.",
		"\"Ми ведемо переговори з Києвом про експорт танків KF51 Panther\", - сказав генеральний директор Rheinmetall Армін Паппергер.",
		"https://www.armyrecognition.com/defense_news_february_2023_global_security_army_industry/rheinmetall_wants_to_deliver_kf51_panther_main_battle_tanks_to_ukraine.html"
	],
	[
		"2023-02-11",
		"Defence minister of Netherlands Kajsa Ollongren in her speach to MPs said that Dutch military support for Ukraine has now topped €1 billion.",
		"Міністр оборони Нідерландів Кайса Оллонгрен у своєму виступі перед депутатами заявила, що нині військова підтримка Нідерландів Україні перевищила 1 мільярд євро.",
		"https://www.dutchnews.nl/news/2023/02/dutch-military-aid-to-ukraine-tops-e1-billion-minister-confirms/"
	],
	[
		"2023-02-11",
		"The Netherlands will not ship their leased from Germany eighteen Leopard 2 tanks to Ukraine. This question has been considered earlier, however did not found enough support in government, the Defense minister Kajsa Ollongren said.",
		"Нідерланди не нададуть 18 танків Leopard 2 Україні, які були придбані в Німеччині. Раніше, це питання обговорювалось у контексті військової допомоги, але так і не знайшло достатньої підтримки серед уряду країни. Про це заявила Міністр Оборони Нідерландів Кайса Оллонгрен.",
		"https://wnl.tv/2023/02/09/minister-ollongren-tanks-die-nederland-van-duitsland-leaset-niet-naar-oekraine/"
	],
	[
		"2023-02-11",
		"President of Poland, Andrzej Duda, shared that Ukraine needs more weapons to be able to withstand Russian agression on the current stage of the conflict. He insisted, that weapons supply will be crucial and should increase in the comming weeks.",
		"Президент Польщі, Анджей Дуда, закликав надати більше зброї Україні, щоб вона змогла вистояти проти російської агресії на чинному етапу конфлікту. Він наполягає на тому, що постачання зброї повинно зрости, і є ключовим елементом у найближчі тижні.",
		"https://www.prezydent.pl/aktualnosci/wypowiedzi-prezydenta-rp/wywiady/wywiad-prezydenta-dla-le-figaro,64479"
	],
	[
		"2023-02-11",
		"Ukrainian tank crews for Leopard 2 will start their training programm in the comming weeks. According to the data available to the Der Spiergel, the entire process planned to take from 6 to 8 weeks.",
		"Українські танкові екіпажі Leopard 2 розпочнуть навчальну програму вже у наступних тижнях. За інформацією Der Spiegel, планована тривалість навчання становитиме від 6 до 8 тижнів.",
		"https://www.spiegel.de/politik/leopard-2-panzer-bundeswehr-beginnt-mit-ausbildung-ukrainischer-soldaten-a-f5611bc8-8956-48b9-9ca8-6c33c38f426f"
	],
	[
		"2023-02-11",
		"British weaponry and military vehicles could be manufactured in Ukraine under plans that would mark a deepening of the country’s ties with NATO.",
		"Британське озброєння та військові транспортні засоби можуть вироблятися в Україні відповідно до планів, які означатимуть поглиблення зв’язків країни з НАТО.",
		"https://www.telegraph.co.uk/world-news/2023/02/11/british-weapons-could-made-ukraine/"
	],
	[
		"2023-02-12",
		"Switzerland said Friday it had blocked Spain from sending Swiss-made anti-aircraft guns to Ukraine, in line with its strict military neutrality.\nThis marks the third time Bern has blocked the transfer of Swiss-made arms to war-ravaged Ukraine since Russia launched its full-scale invasion a year ago.",
		"Швейцарія заблокувала надання Іспанією зенітних гармат швейцарського виробництва Україні, відповідно до свого суворого військового нейтралітету.\nЦе вже третій випадок, коли Берн блокує передачу зброї швейцарського виробництва в Україну з моменту повномасштабного вторгнення Росії рік тому.",
		"https://www.thedefensepost.com/2023/02/12/switzerland-block-spain-ukraine/"
	],
	[
		"2023-02-14",
		"The first Ground Launched Small Diameter Bombs (GLSDBs) won’t arrive to Ukraine until this fall.",
		"Перші наземні бомби малого діаметра (GLSDB) не надійдуть до України раніше осені 2023.",
		"https://breakingdefense.com/2023/02/countdown-to-counteroffensive-give-ukraine-atacms-before-its-too-late/"
	],
	[
		"2023-02-14",
		"US military weighs sending Ukraine weapons and ammo seized from gunrunners in repeated raids on smuggling boats.",
		"Збройні сили США обмірковують надання Україні зброї та боєприпасів, вилучених під час рейдів на контрабандні човни.",
		"https://www.businessinsider.com/us-may-send-ukraine-weapons-seized-gunrunners-raids-boats-2023-2?r=US&IR=TT"
	],
	[
		"2023-02-14",
		"Norway’s government said Tuesday it would donate eight of its Leopard 2 tanks to Ukraine, fulfilling a previous commitment. The Norwegian army currently has 36 Leopard 2 tanks in service.",
		"Уряд Норвегії заявив у вівторок, що передасть Україні вісім своїх танків Leopard 2, виконуючи попереднє зобов’язання. Норвезька армія зараз має на озброєнні 36 танків Leopard 2.",
		"https://www.thedefensepost.com/2023/02/14/norway-leopard-tanks-ukraine-2/"
	],
	[
		"2023-02-14",
		"The Austrian Ministry of Defence has announced that it will not provide Ukrainian soldiers with Leopard 2 tank training.",
		"Міністерство оборони Австрії повідомило, що не проводитиме навчання українських військових на танках Leopard 2.",
		"https://www.thedefensepost.com/2023/02/14/austria-ukrainian-soldiers-leopard/"
	],
	[
		"2023-02-14",
		"The US Army announced Tuesday that it had awarded $522 million in orders to two companies to manufacture 155 mm artillery ammunition for Ukraine. The orders, officially decided on January 30, went to Northrop Grumman Systems Corp. and Global Military Products Inc. ",
		"Армія США оголосила у вівторок, що надала двом компаніям замовлення на 522 мільйони доларів на виробництво артилерійських боєприпасів калібру 155 мм для України. Замовлення, офіційне рішення про які було прийнято 30 січня, надійшли до Northrop Grumman Systems Corp. і Global Military Products Inc.",
		"https://www.thedefensepost.com/2023/02/15/us-contract-artillery-shells-ukraine/"
	],
	[
		"2023-02-15",
		"European countries are looking for ways to multiply their production of ammunition, said Ministry of Defense Secretary General Kusti Salm. Estonian Prime Minister Kaja Kallas also took the initiative in regard to the issue at the European Council last week. European countries are looking for ways to multiply their production of ammunition, said Ministry of Defense Secretary General Kusti Salm. Estonian Prime Minister Kaja Kallas also took the initiative in regard to the issue at the European Council last week.",
		"Європейські країни шукають шляхи збільшення виробництва боєприпасів, заявив генеральний секретар міністерства оборони Кусті Салм. Прем'єр-міністр Естонії Кая Каллас також виступила з ініціативою щодо цього питання на Європейській раді минулого тижня.",
		"https://news.err.ee/1608885824/estonia-urges-european-countries-to-multiply-ammunition-production"
	],
	[
		"2023-02-15",
		"The Netherlands will supply Ukraine with 20.000 shells for the Leopards 2 main battle tanks.",
		"Нідерланди поставлять Україні 20 тисяч снарядів для основних бойових танків Leopard 2.",
		"https://www.telegraaf.nl/nieuws/928278313/nederland-gaat-munitie-voor-leopard-2-tanks-aan-oekraine-leveren"
	],
	[
		"2023-02-16",
		"Rheinmetall to Produce 300,000 Gepard Anti-Aircraft Tank Rounds for Ukraine",
		"Rheinmetall виготовить для України 300 тис. зенітно-танкових снарядів Gepard",
		"https://www.thedefensepost.com/2023/02/16/rheinmetall-gepard-rounds-ukraine/"
	],
	[
		"2023-02-16",
		"German Defence Minister Boris Pistorius said that so far it had gathered only 14 newer A6 type Leopard tanks and three from Portugal out of 30 previously promised to Ukraine. \nHe added: “For the German Leopards, I want to say again that ours will be delivered in the last week of March. That is certain.”",
		"Міністр оборони Німеччини Борис Пісторіус заявив, що наразі зібрано лише 14 новіших танків типу A6 Leopard і три з Португалії з 30 раніше обіцяних Україні.\nВін додав: «Що стосується німецьких Leopards, я хочу ще раз сказати, що наші будуть доставлені в останній тиждень березня. Це точно».",
		"https://www.thedefensepost.com/2023/02/16/germany-half-battalion-tanks-ukraine/"
	],
	[
		"2023-02-16",
		"The United States considers that Crimea, which Russia annexed from Ukraine in 2014, should be demilitarised at a minimum and Washington supports Ukrainian attacks on military targets on the peninsula, Under Secretary of State Victoria Nuland said.",
		"Сполучені Штати вважають, що Крим, який Росія анексувала в України в 2014 році, має бути як мінімум демілітаризований, і Вашингтон підтримує українські атаки на військові цілі на півострові, заявила заступник держсекретаря Вікторія Нуланд.",
		"https://www.reuters.com/world/us-diplomat-says-ukrainian-strikes-military-targets-crimea-are-legitimate-2023-02-17/"
	],
	[
		"2023-02-17",
		"France has sent the first 14 AMX-10 RC tanks to Ukraine.",
		"Франція відправила в Україну перші 14 танків AMX-10 RC.",
		"https://twitter.com/visegrad24/status/1626513339210780674?s=20"
	],
	[
		"2023-02-17",
		"Deputy Chairman of the French Defense Committee Jean-Louis Thiériot mentioned in his tweet that Ukraine used anti-tank missiles Akeron MP which are made in France and similar in their capabilities to US-made Javelin. There was no previous official announcement by France that these systems were sent to Ukraine.",
		"Заступник голови комітету з питань оборони Франції Жан-Луї Тьєріо зазначив у своєму твіттері, що Україна використала протитанкові ракети Akeron MP французького виробництва які за своїми можливостями схожі на американські Javelin. Раніше Франція не повідомляла про відправлення цих систем в Україну.",
		"https://twitter.com/OpexNews/status/1625947933353906185?s=20"
	],
	[
		"2023-02-17",
		"A bipartisan group of lawmakers is pressing President Joe Biden directly to send F-16 warplanes to Ukraine.",
		"Двопартійна група законодавців тисне на президента Джо Байдена, щоб він відправив в Україну військові літаки F-16.",
		"https://www.politico.com/news/2023/02/17/house-lawmakers-f-16-ukraine-letter-00083402"
	],
	[
		"2023-02-18",
		"Polish President Andrzej Duda says Poland is considering handing over its MiG-29s to Ukraine & joining a potential F-16 fighter jet coalition to provide Ukraine with the jets.",
		"Президент Польщі Анджей Дуда заявив, що Польща розглядає можливість передачі Україні своїх МіГ-29 і приєднання до потенційної коаліції винищувачів F-16, щоб забезпечити Україну літаками.",
		"https://www.ukrinform.net/rubric-ato/3671623-poland-to-look-into-giving-ukraine-mig29-fighter-jets-duda.html"
	],
	[
		"2023-02-18",
		"Britain's Prime Minister, Rishi Sunak, called for a 'doubling down' of military support to Ukraine during Munich Security conference, highlighting Britain’s recent commitment to provide battle tanks, advanced air defence systems and longer-range missiles to the country.",
		"Прем’єр-міністр Великобританії Ріші Сунак закликав до «подвоєння» військової підтримки України під час Мюнхенської конференції з безпеки, підкресливши нещодавнє зобов’язання Британії надати країні бойові танки, передові системи протиповітряної оборони та ракети більшої дальності.",
		"https://www.thenationalnews.com/world/uk-news/2023/02/17/ukraine-must-be-given-advanced-nato-standard-capabilities-rishi-sunak-says/"
	],
	[
		"2023-02-18",
		"World leaders meeting in Bavaria have called for Western allies to increase military aid to Kyiv. President of the European Commission, Ursula von der Leyen, appealed for an increase in military support in areas such as ammunition supplies. Nato Secretary General Jens Stoltenberg said that it is essential to \"give Ukraine what it needs to win and survive as an independent sovereign nation in Europe.\"",
		"Світові лідери на зустрічі в Баварії закликали західних союзників збільшити військову допомогу Києву. Президент Європейської комісії Урсула фон дер Ляєн закликала збільшити військову підтримку в таких сферах, як постачання боєприпасів. Генеральний секретар НАТО Йенс Столтенберг заявив, що важливо «дати Україні те, що їй потрібно, щоб перемогти і вижити як незалежна суверенна нація в Європі».",
		"https://www.euronews.com/2023/02/18/munich-security-conference-allies-call-for-military-aid-to-ukraine-to-be-stepped-up"
	],
	[
		"2023-02-18",
		"Vice President of The United States Kamala Harris has accused Russia committing crimes against humanity in Ukraine. “The United States has formally determined that Russia has committed crimes against humanity.” Tom Malinowski, a former member of Congress and senior human rights official at the State Department, believe “these debates about what to call Russia’s atrocities are less important than providing Ukraine the means to stop them.”",
		"Віце-президент США Камала Харріс звинуватила Росію в скоєнні злочинів проти людства в Україні. «Сполучені Штати офіційно визначили, що Росія скоїла злочини проти людства». Том Малиновський, колишній член Конгресу та старший чиновник із прав людини в Державному департаменті, вважає, що «ці дебати про те, як назвати звірства Росії, менш важливі, ніж надання Україні засобів, щоб їх зупинити».",
		"https://www.politico.eu/article/us-formal-accuse-russia-crimes-against-humanity-ukraine-kamala-harris/"
	],
	[
		"2023-02-19",
		"The US has said it believes China may be about to provide lethal aid to help Russia in the war in Ukraine, prompting a direct warning against doing so from the secretary of state, Antony Blinken, to China’s top diplomat Wang Yi. In a blunt meeting he also urged China to stop helping Russia evade the impact of sanctions.",
		"США заявили, що вважають, що Китай, можливо, збирається надати смертельну допомогу Росії у війні в Україні, що викликало пряме попередження від державного секретаря Ентоні Блінкена першому дипломату Китаю Вангу Юи. Під час прямої зустрічі він також закликав Китай припинити допомагати Росії уникати наслідків санкцій.",
		"https://www.theguardian.com/world/2023/feb/19/china-may-be-on-brink-of-supplying-arms-to-russia-says-blinken"
	],
	[
		"2023-02-19",
		"Two leading House Republicans have called on President Joe Biden to increase military support to Ukraine in its defense against Russia’s invasion.",
		"Двоє провідних республіканців у Палаті представників закликали президента Джо Байдена збільшити військову підтримку України в її захисті від вторгнення Росії.",
		"https://edition.cnn.com/2023/02/19/politics/mike-turner-mike-mccaul-ukraine-military-cnntv/index.htmll"
	],
	[
		"2023-02-21",
		"France will be ready to provide Ukraine with 25 AMX-10P tracked armored IFVs",
		"Франція готова надати Україні 25 гусеничних броньованих БМП AMX-10P",
		"https://www.armyrecognition.com/defense_news_february_2023_global_security_army_industry/france_will_be_ready_to_provide_ukraine_with_25_amx-10p_tracked_arrmored_ifvs.amp.html"
	],
	[
		"2023-02-22",
		"The UK Ministry of Defence tested a range of drones to deliver to Ukraine under a clandestine program.",
		"Міністерство оборони Великої Британії випробувало серію безпілотників для доставки в Україну в рамках таємної програми.",
		"https://www.thedefensepost.com/2023/02/22/uk-3d-printed-drones/"
	],
	[
		"2023-02-23",
		"Spain Prime minister Pedro Sánchez announced sending 10 Leopard 2 tanks to Ukraine.",
		"Прем'єр-міністр Іспанії Педро Санчес заявив про відправку в Україну 10 танків Leopard 2.",
		"https://elpais.com/internacional/2023-02-24/guerra-ucrania-rusia-ultimas-noticias-en-directo.html"
	],
	[
		"2023-02-23",
		"Finland will supply Ukriaine with 3 Leopard 2 tanks, although this tank modification is intended for demining and lacks 120 mm gun.",
		"Фінляндія поставить в Україну 3 танки Leopard 2, хоча ця модифікація танка призначена для розмінування і не має 120-мм гармати.",
		"https://www.defmin.fi/en/topical/press_releases_and_news/finlands_latest_defence_materiel_package_to_ukraine_includes_three_leopard_2_mine_clearing_tanks.13423.news#6bc536cd"
	],
	[
		"2023-02-23",
		"The Czech government has approved a further military aid shipment to Ukraine and will continue to send equipment from stocks, Defense Minister Jana Cernochova",
		"Уряд Чехії схвалив подальше постачання військової допомоги Україні та продовжить відправляти обладнання зі складів, заявила міністр оборони Яна Чернохова.",
		"https://www.rferl.org/a/czech-ukraine-military-aid/32284650.html"
	],
	[
		"2023-02-24",
		"Minister of Defence and Prime Minister of Sweden jointly announced entering the coalition of countries providing Leopard 2 battle tanks to Ukraine. Sweden will give \"up to 10 Leopard 2 A5 main battle tanks\".",
		"Міністр оборони та прем'єр-міністр Швеції спільно оголосили про вступ до коаліції країн, що надають Україні бойові танки Leopard 2. Швеція надасть «до 10 основних бойових танків Leopard 2 A5».",
		"https://twitter.com/PlJonson/status/1629117599513550848?s=20"
	],
	[
		"2023-02-24",
		"The Department of Defense (DoD) announced a new security assistance package, which totals $2 billion. It is being provided under the Ukraine Security Assistance Initiative (USAI). The package includes: additional ammunition for High Mobility Artillery Rocket Systems (HIMARS); additional 155mm artillery rounds; munitions for laser-guided rocket systems; CyberLux K8 UAS; Switchblade 600 UAS; Altius-600 UAS; Jump 20 UAS; counter-UAS and electronic warfare detection equipment; mine clearing equipment; secure communications support equipment; funding for training, maintenance, and sustainment.",
		"Міністерство оборони США оголосило про новий пакет допомоги у сфері безпеки на загальну суму 2 мільярди доларів. Він надається в рамках Ініціативи сприяння безпеці України (USAI). У комплект поставки входять: додаткові боєприпаси для ракетно-артилерійських систем високої мобільності (HIMARS); додаткові артилерійські снаряди калібру 155 мм; боєприпаси для реактивних систем з лазерним наведенням; БПЛА CyberLux K8, Switchblade 600,  Altius-600, Jump 20; засоби виявлення БПЛА та радіоелектронної боротьби; обладнання для розмінування; обладнання підтримки безпечного зв'язку; фінансування навчання, обслуговування та підтримки.",
		"https://www.defense.gov/News/Releases/Release/Article/3308633/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-02-24",
		"Prime Minister Justin Trudeau announced more weapons for Ukraine on Friday. Canada will donate four additional Leopard 2 main battle tanks to support the Armed Forces of Ukraine.",
		"У п'ятницю прем'єр-міністр Джастін Трюдо оголосив про збільшення зброї для України. Канада передасть додаткові чотири основні бойові танки Leopard 2 для підтримки Збройних сил України.",
		"https://www.ctvnews.ca/politics/canada-sending-four-more-battle-tanks-to-ukraine-1.6288251"
	],
	[
		"2023-02-27",
		"The Australian government announced additional military Autonomous Security Drones for Ukraine",
		"Уряд Австралії анонсував додаткові військові автономні безпілотники для України",
		"https://www.thedefensepost.com/2023/02/26/australia-isr-drones-ukraine/"
	],
	[
		"2023-02-27",
		"Sweden will supply undisclosed amounts and components of MIM-23 Hawk and IRIS-T air defense systems.",
		"Швеція поставить нерозголошені обсяги та компоненти систем ППО MIM-23 Hawk і IRIS-T.",
		"https://www.armyrecognition.com/defense_news_february_2023_global_security_army_industry/sweden_to_supply_ukraine_with_10_stridsvagn_122_tanks_-_mim-23_hawk_iris-t_air_defense_systems.html"
	],
	[
		"2023-02-28",
		"Rheinmetall from Germany to supply Ukraine with SurveilSPIRE automated reconnaissance systems.",
		"Rheinmetall з Німеччини поставить в Україну автоматизовані розвідувальні системи SurveilSPIRE",
		"https://www.armyrecognition.com/defense_news_february_2023_global_security_army_industry/rheinmetall_from_germany_to_supply_ukraine_with_surveilspire_automated_reconnaissance_systems.html?utm_content=cmp-true"
	],
	[
		"2023-02-28",
		"Italy to provide Ukraine with Spada and Skyguard air defense systems",
		"Італія надасть Україні системи протиповітряної оборони Spada і Skyguard",
		"https://www.armyrecognition.com/defense_news_february_2023_global_security_army_industry/italy_to_provide_ukraine_with_spada_and_skyguard_air_defense_missile_systems.html"
	],
	[
		"2023-03-01",
		"The EU Commission wants to boost ammunition production in Europe. Ursula von der Leyen's authority wants to present the member states with a plan that will not only ensure the supply of Ukraine in the defense against the Russian invasion, but also the replenishment of stocks in the EU countries.",
		"Комісія ЄС хоче збільшити виробництво боєприпасів у Європі. Урсула фон дер Лейєна хоче представити державам-членам план, який не лише забезпечить постачання України на захист від російського вторгнення, але й поповнення складів снарядів у країнах ЄС.",
		"https://www.spiegel.de/politik/drei-stufen-plan-eu-kommission-will-munitionsherstellung-drastisch-ankurbeln-a-a3bcbd19-4680-4b63-910e-fc75c93c5f4f"
	],
	[
		"2023-03-01",
		"The EU is looking to allocate an additional one billion euros for urgently needed ammunition for Ukraine",
		"ЄС планує виділити додатковий мільярд євро на вкрай необхідні для України боєприпаси",
		"https://www.thedefensepost.com/2023/03/01/eu-ammunition-ukraine//"
	],
	[
		"2023-03-02",
		"German Chancellor Olaf Scholzurged China not to send weapons to help Russia's war in Ukraine and instead asked Beijing to exert pressure on Moscow to pull back its forces.",
		"Канцлер Німеччини Олаф Шольц закликав Китай не надсилати зброю для допомоги Росії у війні в Україні та натомість попросив Пекін чинити тиск на Москву, щоб вона відвела свої сили.",
		"https://www.jpost.com/breaking-news/article-733162"
	],
	[
		"2023-03-03",
		"The Department of Defense announced a new military package for Ukraine in value of $400 mln:\n\n - Additional ammunition for HIMARS\n - Additional 155mm artillery rounds\n - Additional 105mm artillery rounds\n - Additional 25mm ammunition\n - Armored Vehicle Launched Bridges;\n - Demolition munitions and equipment for obstacle clearing\n - Testing and diagnostic equipment to support vehicle maintenance and repair\n - Spare parts and other field equipment",
		"Міністерство оборони США анонсувало новий військовий пакет для України вартістю $400 млн:\n\n - Боєприпаси для HIMARS\n - Артилерійські снаряди калібру 155 мм\n - Артилерійські снаряди калібру 105 мм\n - Боєприпаси калібру 25 мм\n - Броньовані мостоукладачі\n - Підривні боєприпаси та обладнання для прибирання перешкод\n - Тестове та діагностичне обладнання для підтримки технічного обслуговування та ремонту транспортних засобів\n - Запчастини та інше польове обладнання",
		"https://www.defense.gov/News/News-Stories/Article/Article/3318508/us-sends-ukraine-400-million-in-military-equipment/"
	],
	[
		"2023-03-04",
		"Armin Papperger, CEO of Rheinmetall mentioned in his interview that Rheinmetall is in negotiations about building a tank factory in Ukraine.",
		"Армін Паппергер, генеральний директор Rheinmetall, зазначив у своєму інтерв'ю, що Rheinmetall веде переговори про будівництво танкового заводу в Україні.",
		"https://rp-online.de/wirtschaft/unternehmen/was-der-panzerhersteller-rheinmetall-beim-ukraine-krieg-verdient_aid-85993711"
	],
	[
		"2023-03-04",
		"The United Kingdom has doubled, from 14 to 28, the number of Challenger 2 tanks it’s pledging to Ukraine.",
		"Велика Британія подвоїла – з 14 до 28 – кількість танків Challenger 2, які вона обіцяє Україні",
		"https://www.forbes.com/sites/davidaxe/2023/03/04/more-ex-british-challenger-2-tanks-are-bound-for-ukraine-as-london-doubles-its-pledge/?sh=48f699e8232b"
	],
	[
		"2023-03-04",
		"The arrival of the two pilots marks the first time Ukrainian military men have traveled to the U.S. to have their skills of flying attack aircraft including F-16 evaluated by American military trainers.",
		"Прибуття двох пілотів знаменує собою перший випадок, коли українські військові прибули до США, щоб американські військові інструктори оцінили їхні навички керування штурмовиками, зокрема F-16.",
		"https://www.nbcnews.com/investigations/two-ukrainian-pilots-are-us-training-assessment-attack-aircrafts-f-16s-rcna73426"
	],
	[
		"2023-03-04",
		"Britain is also providing Ukraine with 33 AS-90 self-propelled artillery guns.",
		"Великобританія також надає Україні 33 самохідних артилерійських установок AS-90.",
		"https://euromaidanpress.com/2023/03/04/uk-doubled-the-number-of-challenger-2-tanks-pledged-to-ukraine-ukrainian-ambassador/"
	],
	[
		"2023-03-05",
		"Rheinmetall wants to purchase 96 used tanks from Switzerland, presumably Leopard-1, and send them to Ukraine.",
		"Rheinmetall хоче придбати у Швейцарії 96 старих танків, імовірно Leopard-1, і відправити їх в Україну.",
		"https://www.deutschlandfunk.de/rheinmetall-will-der-schweiz-offenbar-leopard-1-panzer-abkaufen-und-in-die-ukraine-liefern-110.html"
	],
	[
		"2023-03-05",
		"German Chancellor Olaf Scholz said China had declared it won’t supply Russia with weapons for its war against Ukraine, suggesting that Berlin has received bilateral assurances from Beijing on the issue.",
		"Канцлер Німеччини Олаф Шольц заявив, що Китай не постачатиме Росії зброю",
		"https://www.politico.eu/article/china-ukraine-war-russia-weapon-deliveries-scholz-putin-zelenskyy-xi-jinping/"
	],
	[
		"2023-03-07",
		"Canada is extending its mission to train Ukrainian combat engineers and medics until October. Trudeau pledged $3 million Canadian dollars for de-mining efforts.",
		"Канада продовжує свою місію з підготовки українських саперів і медиків до жовтня. Трюдо пообіцяв виділити 3 мільйони канадських доларів на роботи з розмінування.",
		"https://www.euronews.com/2023/03/08/ursula-von-der-leyen-in-canada-for-talks-on-renewable-energy-and-ukraine-aid"
	],
	[
		"2023-03-08",
		"South Korea said it had approved the export of its weapons components to Ukraine last year, as the country faces pressure to provide military aid directly to Kyiv.",
		"Південна Корея заявила, що схвалила експорт своїх компонентів зброї в Україну минулого року, оскільки країна стикається з тиском щодо надання військової допомоги безпосередньо Києву.",
		"https://www.wsj.com/articles/south-korea-approves-export-of-weapons-components-to-ukraine-dfe68d6"
	],
	[
		"2023-03-08",
		"EU Ambassadors approved an additional €2 billion to the European Peace Facility - the fund which provides military support for Ukraine.",
		"Посли ЄС схвалили додаткові 2 мільярди євро до Європейського фонду миру – фонду, який надає військову підтримку Україні.",
		"https://twitter.com/sweden2023eu/status/1633446144247201792?s=20"
	],
	[
		"2023-03-08",
		"Zelenskiy has invited the US House speaker, Kevin McCarthy, to visit Ukraine",
		"Зеленський запросив спікера Палати представників США Кевіна Маккарті відвідати Україну",
		"https://www.theguardian.com/world/2023/mar/09/russia-ukraine-war-at-a-glance-what-we-know-on-day-379-of-the-invasion"
	],
	[
		"2023-03-09",
		"The Minister of Defense of Slovakia Jaroslav Nad' has confirmed in an interview to CNN that his country is ready to transfer their MiG-29 military aircrafts to Ukraine.",
		"Міністр оборони Словаччини Ярослав Надь в інтерв'ю CNN підтвердив, що його країна готова передати Україні свої військові літаки МіГ-29.",
		"https://fb.watch/j9Gn_uPrxl/"
	],
	[
		"2023-03-09",
		"The State Council and Ministry of Defence of Finland has granted Estonia a permit to export 122mm D-30 howitzers and ammunition to the Ukrainian Defense Forces.",
		"Держрада та Міністерство оборони Фінляндії надали Естонії дозвіл на експорт 122-мм гаубиць Д-30 і боєприпасів для Збройних Сил України.",
		"https://valtioneuvosto.fi/paatokset/paatos?decisionId=0900908f80810ff3"
	],
	[
		"2023-03-09",
		"Czech Company Excalibur Army finalized the production of 15 Viktor mobile anti-aircraft gun systems for Ukraine. This vehicle has been designed to offer a solution to counter Russian drone attacks.",
		"Чеська компанія Excalibur Army завершила виробництво 15 мобільних зенітних систем «Віктор» для України. Ця машина була розроблена, щоб запропонувати рішення для протидії атакам російських безпілотників.",
		"https://www.armyrecognition.com/defense_news_march_2023_global_security_army_industry/excalibur_army_from_czech_republic_ready_to_deliver_ukraine_with_15_viktor_anti-aircraft_gun_systems.html"
	],
	[
		"2023-03-10",
		"Germany has committed 2 more Gepard anti-aircraft guns for Ukraine.",
		"Німеччина передала Україні ще 2 зенітних установки Gepard.",
		"https://www.bundesregierung.de/breg-de/themen/krieg-in-der-ukraine/lieferungen-ukraine-2054514"
	],
	[
		"2023-03-10",
		"United Kingdom Prime Minister Rishi Sunak and French President Emmanuel Macron during a summit in Paris announced support measures to Ukraine’s forces. After the meeting Sunak announced: “We’ve agreed to train Ukrainian marines, helping to give Ukraine a decisive advantage on the battlefield and for Ukraine to win this war.”",
		"Прем'єр-міністр Великої Британії Ріші Сунак і президент Франції Еммануель Макрон під час саміту в Парижі оголосили про заходи підтримки українських військ. Після зустрічі Сунак оголосив: «Ми погодилися навчати українських морських піхотинців, допомагаючи дати Україні вирішальну перевагу на полі бою для перемоги у цій війні».",
		"https://www.theguardian.com/politics/2023/mar/10/ukraine-war-negotiating-table-zelenskiy-sunak-macron-paris-summit"
	],
	[
		"2023-03-10",
		"Norway to provide Ukraine with two NASAMS air defense missile systems",
		"Норвегія надасть Україні два зенітно-ракетних комплекси NASAMS",
		"https://www.regjeringen.no/en/aktuelt/nettsak-miw/id2966031/"
	],
	[
		"2023-03-10",
		"According to pictures published on the Twitter account of \"The Dead District\" on March 10, 2023, the Ukrainian army is now equipped with the latest generation of 122mm MLRS  RM-70 Vampir designed and manufactured in the Czech Republic by the Excalibur Army.",
		"Згідно зі світлинами, опублікованими в Твіттері «The Dead District» 10 березня 2023 року, українська армія озброєна останньою генерацією 122-мм РСЗВ RM-70 Vampir, розробленої та виготовленої в Чехії Excalibur Army.",
		"https://www.armyrecognition.com/ukraine_-_russia_conflict_war_2022/ukrainian_army_fights_russian_troops_with_rm-70_vampir_122mm_mlrs_from_czech_republic.html"
	],
	[
		"2023-03-12",
		"Ukraine's foreign minister Dmytro Kuleba urged Germany to speed up supplies of ammunition and to start training Ukrainian pilots on Western fighter jets. He said German weapons manufacturers had told him at the Munich Security Conference last month they were ready to deliver but were waiting for the government to sign contracts.",
		"Міністр закордонних справ України Дмитро Кулеба закликав Німеччину прискорити постачання боєприпасів і почати навчання українських пілотів на західних винищувачах. Він сказав, що німецькі виробники зброї сказали йому на Мюнхенській конференції з безпеки минулого місяця, що вони готові поставити, але чекають, поки уряд підпише контракти.",
		"https://www.reuters.com/world/europe/ukraines-kuleba-urges-germany-send-more-ammunition-train-up-pilots-2023-03-11/"
	],
	[
		"2023-03-12",
		"Ukraine plans to increase its military budget to 500 m. UAH",
		"Україна планує збільшити військовий бюджет до 500 млн. грн",
		"https://t.me/s/nexta_live"
	],
	[
		"2023-03-12",
		"Japan studies options to export weapons to Ukraine such as rocket launcher systems",
		"Японія вивчає варіанти експорту в Україну зброї, зокрема реактивних систем залпового вогню",
		"https://www.armyrecognition.com/defense_news_march_2023_global_security_army_industry/japan_studies_options_to_export_weapons_to_ukraine_such_as_rocket_launcher_systems.html"
	],
	[
		"2023-03-13",
		"Denmark confirms that 100 Leopard 1A5 tanks for Ukraine will be ready in the spring",
		"Данія підтверджує, що 100 танків Leopard 1A5 для України будуть готові навесні",
		"https://cphpost.dk/2023-03-13/news/first-danish-tanks-ready-for-ukraine-in-may/"
	],
	[
		"2023-03-14",
		"The Netherlands intends to provide Ukraine with two Alkmaar-class minehunters, starting in 2025. Ukraine will also receive drone detection radar systems and M3 bridge and ferrying systems that enable rapid bridge building. ",
		"Нідерланди мають намір надати Україні два міношукачі типу Alkmaar, починаючи з 2025 року. Україна також отримає радіолокаційні системи виявлення безпілотників і системи мостів і переправ M3, які дозволять швидко будувати мости.",
		"https://english.defensie.nl/latest/news/2023/03/14/ollongren-promises-minehunters-for-ukraine-during-visit-to-bombed-port-cities"
	],
	[
		"2023-03-14",
		"Ukroboronprom starts producing 125 mm shells for Ukrainian tanks",
		"\"Укроборонпром\" починає виробництво 125-мм снарядів для українських танків",
		"https://www.armyrecognition.com/defense_news_march_2023_global_security_army_industry/ukroboronprom_starts_producing_125_mm_shells_for_ukrainian_tanks.html"
	],
	[
		"2023-03-14",
		"UK armed forces minister James Heappey told lawmakers the UK was investigating giving Typhoons to countries that give MiGs to Ukraine.",
		"Міністр збройних сил Великої Британії Джеймс Хіппі заявив законодавцям, що Великобританія розглядає надання Тайфунів країнам, які надають Україні МіГи.",
		"https://breakingdefense.com/2023/03/to-help-ukraine-uk-explores-supplying-eurofighter-typhoons-to-european-mig-29-operators/"
	],
	[
		"2023-03-15",
		"A group of senators from both parties is pressing the Pentagon for more information on what it would take to send F-16 jets to Ukraine.",
		"Група сенаторів від обох партій вимагає від Пентагону додаткової інформації про те, що буде потрібно, щоб відправити літаки F-16 в Україну.",
		"https://www.politico.com/news/2023/03/14/senate-defense-department-ukraine-fighters-00087051"
	],
	[
		"2023-03-15",
		"Prime Minister Benjamin Netanyahu held a discussion Tuesday on Israel’s policy regarding aid to Ukraine in the face of the Russian invasion and war. Hebrew media reported that the meeting discussed the option of providing military assistance to Ukraine, which has long been lobbying Israel for weapons and in particular air defense systems. Israel is prepared to give Ukraine a rocket early warning system and assist the country in clearing landmines, according to the report.",
		"Ізраїль готовий передати Україні систему раннього попередження про ракети та допомогти країні в розмінуванні.",
		"https://www.timesofisrael.com/netanyahu-holds-meeting-on-ukraine-said-to-look-at-providing-military-aid/"
	],
	[
		"2023-03-15",
		"Denmark's government said on Wednesday it will establish a fund of 7 billion Danish crowns ($1.01 billion) for military, civilian and business aid to Ukraine this year. The fund, which was agreed with a broad majority of parties in parliament, will direct 5.4 billion crowns (77%) towards military aid, 1.2 billion (17%) towards civilian aid and 0.4 billion (6%) towards efforts by Danish companies to rebuild Ukraine.",
		"Уряд Данії заявив у середу, що цього року створить фонд у 7 мільярдів датських крон (1,01 мільярда доларів) для військової, цивільної та бізнес-допомоги Україні. Фонд, який було погоджено з переважною більшістю партій у парламенті, спрямує 5,4 мільярда крон (77%) на військову допомогу, 1,2 мільярда (17%) на цивільну допомогу та 0,4 мільярда (6%) на зусилля данських компаній з відбудови Україну.",
		"https://www.reuters.com/world/europe/denmark-establishes-1-bln-fund-aid-ukraine-2023-03-15/"
	],
	[
		"2023-03-16",
		"Canadian Defence Minister Anita Anand has announced additional military assistance to Ukraine. Canada will donate nearly 8,000 rounds of 155mm ammunition, as well as 12 air defence missiles sourced from Canadian Armed Forces’ (CAF) inventory, to sustain the air defence systems currently deployed in Ukraine.",
		"Міністр оборони Канади Аніта Ананд заявила про додаткову військову допомогу Україні. Канада передасть майже 8000 снарядів калібру 155 мм, а також 12 ракет ППО зі складу Збройних сил Канади (CAF) для підтримки систем ППО, які зараз розміщені в Україні.",
		"https://www.siasat.com/canada-announces-additional-military-aid-to-ukraine-2548113/"
	],
	[
		"2023-03-17",
		"Poland will send four Soviet-era Mig fighter jets to Ukraine - becoming the first Nato country to send planes since Russia invaded last year.",
		"Польща надішле в Україну чотири винищувачі радянських часів Міг, ставши першою країною НАТО, яка направить літаки після вторгнення Росії минулого року.",
		"https://www.bbc.com/news/world-europe-64975770"
	],
	[
		"2023-03-17",
		"Slovakia announced it would send 13 MiG-29 fighter jets to Ukraine in the coming weeks, joining fellow NATO member Poland. Slovakia's MiG-29s were retired last summer and most are not operational. The country plans to send those that are, with the rest going as spare parts for Ukraine's existing fleet.",
		"Словаччина оголосила, що найближчими тижнями відправить в Україну 13 винищувачів МіГ-29, приєднавшись до Польщі, яка є членом НАТО. Словацькі МіГ-29 були зняті з експлуатації минулого літа, і більшість з них не експлуатуються. Країна планує відправити ті, що є в експлуатації, а решта піде як запчастини до наявного українського флоту.",
		"https://www.npr.org/2023/03/16/1163895110/poland-will-send-fighter-jets-to-ukraine-the-first-nato-country-to-do-so"
	],
	[
		"2023-03-17",
		"Slovakia announces donation to Ukraine of 2 2K12 Kub air defense missile systems",
		"Словаччина повідомляє про передачу Україні двох зенітно-ракетних комплексів 2K12 Kub",
		"https://www.mosr.sk/52628-en/minister-obrany-j-nad-podpisal-medzivladnu-dohodu-s-ukrajinou/"
	],
	[
		"2023-03-18",
		"Three senior U.S. security officials held a video call with a group of their Ukrainian counterparts to discuss military aid to Kyiv. \"We discussed the further provision of necessary assistance to our country, in particular vehicles, weapons and ammunition,\" Andriy Yermak wrote on the Telegram messaging app.",
		"Троє високопоставлених співробітників служби безпеки США провели відеодзвінок з групою своїх українських колег, щоб обговорити військову допомогу Києву. «Ми обговорили подальше надання необхідної допомоги нашій державі, зокрема техніки, зброї та боєприпасів», – написав Андрій Єрмак у месенджері Telegram.",
		"https://www.voanews.com/a/top-ukraine-us-defense-officials-discuss-military-aid-in-call-/7011749.html"
	],
	[
		"2023-03-20",
		"Israel Approves Counter-Drone System Sale for Ukraine",
		"Ізраїль схвалив продаж системи боротьби з безпілотниками для України",
		"https://www.thedefensepost.com/2023/03/20/israel-counter-drone-system-ukraine/"
	],
	[
		"2023-03-20",
		"the Department of Defense (DoD) announces the authorization of a Presidential Drawdown of security assistance to meet Ukraine’s critical security and defense needs. This authorization is the thirty-fourth drawdown of equipment from DoD inventories for Ukraine since August 2021 and is valued at up to $350 million.",
		"Міністерство оборони оголошує про санкціонування президентського скорочення допомоги у сфері безпеки для задоволення критичних потреб України у сфері безпеки та оборони. Цей дозвіл є тридцять четвертим вилученням обладнання з інвентарних запасів Міністерства оборони України з серпня 2021 року та оцінюється в 350 мільйонів доларів США.",
		"https://www.defense.gov/News/Releases/Release/Article/3334472/dod-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-03-20",
		"North Macedonia confirmed sending of four previously promised SU-25 aircraft to Ukraine. The country's government is currently considering the transfer of 12 MI-24 attack helicopters to Ukraine.",
		"Північна Македонія підтвердила відправку Україні чотирьох раніше обіцяних літаків СУ-25. Наразі уряд країни розглядає питання про передачу Україні 12 ударних вертольотів Мі-24.",
		"https://censor.net/en/news/3406883/north_macedonia_confirmed_return_of_four_su25_aircraft_to_ukraine_mass_media"
	],
	[
		"2023-03-20",
		"The EU has reached a deal to send Ukraine 1 million rounds of ammunition within the next 12 months. The plan will see the EU both donate ammunition from its own stockpiles and also jointly purchase new shells for Ukraine. It also leaves open the possibility that the EU could help countries collectively buy missiles for Ukraine.",
		"ЄС домовився про відправку Україні 1 мільйона боєприпасів протягом наступних 12 місяців. Відповідно до плану, ЄС передасть боєприпаси зі своїх власних запасів і спільно закупить нові снаряди для України. Це також залишає відкритою можливість того, що ЄС може допомогти країнам колективно купувати ракети для України.",
		"https://www.politico.eu/article/eu-seals-deal-send-ukraine-1-million-ammo-rounds-shells-war/"
	],
	[
		"2023-03-20",
		"Canada is sending Leopard 2 based  armored recovery vehicle to Ukraine.",
		"Канада відправляє в Україну броньовану евакуаційну машину на базі Leopard-2.",
		"https://www.armyrecognition.com/defense_news_march_2023_global_security_army_industry/canada_is_sending_leopard_2_arv_recovery_tanks_to_ukraine.htmll"
	],
	[
		"2023-03-21",
		"The UK will send “armour piercing rounds which contain depleted uranium” to Ukraine, for use with the tank squadron donated by the British army.",
		"Велика Британія надішле в Україну «бронебійні снаряди, які містять збіднений уран» для використання в танковій ескадрильї, подарованій британською армією.",
		"https://declassifieduk.org/britain-supplying-depleted-uranium-rounds-to-ukraine/"
	],
	[
		"2023-03-21",
		"The Pentagon is speeding up its delivery of Abrams tanks to Ukraine, opting to send a refurbished older model that can be ready faster, with the aim of getting the 70-ton battle powerhouses to the war zone in eight to 10 months",
		"Пентагон прискорює поставку танків Abrams в Україну, вирішивши відправити відремонтовану стару модель, яка може бути готова швидше, з метою доставки 70-тонних бойових установок у зону бойових дій за вісім-десять місяців.",
		"https://news7.ca/novyny/ssha-hochut-pryskoryty-postavku-tankiv-abrams-ukrayini-zmi/"
	],
	[
		"2023-03-22",
		"65 Ukrainians are wrapping up training on the Patriot missile system at Fort Sill, in the coming days. The Ukrainian air defenders and two donated Patriot systems will be on the battlefield in a matter of weeks, after training began in mid-January.\n",
		"Найближчими днями 65 українців завершують навчання на ракетному комплексі Patriot у Форт-Сіллі. Українські ППО та дві подаровані системи «Патріот» будуть на полі бою за лічені тижні, після початку навчання в середині січня.",
		"https://www.politico.com/news/2023/03/21/us-delivery-tanks-missiles-ukraine-00088098"
	],
	[
		"2023-03-22",
		"Lithuanian President Gitanas Nausėda promised military support for Ukraine in his twitter message: \"In upcoming months, Lithuania will send anti-drones, weapons, ammunition, provide military training & will continue inviting the allies to boost up their efforts too.\" ",
		"Президент Литви Гітанас Науседа пообіцяв військову підтримку Україні у своєму повідомленні у Twitter: «Найближчими місяцями Литва надішле протипілотники, зброю, боєприпаси, забезпечить військову підготовку та продовжить запрошувати союзників також посилити свої зусилля».",
		"https://twitter.com/GitanasNauseda/status/1638463702826352644?s=20"
	],
	[
		"2023-03-23",
		"The first four of 13 Soviet-era MiG-29 fighter jets that Slovakia decided to give Ukraine have been safely handed over to the Ukrainian air force",
		"Перші чотири з 13 радянських винищувачів МіГ-29, які Словаччина вирішила передати Україні, безпечно передано українським ВПС",
		"https://apnews.com/article/russia-ukraine-war-us-slovakia-jets-c13dbb2e63da577e1f0d0f77050822e1"
	],
	[
		"2023-03-24",
		"The Finnish Ministry of Defence (MoD) has announced to donate 3 additional mine-clearing Leopard 2 main battle tanks (MBTs) to the Ukrainian Armed Forces.",
		"Міністерство оборони Фінляндії оголосило про передачу Збройним силам України 3 додаткових бойових танків (ОБТ) Leopard 2 для розмінування.",
		"https://www.army-technology.com/news/finland-mine-clearing-leopard2-ukraine/"
	],
	[
		"2023-03-24",
		"Ukraine's Defence Minister Oleksii Reznikov in his interview to Reuters said the government is expanding its drone programme for both reconnaissance and attacking enemy targets over an increasing range. Ukraine plans to spend nearly $550 million on drones in 2023 and has set up drone assault units within its armed forces.",
		"Міністр оборони України Олексій Резніков в інтерв'ю Reuters заявив, що уряд розширює програму безпілотників як для розвідки, так і для атаки ворожих цілей на все більшій відстані. Україна планує витратити майже 550 мільйонів доларів на безпілотники у 2023 році та створила штурмові підрозділи безпілотників у своїх збройних силах.",
		"https://www.reuters.com/world/europe/inside-ukraines-scramble-game-changer-drone-fleet-2023-03-24/"
	],
	[
		"2023-03-25",
		"Polish ammunition maker Dezamet, part of state arms producer Polska Grupa Zbrojeniowa (PGZ), will substantially boost capacity to supply EU-funded ammunition to Ukraine according to Poland’s Prime Minister Mateusz Morawiecki. “We want to multiply the output severalfold as quickly as possible,” he said. Dezamet, which produces ammunition for artillery, mortars, and grenade launchers, is one of PGZ group’s more than 50 armaments enterprises.",
		"Прем’єр-міністр Польщі Матеуш Моравецький заявив, що польський виробник боєприпасів Dezamet, який є частиною державного виробника зброї Polska Grupa Zbrojeniowa (PGZ), суттєво збільшить потужності для постачання в Україну боєприпасів, що фінансуються ЄС. «Ми хочемо якнайшвидше збільшити вихід у кілька разів», — сказав він. Компанія «Дезамет», яка виробляє боєприпаси для артилерії, мінометів і гранатометів, є одним із понад 50 збройових підприємств групи PGZ.",
		"https://tvpworld.com/68735075/poland-to-boost-production-of-ammunition-sevenfold-pm-morawiecki"
	],
	[
		"2023-03-26",
		"The General Staff of North Macedonia has backed the transfer to Ukraine of 12 Mi-24 military helicopters",
		"Генеральний штаб Північної Македонії підтримав передачу Україні 12 військових вертольотів Мі-24",
		"https://www.rferl.org/a/ukraine-macedonia-helicopters-mi24/32334786.html"
	],
	[
		"2023-03-27",
		"Ukraine received 18 German Leopard tanks and 14 British Challenger tanks",
		"Україна отримала 18 німецьких танків Leopard і 14 британських танків Challenger",
		"https://www.rfi.fr/en/international/20230328-promised-german-and-british-tanks-arrive-in-ukraine"
	],
	[
		"2023-03-27",
		"Ukrainian volunteers have started an international crowdsourcing campaign to provide their military with a fleet of FV101 Scorpion armored reconnaissance vehicles.",
		"Українські волонтери розпочали міжнародну краудсорсингову кампанію для забезпечення своїх військових парком броньованих розвідувальних машин FV101 Scorpion.",
		"https://www.thedefensepost.com/category/war/"
	],
	[
		"2023-03-27",
		"Ukrainian tank crews complete Challenger 2 MBT training in UK",
		"Українські танкісти завершили навчання на танках Challenger 2 у Великобританії",
		"https://www.armyrecognition.com/defense_news_march_2023_global_security_army_industry/ukrainian_tank_crews_complete_challenger_2_training_in_uk.html"
	],
	[
		"2023-03-27",
		"40 Marder infantry fighting vehicles from Germany have been handed over at the Ukrainian border",
		"40 бойових машин піхоти Marder з Німеччини передані на українському кордоні",
		"https://www.spiegel.de/politik/deutschland/deutsche-leopard-panzer-in-der-ukraine-angekommen-a-a275a157-d33a-4df0-a43e-bd57a0a7b6f9"
	],
	[
		"2023-03-28",
		"Germany wants to multiply spending on military aid to Ukraine in the coming years - from three to more than 15 billion euros. It is unclear how the sum would be allocated as well as the precise time frame covered by the spending. ",
		"Німеччина хоче збільшити витрати на військову допомогу Україні в найближчі роки – з трьох до понад 15 мільярдів євро. Незрозуміло, як буде розподілена сума, а також точні часові рамки",
		"https://www.spiegel.de/politik/deutschland/waffenhilfe-fuer-die-ukraine-wird-massiv-ausgeweitet-a-71fab9c7-6c38-41eb-8536-dbf20aee1114"
	],
	[
		"2023-03-28",
		"France will double this month its supplies of 155 artillery rounds to Ukraine to about 2,000 shells a month.",
		"Цього місяця Франція подвоїть постачання Україні 155 артилерійських снарядів до близько 2 тис. снарядів на місяць.",
		"https://uk.news.yahoo.com/france-double-munitions-supplies-ukraine-101423843.html"
	],
	[
		"2023-03-28",
		"Bulgaria will most likely sell a huge amount of ammunition to Ukraine through intermediaries",
		"Болгарія, швидше за все, продасть величезну кількість боєприпасів Україні через посередників",
		"https://www.euractiv.com/section/politics/news/bulgarian-ammo-to-ukraine-could-impact-war/"
	],
	[
		"2023-03-29",
		"The security commission of the Swiss House of Representatives has voted to decommission 25 out of 96 Leopard tanks, thereby enabling their sale back to their German manufacturer. This move will allow Switzerland to help Ukraine indirectly. The tanks are intended \"to fill the gaps in the German army that were created by supporting Ukraine with German tanks\".",
		"Комісія з безпеки Палати представників Конгресу Швейцарії проголосувала за виведення з експлуатації 25 із 96 танків Leopard, таким чином дозволивши їх продати назад німецькому виробнику. Цей крок дозволить Швейцарії опосередковано допомогти Україні. Танки призначені «заповнити прогалини в німецькій армії, які утворилися підтримкою України німецькими танками».",
		"https://www.swissinfo.ch/eng/swiss-commission-recommends-selling-25-tanks-back-to-germany/48401162"
	],
	[
		"2023-03-29",
		"Spain will send six promised Leopard battle tanks to Ukraine after Easter",
		"Іспанія після Великодня відправить в Україну шість обіцяних бойових танків Leopard",
		"https://www.thedefensepost.com/2023/03/29/spain-leopard-tanks-ukraine-4/"
	],
	[
		"2023-03-29",
		"Ukrainian army uses Corvo PPDS cardboard drones from Sypaq Australian company",
		"Українська армія використовує картонні дрони Corvo PPDS австралійської компанії Sypaq",
		"https://www.armyrecognition.com/ukraine_-_russia_conflict_war_2022/ukrainian_army_uses_corvo_ppds_cardboard_drones_from_sypaq_australian_company.html"
	],
	[
		"2023-03-31",
		"A new $2.6 billion U.S. military aid package that could include air surveillance radars, anti-tank rockets and fuel trucks for Ukraine's fight against Russia is expected to be announced as soon as Monday, three U.S. officials said on Friday.",
		"Очікується, що новий пакет військової допомоги США на суму 2,6 мільярда доларів, який може включати радари повітряного спостереження, протитанкові ракети та бензовози для боротьби України з Росією, буде оголошено найближчим часом у понеділок, повідомили у п’ятницю три американські чиновники.",
		"https://www.reuters.com/world/munitions-anti-tank-rockets-next-26-bln-us-pledge-ukraine-sources-2023-03-31/"
	],
	[
		"2023-04-01",
		"The chairman of the US Joint Chiefs of Staff General Mark A. Milley ruled out the possibility of the Pentagon providing long-range missiles to war-hit Ukraine, citing a small stockpile as the reason. ",
		"Голова Об'єднаного комітету начальників штабів США генерал Марк А. Міллі виключив можливість надання Пентагоном ракет великої дальності Україні, назвавши причиною невеликі запаси.",
		"https://www.republicworld.com/world-news/russia-ukraine-crisis/us-rejects-providing-long-range-missiles-to-ukraine-to-maintain-its-own-inventories-articleshow.html"
	],
	[
		"2023-04-01",
		"Polish prime minister Mateusz Morawiecki has announced ordering by Ukraine 100 Rosomak infantry fighting vehicles (IFVs) from Poland.",
		"Прем'єр-міністр Польщі Матеуш Моравецький заявив про замовлення Україною 100 бойових машин піхоти (БМП) Росомак у Польщі.",
		"https://www.thefirstnews.com/article/ukraine-orders-100-infantry-fighting-vehicles-from-poland-37569"
	]
]