[
	[
		"2023-05-17",
		"Britain and the Netherlands are working on an “international coalition” to help Ukraine procure F-16 fighter jets.",
		"Британія та Нідерланди працюють над створенням «міжнародної коаліції», щоб допомогти Україні придбати винищувачі F-16.",
		"https://edition.cnn.com/2023/05/16/europe/uk-netherlands-ukraine-f-16-fighters-intl-hnk/index.html"
	],
	[
		"2023-05-16",
		"Ukrainian tank crews and maintainers to start training on US M1A1 Abrams in Germany soon.",
		"Незабаром у Німеччині розпочнуться тренування українських танкістів та технічного обслуговування на американських M1A1 Abrams.",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/ukrainian_tank_crews_and_maintainers_to_start_training_on_us_m1a1_abrams_in_germany_soon.html"
	],
	[
		"2023-05-16",
		"German company HENSOLDT will supply six more of its TRML-4D high-performance radars to strengthen Ukraine's air defence. As part of an order worth more than 100 million euros, the radars will be delivered in the second half of the year following the training of the Ukrainian operators. ",
		"Німецька компанія HENSOLDT поставить ще шість своїх високоефективних радарів TRML-4D для посилення протиповітряної оборони України. У рамках замовлення вартістю понад 100 мільйонів євро радари будуть доставлені в другій половині року після навчання українських операторів.",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/hensoldt_to_supply_six_more_trml-4d_air_surveillance_radars_to_ukraine.html"
	],
	[
		"2023-05-16",
		"US Secretary of State Antony Blinken said the State Department would not rule out designating Russia a state sponsor of terrorism for its accused atrocities in Ukraine.",
		"Держсекретар США Ентоні Блінкен заявив, що Державний департамент не виключатиме визнання Росії державою-спонсором тероризму за звинувачені в ній злочини в Україні.",
		"https://edition.cnn.com/europe/live-news/russia-ukraine-war-news-05-16-23/h_4f2469b73a96495fa4c7af285a9ec538"
	],
	[
		"2023-05-15",
		"During the meeting in Paris on May 14, 2023, the presidents of Ukraine and the French Republic made the statement in which France ensured that military support to Ukraine will continue. Ukraine will receive new military packages with constant consideration of Ukraine's most significant and unmet needs to strengthen its defense capabilities. France seeks to ensure full capacity in all areas. In the coming weeks, France will train and equip several battalions with dozens of armored vehicles and light tanks, including the AMX-10RC. In addition, France is focusing its efforts on supporting Ukraine's possible air defenses to protect its population from Russian strikes.",
		"Під час зустрічі в Парижі 14 травня 2023 року президенти України та Французької Республіки зробили заяву, в якій Франція запевнила, що військова підтримка України продовжиться. Україна отримає нові військові пакети з постійним врахуванням найбільш значущих і незадоволених потреб України щодо посилення її обороноздатності. Франція прагне забезпечити повну потужність у всіх сферах. Найближчими тижнями Франція проведе підготовку й оснастить кілька батальйонів десятками броньованих машин і легких танків, включно з AMX-10RC. Крім того, Франція зосереджує зусилля на підтриманні можливих протиповітряної оборони України, щоб захистити її населення від ударів Росії.",
		"https://www.president.gov.ua/news/spilna-deklaraciya-ukrayini-ta-francuzkoyi-respubliki-82897"
	],
	[
		"2023-05-15",
		"The government of the UK will confirm today the further provision for Ukraine of hundreds of air defence missiles and further unmanned aerial systems, including hundreds of new long-range attack drones with a range of over 200km.",
		"Уряд Великої Британії сьогодні підтвердить подальше надання Україні сотень ракет протиповітряної оборони та інших безпілотних літальних комплексів, включаючи сотні нових ударних безпілотників дальньої дії з радіусом дії понад 200 км.",
		"https://news.sky.com/story/ukraines-president-volodymyr-zelenskyy-arrives-in-uk-for-substantive-negotiations-with-rishi-sunak-12881273"
	],
	[
		"2023-05-15",
		"French President Emmanuel Macron said his country has “opened the door” to training Ukrainian fighter pilots.",
		"Президент Франції Еммануель Макрон заявив, що його країна «відкрила двері» для підготовки українських пілотів-винищувачів.",
		"https://www.politico.eu/article/macron-france-to-train-ukrainian-fighter-pilots-war-zelenksyy/"
	],
	[
		"2023-05-15",
		"The US State Department has developed an AI-based online tool to counter Russian disinformation on the Ukraine war.",
		"Державний департамент США розробив онлайн-інструмент на основі ШІ для протидії російської дезінформації про війну в Україні.",
		"https://www.thedefensepost.com/2023/05/15/us-russian-disinformation-ai/"
	],
	[
		"2023-05-14",
		"European Union foreign policy chief Josep Borrell said the EU must speed up the supply of ammunition to Ukraine.",
		"Глава зовнішньополітичного відомства ЄС Жозеп Боррель заявив, що ЄС повинен прискорити постачання боєприпасів в Україну.",
		"https://www.aljazeera.com/news/2023/5/13/russia-ukraine-war-list-of-key-events-day-445"
	],
	[
		"2023-05-13",
		"Germany's Defense Ministry has announced a new military aid package for Ukraine in value of  €2.7 billion ($2.95 billion), which will include 20 additional Marder infantry fighting vehicles, 30 Leopard 1 tanks and four IRIS-T-SLM air defense systems.",
		"Міністерство оборони Німеччини оголосило про новий пакет військової допомоги Україні вартістю 2,7 млрд євро, який включатиме 20 додаткових бойових машин піхоти Marder, 30 танків Leopard 1 і чотири системи ППО IRIS-T-SLM.",
		"https://www.dw.com/en/germany-to-send-ukraine-27-billion-military-aid-package/a-65612028"
	],
	[
		"2023-05-13",
		"Ukrainian Ministry of Defence confirms plan to order locally-made T-84 Oplot tanks",
		"Міністерство оборони України підтверджує плани замовлення танків Т-84 \"Оплот\" вітчизняного виробництва",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/ukrainian_ministry_of_defence_confirms_plan_to_order_locally-made_t-84_oplot_tanks.amp.html"
	],
	[
		"2023-05-13",
		"German company Rheinmetall joins forces with Ukraine's Ukroboronprom to strengthen National Defense Industry",
		"Німецька компанія Rheinmetall об’єднує зусилля з українським Укроборонпромом для посилення національної оборонної промисловості",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/german_company_rheinmetall_joins_forces_with_ukraine_s_ukroboronprom_to_strengthen_national_defense_industry.amp.html"
	],
	[
		"2023-05-12",
		"Britain has delivered long-range ‘Storm Shadow’ cruise missiles to Ukraine.",
		"Великобританія поставила в Україну крилаті ракети великої дальності «Storm Shadow».",
		"https://edition.cnn.com/2023/05/11/politics/uk-storm-shadow-cruise-missiles-ukraine/index.html"
	],
	[
		"2023-05-12",
		"The Belgian government decided to adopt a new package of support measures for Ukraine. This aid comes in a context where Ukraine is preparing its counter-offensive against Russia and where the Ukrainian population must also be supported.",
		"Уряд Бельгії ухвалив новий пакет заходів підтримки України",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/belgium_offers_new_package_of_military_and_financial_aid_to_ukraine.amp.html"
	],
	[
		"2023-05-11",
		"The Ukrainian military has begun deploying the locally-made Bastion-2 MLRS with fast reloading system.",
		"Українські військові розпочали розгортання РСЗВ «Бастіон-2» із системою швидкої перезарядки вітчизняного виробництва.",
		"https://www.armyrecognition.com/ukraine_-_russia_conflict_war_2022/ukrainian_military_begins_deployment_of_local-made_advanced_bastion-2_mlrs_rocket_launcher.html"
	],
	[
		"2023-05-10",
		"Petr Pavel, President of the Czech Republic, announced that Prague would transfer two 2K12 Kub air defence systems and missiles for them to Kyiv.",
		"Президент Чехії Петр Павел заявив, що Прага передасть Києву дві системи ППО 2К12 «Куб» і ракети до них.",
		"https://news.yahoo.com/czech-republic-supplies-ukraine-two-160616614.html"
	],
	[
		"2023-05-09",
		"The United States will provide Ukraine with a $1.2 billion assistance package. The money will procure more 155 mm artillery rounds, will include additional air defense systems and munitions equipment to integrate Western air-defense launchers, missiles and radars with Ukraine's air-defense systems. This package is being provided under the Ukraine Security Assistance Initiative (USAI).",
		"Сполучені Штати нададуть Україні пакет допомоги на 1,2 мільярда доларів. Гроші підуть на закупівлю додаткової кількості артилерійських снарядів калібру 155 мм, включатимуть додаткові системи протиповітряної оборони та боєприпаси, обладнання для інтеграції західних пускових установок, ракет і радарів з українськими системами протиповітряної оборони. Цей пакет надається в рамках Ініціативи сприяння безпеці в Україні (USAI).",
		"https://www.defense.gov/News/Releases/Release/Article/3388890/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-05-09",
		"Irish troops have started training Ukrainian armed forces in bomb disposal and demining in Cyprus.",
		"Ірландські військовослужбовці розпочали навчання українських Збройних сил зі знешкодження бомб та розмінування на Кіпрі.",
		"https://www.irishtimes.com/ireland/2023/05/09/irish-troops-start-training-ukrainian-forces-in-cyprus/"
	],
	[
		"2023-05-08",
		"Ukraine receives Israeli Red alert missile warning radars",
		"Україна отримала ізраїльські радари попередження про ракети Red Alert",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/ukraine_receives_16_israeli_red_alert_missile_warning_radars.html"
	],
	[
		"2023-05-07",
		"Turkey rejected calls from Washington to send a Russian S-400 missile defence system to Ukraine, said Foreign Minister Mevlut Cavusoglu.",
		"Міністр закордонних справ Туреччини Мевлют Чавушоглу заявив, що Туреччина відхилила заклики Вашингтона відправити в Україну російську систему протиракетної оборони С-400.",
		"https://www.aljazeera.com/news/2023/5/8/russia-ukraine-war-list-of-key-events-day-439"
	],
	[
		"2023-05-06",
		"The European Council agreed Friday on €1 billion ($1.1 billion) support for ammunition and missiles for Ukraine under the European Peace Facility (EPF). \"The assistance measure will finance the provision to the Ukrainian Armed Forces of 155-mm-calibre artillery rounds and, if requested, missiles which will be jointly procured by EU member states from the European defence industry,\" it said. \"Together with the previous decision to swiftly provide ammunition from existing stocks, we are committing €2 billion to this purpose, bringing the total EU military support to Ukraine to €5.6 billion,\" said EU foreign policy chief Josep Borrell.",
		"Європейська Рада погодила підтримку в розмірі 1 мільярда євро на боєприпаси та ракети для України в рамках Європейського фонду миру (EPF). «Захід допомоги фінансуватиме забезпечення Збройних Сил України артилерійськими снарядами калібру 155 мм і, за запитом, ракетами, які будуть спільно закуповуватись державами-членами ЄС у європейської оборонної промисловості… Разом із попереднім рішенням про швидке постачання боєприпаси з існуючих запасів, ми виділяємо 2 мільярди євро на цю мету, доводячи загальну військову підтримку ЄС Україні до 5,6 мільярдів євро», – сказав верховний представник ЄС із закордонних справ Жозеп Боррель.",
		"https://www.aa.com.tr/en/russia-ukraine-war/eu-approves-allocation-of-over-11b-for-military-aid-for-ukraine/2890475"
	],
	[
		"2023-05-05",
		"Denmark and Germany join forces to donate 80 Leopard 1 tanks to Ukraine. Acting Defense Minister Troels Lund Poulsen said the tanks will be ready for use in Ukraine by June 1.",
		"Данія та Німеччина об’єдналися, щоб передати Україні 80 танків Leopard 1. Виконуючий обов'язки міністра оборони Троелс Лунд Поульсен заявив, що танки будуть готові до використання в Україні до 1 червня.",
		"https://nyheder.tv2.dk/2023-05-05-danmark-sender-stort-bidrag-af-kampvogne-til-ukraine"
	],
	[
		"2023-05-05",
		"Ukrainian soldiers already training on Leopard 1A5 tanks donated by Denmark",
		"Українські військові вже тренуються на подарованих Данією танках Leopard 1A5",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/ukrainian_soldiers_already_training_on_leopard_1a5_tanks_donated_by_denmark.amp.html"
	],
	[
		"2023-05-04",
		"Belgium is preparing a new military aid package for Ukraine, according to Prime Minister Alexander De Croo.",
		"Бельгія готує новий пакет військової допомоги Україні, заявив прем'єр-міністр Александр Де Кроо.",
		"https://www.brusselstimes.com/489666/new-package-of-belgian-military-aid-for-ukraine-under-preparation"
	],
	[
		"2023-05-03",
		"The Department of Defense (DoD) has announced additional security assistance for Ukraine. It includes additional ammunition for U.S.-provided HIMARS, additional howitzers, artillery and mortar rounds, and anti-armor capabilities valued at up to $300 million.",
		"Міністерство оборони оголосило про додаткову безпекову допомогу Україні. Вона включає додаткові боєприпаси для HIMARS, додаткові гаубиці, артилерійські та мінометні снаряди, а також засоби протитанкової боротьби на суму до 300 мільйонів доларів.",
		"https://www.defense.gov/News/Releases/Release/Article/3383288/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-05-03",
		"Prime Minister Chris Hipkins: \"New Zealand is significantly extending its defence commitments as well as humanitarian, legal and economic support for Ukraine as part of the ongoing international response to Russia’s illegal war of aggression\". The newly announced support include instructors deployment in the EU and UK to train Ukrainian soldiers, $4 mln. for humanitarian purposes, $1.3 mln. for International Criminal Court support in ensuring legal accountability for crimes in Ukraine.",
		"Прем’єр-міністр Кріс Хіпкінс: «Нова Зеландія значно розширює свої зобов’язання щодо оборони, а також гуманітарної, юридичної та економічної підтримки України в рамках поточної міжнародної відповіді на незаконну агресивну війну Росії». Нещодавно оголошена підтримка включає направлення інструкторів до ЄС та Великій Британії для навчання українських військових, 4 мільйони доларів на гуманітарні цілі, 1,3 млн дол. на підтримку Міжнародного кримінального суду в забезпеченні юридичної відповідальності за злочини в Україні.",
		"https://www.miragenews.com/nz-boosts-aid-to-ukraine-998428/"
	],
	[
		"2023-05-03",
		"Hudson Institute experts have long argued that the United States should equip Kyiv with a range of weapons and equipment—some of which the Biden administration has thus far withheld. These include:\n\n- 155mm Dual-Purpose Improved Conventional Munitions (DPICM) \n- Maneuver Short Range Air Defense (M-SHORAD)\n- MQ-9 Reaper Drones and MQ-1C Gray Eagles\n- Advanced Surface-to-Air Missile (SAM) Systems\n- M1150 Assault Breacher Vehicle (ABV) \n- M198 Howitzer\n- MGM-140 Army Tactical Missile System (ATACMS)\n",
		" Експерти Гудзоновського інституту вже давно стверджують, що Сполучені Штати повинні надати Києву низку озброєнь та обладнання, деякі з яких адміністрація Байдена досі не надавала. До них відносяться\n\n- 155-мм вдосконалені звичайні боєприпаси подвійного призначення (DPICM) \n- Маневрений зенітно-ракетний комплекс малої дальності (M-SHORAD)\n- Безпілотники MQ-9 Reaper і MQ-1C Gray Eagles\n- Передові зенітно-ракетні комплекси\n- M1150 Assault Breacher Vehicle (ABV)\n- Гаубиця M198\n- MGM-140 Армійський тактичний ракетний комплекс (ATACMS)",
		"https://www.eurasiareview.com/03052023-what-ukraine-needs-for-its-counteroffensive-oped/"
	],
	[
		"2023-05-02",
		"Denmark announced 1.7 billion kroner ($250 million) worth of military aid to Ukraine “to support the forthcoming Ukrainian offensive,” its defence ministry said. The donation package included mine clearing vehicles, ammunition and financial support for the procurement of air defence.",
		"Міністерство оборони Данії оголосило про надання Україні військової допомоги на суму 1,7 мільярда крон (250 мільйонів доларів) «для підтримки майбутнього українського наступу». Пакет пожертвувань включав машини для розмінування, боєприпаси та фінансову підтримку для закупівлі ППО.",
		"https://punchng.com/denmark-pledges-250m-in-military-aid-to-ukraine/"
	],
	[
		"2023-05-01",
		"House Speaker Kevin McCarthy emphatically stressed his support for military aid to Ukraine on Monday, blistering Russia's “killing of the children” and distancing himself from some in his party who oppose additional major U.S. aid to stave off the Russian invasion.",
		"Спікер Палати представників Кевін Маккарті рішуче наголосив на своїй підтримці військової допомоги Україні, розкритикувавши «вбивство дітей» Росією та дистанціювавшись від деяких членів його партії, які виступають проти додаткової допомоги США для запобігання російському вторгненню.",
		"https://www.military.com/daily-news/2023/05/01/us-speaker-mccarthy-russia-must-pull-out-of-ukraine.html"
	],
	[
		"2023-04-30",
		"The Ukrainian government launched a new initiative meant to streamline and promote innovation in the development of drones and other technologies. As part of the initiative dubbed BRAVE1, the government hopes to bring state, military, and private sector developers working on defense issues together into a tech cluster that would give Ukraine a battlefield advantage.",
		"Український уряд запустив нову ініціативу, спрямовану на оптимізацію та просування інновацій у розробці безпілотників та інших технологій. У рамках ініціативи під назвою BRAVE1 уряд сподівається об’єднати державних, військових і приватних розробників, які займаються питаннями оборони, у технологічний кластер, який дасть Україні перевагу на полі бою.",
		"https://www.arkansasonline.com/news/2023/apr/30/ukraine-seeks-tech-innovation/"
	],
	[
		"2023-04-30",
		"London is looking for long-range missiles for Ukraine",
		"Лондон шукає для України ракети великої дальності",
		"https://www.gov.uk/guidance/international-fund-for-ukraine-ifu"
	],
	[
		"2023-04-28",
		"Ukrainian Defense Minister Oleksii Reznikov on Twitter: \"CAESARs from Denmark are in Ukraine! ... Denmark had intended to use these systems for its army, but wisely and nobly decided to transfer them to the Ukrainian Army due to the significant threat that Russian aggression against Ukraine poses to Europe as a whole.\"",
		"Міністр оборони України Олексій Резніков у Twitter: «CAESAR з Данії в Україні!... Данія мала намір використовувати ці системи для своєї армії, але мудро і благородно вирішила передати їх українській армії через значну загрозу російської агресії проти України для Європи в цілому».",
		"https://twitter.com/oleksiireznikov/status/1651970145462435840?s=20"
	],
	[
		"2023-04-27",
		"The Ukrainian defense industry is developing unmanned underwater vehicles.",
		"Український оборонно промисловий комплекс розробляє безпілотні торпеди.",
		"https://mil.in.ua/en/news/unmanned-underwater-vehicles-are-being-developed-in-ukraine/"
	],
	[
		"2023-04-26",
		"Slovenia has secretly sent to Ukraine 20 Pandur I APCs (local name 'Valuk') which are armed with 40mm grenade launchers and 12.7 mm guns.",
		"Словенія таємно відправила в Україну 20 БТРів Pandur I (місцева назва «Валук»), озброєних 40-мм гранатометами та 12,7-мм гарматами.",
		"https://www.24ur.com/novice/tujina/slovenski-valuki-na-ukrajinsko-fronto.html"
	],
	[
		"2023-04-26",
		"The Pentagon’s top civilian and military leaders for Europe reiterated to Congress that providing modern Western fighter jets like the F-16 to Ukraine is not an immediate priority for the Department of Defense.",
		"Надання Україні сучасних західних винищувачів, таких як F-16, не є безпосереднім пріоритетом для Міністерства оборони.",
		"https://www.airandspaceforces.com/pentagons-europe-f-16s-ukraine-russian-air-force/"
	],
	[
		"2023-04-26",
		"German Skynex air defense cannon and missile systems are already on combat duty in Ukraine ",
		"В Україні вже несуть бойове чергування німецькі ЗРК Skynex",
		"https://www.armyrecognition.com/defense_news_april_2023_global_security_army_industry/german_skynex_air_defense_systems_deployed_and_ready_in_ukraine_to_fight_russian_aerial_threats.html"
	],
	[
		"2023-04-26",
		"Australian company Electro Optic Systems (EOS) has secured a conditional contract to supply Remote Weapon Systems (RWS) to Ukraine valued at up to US$80m. ",
		"Австралійська компанія Electro Optic Systems (EOS) уклала умовний контракт на поставку дистанційних систем озброєння (RWS) в Україну на суму до 80 мільйонів доларів США.",
		"https://www.armyrecognition.com/defense_news_april_2023_global_security_army_industry/eos_electro_optic_systems_to_supply_remote_weapon_systems_to_ukraine.html"
	],
	[
		"2023-04-24",
		"Senate Armed Services Committee chair Sen. Jack Reed thinks there will be strong bipartisan support—both in the Armed Services and Appropriations committees—to increase production of munitions and build up the defense industrial base.",
		"Голова комітету Сенату з питань збройних сил, сенатор Джек Рід вважає, що буде сильна підтримка обох партій — як у комітетах зі збройних сил, так і в комітетах з асигнувань — для збільшення виробництва боєприпасів і розбудови оборонної промислової бази.",
		"https://www.airandspaceforces.com/sasc-chair-bipartisan-munitions-production/"
	],
	[
		"2023-04-22",
		"The US Army is spending about $1.5 billion to ramp up production of 155 mm rounds from 14,000 a month before Russia invaded Ukraine to over 85,000 a month by 2028, U.S. Army Undersecretary Gabe Camarillo told a symposium last month.",
		"Армія США витрачає близько 1,5 мільярда доларів на збільшення виробництва 155-мм снарядів з 14 000 на місяць до того, як Росія вторглася в Україну, до понад 85 000 на місяць до 2028 року",
		"https://apnews.com/article/us-army-ukraine-russia-ammunition-war-75a9ca2e3be09578c65f1198ba5b72e5"
	],
	[
		"2023-04-22",
		"Portugal has committed to sending Ukraine three armored medical evacuation vehicles and two personnel carriers.",
		"Португалія зобов’язалася надіслати Україні три броньовані медичні евакуаційні машини та два транспортери.",
		"https://english.nv.ua/nation/portugal-to-donate-five-armoured-rescue-and-personnel-carriers-to-ukraine-50319556.html"
	],
	[
		"2023-04-21",
		"Six Leopard 2A4 tanks destined for Ukraine left Spain by ship on Friday. Spanish Defence Minister Margarita Robles said that Spain will send 10 Leopard 2A4 tanks. The military is repairing the remaining four. ",
		"Шість танків Leopard 2A4, призначених для України, покинули Іспанію кораблем у п'ятницю. Міністр оборони Іспанії Маргарита Роблес заявила, що Іспанія надішле 10 танків Leopard 2A4. Ще чотири ремонтують.",
		"https://www.reuters.com/world/europe/six-leopard-tanks-leave-spain-en-route-ukraine-2023-04-21/"
	],
	[
		"2023-04-21",
		"Canada is providing a new military aid package for Ukraine. The Department of National Defence spends CAN $39 mil. (USD $31 mil.) assistance which includes 3.3 million litres of fuel supplies, modular floatation bridge assets, medical first aid kits, as well as sniper rifles and ammunition.",
		"Канада надає новий пакет військової допомоги Україні. Пакет на 39 мільйонів канадських доларів (31 млн. дол. США) включає 3,3 мільйона літрів палива, засоби модульного наплавного мосту, аптечки першої допомоги, а також снайперські гвинтівки та боєприпаси.",
		"https://www.reuters.com/world/americas/canada-send-rifles-radios-new-c39-million-ukraine-aid-package-2023-04-21"
	],
	[
		"2023-04-21",
		"Ināra Mūrniece, Latvia's Minister of Defence, declared the country's intent to transfer its entire stock of FIM-92 Stinger MANPADS man-portable anti-aircraft missile systems to Ukraine.",
		"Міністр оборони Латвії Інара Мурніеце заявила про намір країни передати Україні весь запас переносних зенітно-ракетних комплексів FIM-92 Stinger MANPADS.",
		"https://www.armyrecognition.com/defense_news_april_2023_global_security_army_industry/latvia_to_send_entire_fim-92_stinger_missiles_manpads_stock_to_ukraine.html"
	],
	[
		"2023-04-21",
		"Czech Defense Minister Daniel Blazhkovets, has announced plans to upgrade an additional batch of T-72 Main Battle Tanks (MBTs). This initiative will be carried out in partnership with the United States and the Netherlands.",
		"Міністр оборони Чехії Даніель Блажковец оголосив про плани модернізації додаткової партії основних бойових танків (ОБТ) Т-72. Ця ініціатива здійснюватиметься у партнерстві зі Сполученими Штатами та Нідерландами.",
		"https://www.armyrecognition.com/defense_news_april_2023_global_security_army_industry/czech_republic_announces_a_plan_to_upgrade_more_t-72_tanks_for_ukraine.html"
	],
	[
		"2023-04-21",
		"Germany delivers to Ukraine second of four promised Iris-T SLM air defense missile systems",
		"Німеччина поставила в Україну другий із чотирьох обіцяних зенітно-ракетних комплексів Iris-T SLM",
		"https://www.bundesregierung.de/breg-en/news/military-support-ukraine-2054992"
	]
]