[
	[
		"2023-05-25",
		"The United States plans to announce up to $300 million worth of military aid for Ukraine comprised mainly of ammunition.",
		"Сполучені Штати планують оголосити про надання Україні військової допомоги на суму до 300 мільйонів доларів, яка складатиметься переважно з боєприпасів.",
		"https://www.reuters.com/world/europe/us-announce-more-military-aid-ukraine-mainly-ammunition-sources-2023-05-25/"
	],
	[
		"2023-05-25",
		"The Pentagon continues to work its way through an accounting error that overstated the value of past aid, an error that may lead the way for more weapons being sent to Ukraine.",
		"Пентагон продовжує намагатися виправити облікову помилку, яка завищила вартість минулої допомоги, помилка, яка може стати причиною надсилання нових озброєнь в Україну.",
		"https://www.reuters.com/world/europe/us-announce-more-military-aid-ukraine-mainly-ammunition-sources-2023-05-25/"
	],
	[
		"2023-05-25",
		"The members of the Ukraine Defense Contact Group, which meets in Germany’s Ramstein Air Base, pledged to provide $65 billion of military aid to Ukraine,",
		"Члени Контактної групи з питань оборони України, яка збирається на німецькій авіабазі Рамштайн, пообіцяли надати Україні військову допомогу на суму 65 мільярдів доларів.",
		"https://www.defense.gov/News/Speeches/Speech/Article/3407082/opening-remarks-by-secretary-of-defense-lloyd-j-austin-iii-at-the-12th-ukraine/"
	],
	[
		"2023-05-25",
		"Lithuania's next package of assistance announced at Ramstein meeting would provide to Ukraine drone jamming equipment, ammunition, military rations, and other types of assistance.",
		"Наступний пакет допомоги Литви, оголошений на зустрічі в Рамштайні, передбачатиме надання Україні обладнання для постановки перешкод безпілотникам, амуніції, військового пайка та інших видів допомоги.",
		"https://kam.lt/en/lithuania-announces-its-next-package-of-support-to-ukraine-at-the-ramstein-format-meeting/"
	],
	[
		"2023-05-24",
		"Germany’s request to buy 25 mothballed Swiss Leopard 2 tanks, intended to make up for stocks it’s sending to Ukraine, won the support of Switzerland’s government.",
		"Заявка Німеччини на купівлю 25 законсервованих швейцарських танків Leopard 2 для компенсації запасів, які вона відправляє в Україну, отримала підтримку уряду Швейцарії.",
		"https://www.bloomberg.com/news/articles/2023-05-24/swiss-back-sale-of-25-tanks-to-germany-to-support-ukraine-effort"
	],
	[
		"2023-05-24",
		"Finland said it would provide Ukraine with 109 million euros ($117 million) in additional military equipment to include anti-aircraft weapons and ammunition. The details of the aid would not be disclosed “for operational reasons and in order to ensure the safe delivery of assistance.” The Finland's total military assistance to Ukraine will become 1.1 billion euros ($1.2 billion). ",
		"Фінляндія заявила, що надасть Україні 109 мільйонів євро (117 мільйонів доларів) додаткового військового обладнання, включаючи зенітну зброю та боєприпаси. Деталі допомоги не розголошуються «з оперативних причин і для забезпечення безпечної доставки допомоги». Загальна військова допомога Фінляндії Україні становитиме 1,1 млрд євро ($1,2 млрд).",
		"https://www.rferl.org/a/finland-ukraine-military-aid-russia-invasion/32427777.html"
	],
	[
		"2023-05-23",
		"Germany has significantly increased their list of military help to Ukraine in planning or execution phase. It includes \n\n- 110 Leopard 1 tanks\n- 20 Marder IFVs\n- 4 IRIS-T air defense systems with 12 launchers\n- 18 self-propelled anti-air GEPARD guns\n- anti-air rockets and ammunition\n- a variety of reconnaissance, military engineer and transport systems\n- artillery and tank shells\n- small arms, equipment and munitions",
		"Німеччина значно розширила перелік військової допомоги Україні на етапі планування або виконання. Він включає \n\n- 110 танків Leopard 1\n- 20 БМП Marder\n- 4 системи ППО IRIS-T з 12 пусковими установками\n- 18 самохідних зенітних установок GEPARD\n- зенітні ракети та боєприпаси\n- різноманітні розвідувальні, військово-інженерні та транспортні системи\n- артилерійські і танкові снаряди\n- стрілецьку зброю, спорядження та боєприпаси",
		"https://www.bundesregierung.de/breg-en/news/military-support-ukraine-2054992"
	],
	[
		"2023-05-23",
		"German Defense Minister Boris Pistorius criticized Hungary for blocking further military aid to Ukraine at a meeting of EU defense ministers in Brussels on May 23. Pistorius said he was \"somewhat disappointed or irritated by the behavior of Hungarian friends\" for blocking the aid. The move comes after Ukraine included Hungary's largest bank OTP in a list of supporters of Russia's invasion, prompting outrage from Budapest. A Hungarian government spokesman said Hungary would reject new military aid unless the OTP bank was removed from the list.",
		"Міністр оборони Німеччини Борис Пісторіус розкритикував Угорщину за блокування подальшої військової допомоги Україні на зустрічі міністрів оборони ЄС у Брюсселі 23 травня. Пісторіус сказав, що він \"дещо розчарований або роздратований поведінкою угорських друзів\" через блокування допомоги. Цей крок стався після того, як Україна включила найбільший банк Угорщини OTP до списку прихильників вторгнення Росії, що викликало обурення Будапешта. Речник угорського уряду заявив, що Угорщина відмовиться від нової військової допомоги, якщо банк OTP не буде вилучено зі списку.",
		"https://www.rferl.org/a/german-minister-slam-hungarian-blockade-eu-military-aid/32424499.html"
	],
	[
		"2023-05-23",
		"The Europe-based unit of the US Army in charge of shipping weapons to Ukraine has sped up deliveries by 30 percent compared to the start of Russia’s full-scale invasion.",
		"Базований у Європі підрозділ армії США, який відповідає за доставку зброї в Україну, прискорив поставки на 30 відсотків порівняно з початком повномасштабного вторгнення Росії.",
		"https://www.defenseone.com/threats/2023/05/arms-ukraine-flow-30-faster-us-relearns-cold-war-skills/386704/"
	],
	[
		"2023-05-23",
		"The Netherlands is contributing €260 million to a joint purchase of 155 mm ammunition for Ukraine.",
		"Нідерланди виділять 260 мільйонів євро на спільну закупівлю 155 мм боєприпасів для України.",
		"https://www.defensie.nl/actueel/nieuws/2023/05/23/eu-raad-defensieministers-munitie-voor-oekraine-opschaling-productie-en-nieuwe-defensieprojecten"
	],
	[
		"2023-05-23",
		"EU Foreign Affairs Council meeting on defence gathered in Brussels on May 22. The meeting addressed possibilities to accelerate the military support to Ukraine and ensure manufacturing and supply of the ammunition required.",
		"22 травня в Брюсселі відбулося засідання Ради ЄС із закордонних справ з питань оборони, на якому обговорювалися можливості прискорити військову підтримку України та забезпечити виробництво та постачання необхідних боєприпасів.",
		"https://www.consilium.europa.eu/en/meetings/fac/2023/05/22/"
	],
	[
		"2023-05-22",
		"Recent polls by SWG show the majority of Italians are in favor of military support of Ukraine. Among the most convinced supporters instead of military support for Ukraine are the Poles with 68% and the Spanish with 66%.",
		"Останні опитування SWG показують, що більшість італійців виступають за військову підтримку України. Серед найбільш переконаних прихильників замість військової підтримки України – поляки з 68% та іспанці з 66%.",
		"https://www.open.online/2023/05/22/sondaggio-swg-tgla7-invio-armi-italia-europa/"
	],
	[
		"2023-05-21",
		"The Department of Defense announced thirty-eighth drawdown of equipment from DoD inventories for Ukraine. It includes\n\n- additional ammunition for High Mobility Artillery Rocket Systems (HIMARS)\n- 155mm and 105mm artillery rounds\n- Tube-Launched, Optically-Tracked, Wire-Guided (TOW) missiles\n- Javelin and AT-4 anti-armor systems\n- Laser-guided rocket system munitions\n- demolition munitions\n- armored bridging systems\n- armored medical treatment vehicles\n- trucks and trailers to transport heavy equipment\n- logistics support equipment\n- thermal imagery systems\n- spare parts and other field equipment",
		"Міністерство оборони США оголосило про новий пакет допомоги Україні, якій включає: \n\n- додаткові боєприпаси для ракетно-артилерійських систем високої мобільності (HIMARS)\n- артилерійські снаряди калібру 155 мм і 105 мм\n- ракети трубного пуску з оптичним відстеженням і дротовим наведенням (TOW)\n- протитанкові системи Javelin і AT-4\n- боєприпаси ракетної системи з лазерним наведенням\n- підривні боєприпаси\n- броньовані мостові системи\n- броньовані медичні машини\n- вантажівки та причепи для перевезення важкої техніки\n- обладнання матеріально-технічного забезпечення\n- тепловізійні системи\n- запчастини та інше польове обладнання",
		"https://www.defense.gov/News/Releases/Release/Article/3402206/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-05-21",
		"The Japanese Foreign Ministry said that the country will send 100 vehicles of self-defense forces and 30 thousand food rations to Ukraine",
		"У МЗС Японії заявили, що країна надішле в Україну 100 одиниць техніки сил самооборони та 30 тисяч продовольчих пайків.",
		"https://en.trend.az/world/3751223.html"
	],
	[
		"2023-05-20",
		"The Netherlands has cancelled an agreement to sell its F-16 to private company Draken International. Presumably, these F-16 fighters will be transferred to the needs of the Air Force of the Armed Forces of Ukraine.",
		"Нідерланди скасували угоду про продаж своїх F-16 приватній компанії Draken International. Імовірно, ці винищувачі F-16 будуть передані для потреб Повітряних Сил Збройних Сил України.",
		"https://twitter.com/oryxspioenkop/status/1659875567712325633?s=20"
	],
	[
		"2023-05-19",
		"US signals to allies it won’t block their export of F-16 jets to Ukraine",
		"США сигналізують союзникам, що не блокуватимуть експорт їхніх літаків F-16 в Україну",
		"https://edition.cnn.com/2023/05/18/politics/us-allies-f-16-jets-ukraine/index.html"
	],
	[
		"2023-05-19",
		"The Pentagon overestimated the value of the ammunition, missiles and other equipment it sent to Ukraine by around $3 billion, according to a Senate aide, an error that may lead the way for more weapons being sent to Kyiv for its defense against Russian forces.",
		"Пентагон переоцінив вартість боєприпасів, ракет та іншого обладнання, яке він відправив в Україну, приблизно на 3 мільярди доларів, за словами помічника Сенату, помилка, яка може стати причиною відправки до Києва більшої кількості зброї для його захисту від російських військ.",
		"https://www.reuters.com/world/europe/pentagon-accounting-error-overvalued-ukraine-aid-by-3-billion-sources-2023-05-18/"
	],
	[
		"2023-05-19",
		"Portugal has made a decision to join the aviation coalition aimed at strengthening the Air Force of Ukraine. Dmitro Kuleba wrote in his Twitter accout that he is \"Grateful for Portugal’s decision to join the aviation coalition by beginning to train Ukrainian pilots and technicians\".",
		"Португалія прийняла рішення приєднатися до авіаційної коаліції, спрямованої на посилення ВПС України. Дмитро Кулеба написав у своєму Twitter, що «вдячний за рішення Португалії приєднатися до авіаційної коаліції, почавши навчати українських пілотів і техніків».",
		"https://twitter.com/DmytroKuleba/status/1659630660514922510?s=20"
	],
	[
		"2023-05-18",
		"Norwegian Defence Minister Bjorn Arild Gram \"Today we are confirming the delivery of long-range artillery and radars. Norway provides three Arthur artillery location radars and up to eight long-range rocket artillery of the MLRS type. The donations are made in close collaboration with the UK.\"",
		"Міністр оборони Норвегії Бйорн Арільд Грам: «Сьогодні ми підтверджуємо поставку далекобійної артилерії та радарів. Норвегія надає три артилерійські локаційні радари Arthur і до восьми далекобійних реактивних артилерійських установок типу РСЗВ. Пожертви зроблені в тісній співпраці з Великобританією».",
		"https://www.regjeringen.no/no/aktuelt/statement-from-bjorn-arild-gram-meeting-ben-wallace-in-northwood/id2977724/"
	],
	[
		"2023-05-17",
		"Britain and the Netherlands are working on an “international coalition” to help Ukraine procure F-16 fighter jets.",
		"Британія та Нідерланди працюють над створенням «міжнародної коаліції», щоб допомогти Україні придбати винищувачі F-16.",
		"https://edition.cnn.com/2023/05/16/europe/uk-netherlands-ukraine-f-16-fighters-intl-hnk/index.html"
	],
	[
		"2023-05-16",
		"Ukrainian tank crews and maintainers to start training on US M1A1 Abrams in Germany soon.",
		"Незабаром у Німеччині розпочнуться тренування українських танкістів та технічного персоналу на американських M1A1 Abrams.",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/ukrainian_tank_crews_and_maintainers_to_start_training_on_us_m1a1_abrams_in_germany_soon.html"
	],
	[
		"2023-05-16",
		"German company HENSOLDT will supply six more of its TRML-4D high-performance radars to strengthen Ukraine's air defence. As part of an order worth more than 100 million euros, the radars will be delivered in the second half of the year following the training of the Ukrainian operators. ",
		"Німецька компанія HENSOLDT поставить ще шість своїх високоефективних радарів TRML-4D для посилення протиповітряної оборони України. У рамках замовлення вартістю понад 100 мільйонів євро радари будуть доставлені в другій половині року після навчання українських операторів.",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/hensoldt_to_supply_six_more_trml-4d_air_surveillance_radars_to_ukraine.html"
	],
	[
		"2023-05-15",
		"During the meeting in Paris on May 14, 2023, the presidents of Ukraine and the French Republic made the statement in which France ensured that military support to Ukraine will continue. Ukraine will receive new military packages with constant consideration of Ukraine's most significant and unmet needs to strengthen its defense capabilities. France seeks to ensure full capacity in all areas. In the coming weeks, France will train and equip several battalions with dozens of armored vehicles and light tanks, including the AMX-10RC. In addition, France is focusing its efforts on supporting Ukraine's possible air defenses to protect its population from Russian strikes.",
		"Під час зустрічі в Парижі 14 травня 2023 року президенти України та Французької Республіки зробили заяву, в якій Франція запевнила, що військова підтримка України продовжиться. Україна отримає нові військові пакети з постійним врахуванням найбільш значущих і незадоволених потреб України щодо посилення її обороноздатності. Франція прагне забезпечити повну потужність у всіх сферах. Найближчими тижнями Франція проведе підготовку й оснастить кілька батальйонів десятками броньованих машин і легких танків, включно з AMX-10RC. Крім того, Франція зосереджує зусилля на підтриманні протиповітряної оборони України, щоб захистити її населення від ударів Росії.",
		"https://www.president.gov.ua/news/spilna-deklaraciya-ukrayini-ta-francuzkoyi-respubliki-82897"
	],
	[
		"2023-05-15",
		"The government of the UK will confirm today the further provision for Ukraine of hundreds of air defence missiles and further unmanned aerial systems, including hundreds of new long-range attack drones with a range of over 200km.",
		"Уряд Великої Британії сьогодні підтвердить подальше надання Україні сотень ракет протиповітряної оборони та інших безпілотних літальних комплексів, включаючи сотні нових ударних безпілотників дальньої дії з радіусом понад 200 км.",
		"https://news.sky.com/story/ukraines-president-volodymyr-zelenskyy-arrives-in-uk-for-substantive-negotiations-with-rishi-sunak-12881273"
	],
	[
		"2023-05-15",
		"French President Emmanuel Macron said his country has “opened the door” to training Ukrainian fighter pilots.",
		"Президент Франції Еммануель Макрон заявив, що його країна «відкрила двері» для підготовки українських пілотів-винищувачів.",
		"https://www.politico.eu/article/macron-france-to-train-ukrainian-fighter-pilots-war-zelenksyy/"
	],
	[
		"2023-05-14",
		"European Union foreign policy chief Josep Borrell said the EU must speed up the supply of ammunition to Ukraine.",
		"Глава зовнішньополітичного відомства ЄС Жозеп Боррель заявив, що ЄС повинен прискорити постачання боєприпасів в Україну.",
		"https://www.aljazeera.com/news/2023/5/13/russia-ukraine-war-list-of-key-events-day-445"
	],
	[
		"2023-05-13",
		"Germany's Defense Ministry has announced a new military aid package for Ukraine in value of  €2.7 billion ($2.95 billion), which will include 20 additional Marder infantry fighting vehicles, 30 Leopard 1 tanks and four IRIS-T-SLM air defense systems.",
		"Міністерство оборони Німеччини оголосило про новий пакет військової допомоги Україні вартістю 2,7 млрд євро, який включатиме 20 додаткових бойових машин піхоти Marder, 30 танків Leopard 1 і чотири системи ППО IRIS-T-SLM.",
		"https://www.dw.com/en/germany-to-send-ukraine-27-billion-military-aid-package/a-65612028"
	],
	[
		"2023-05-13",
		"Ukrainian Ministry of Defence confirms plan to order locally-made T-84 Oplot tanks",
		"Міністерство оборони України підтверджує плани замовлення танків Т-84 \"Оплот\" вітчизняного виробництва",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/ukrainian_ministry_of_defence_confirms_plan_to_order_locally-made_t-84_oplot_tanks.amp.html"
	],
	[
		"2023-05-13",
		"German company Rheinmetall joins forces with Ukraine's Ukroboronprom to strengthen National Defense Industry",
		"Німецька компанія Rheinmetall об’єднує зусилля з українським Укроборонпромом для посилення національної оборонної промисловості",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/german_company_rheinmetall_joins_forces_with_ukraine_s_ukroboronprom_to_strengthen_national_defense_industry.amp.html"
	],
	[
		"2023-05-12",
		"Britain has delivered long-range ‘Storm Shadow’ cruise missiles to Ukraine.",
		"Великобританія поставила в Україну крилаті ракети великої дальності «Storm Shadow».",
		"https://edition.cnn.com/2023/05/11/politics/uk-storm-shadow-cruise-missiles-ukraine/index.html"
	],
	[
		"2023-05-12",
		"The Belgian government decided to adopt a new package of support measures for Ukraine. This aid comes in a context where Ukraine is preparing its counter-offensive against Russia and where the Ukrainian population must also be supported.",
		"Уряд Бельгії ухвалив новий пакет заходів підтримки України",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/belgium_offers_new_package_of_military_and_financial_aid_to_ukraine.amp.html"
	],
	[
		"2023-05-11",
		"The Ukrainian military has begun deploying the locally-made Bastion-2 MLRS with fast reloading system.",
		"Українські військові розпочали розгортання РСЗВ «Бастіон-2» із системою швидкої перезарядки вітчизняного виробництва.",
		"https://www.armyrecognition.com/ukraine_-_russia_conflict_war_2022/ukrainian_military_begins_deployment_of_local-made_advanced_bastion-2_mlrs_rocket_launcher.html"
	],
	[
		"2023-05-10",
		"Petr Pavel, President of the Czech Republic, announced that Prague would transfer two 2K12 Kub air defence systems and missiles for them to Kyiv.",
		"Президент Чехії Петр Павел заявив, що Прага передасть Києву дві системи ППО 2К12 «Куб» і ракети до них.",
		"https://news.yahoo.com/czech-republic-supplies-ukraine-two-160616614.html"
	],
	[
		"2023-05-09",
		"The United States will provide Ukraine with a $1.2 billion assistance package. The money will procure more 155 mm artillery rounds, will include additional air defense systems and munitions equipment to integrate Western air-defense launchers, missiles and radars with Ukraine's air-defense systems. This package is being provided under the Ukraine Security Assistance Initiative (USAI).",
		"Сполучені Штати нададуть Україні пакет допомоги на 1,2 мільярда доларів. Гроші підуть на закупівлю додаткової кількості артилерійських снарядів калібру 155 мм, включатимуть додаткові системи протиповітряної оборони та боєприпаси, обладнання для інтеграції західних пускових установок, ракет і радарів з українськими системами протиповітряної оборони. Цей пакет надається в рамках Ініціативи сприяння безпеці в Україні (USAI).",
		"https://www.defense.gov/News/Releases/Release/Article/3388890/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-05-09",
		"Irish troops have started training Ukrainian armed forces in bomb disposal and demining in Cyprus.",
		"Ірландські військовослужбовці розпочали навчання українських Збройних сил зі знешкодження бомб та розмінування на Кіпрі.",
		"https://www.irishtimes.com/ireland/2023/05/09/irish-troops-start-training-ukrainian-forces-in-cyprus/"
	],
	[
		"2023-05-09",
		"Former NATO commander Sir Richard Shirreff has warned that unless the West increases its support for Ukraine, it could get pulled into a direct conflict with Russia.",
		"Колишній командувач НАТО сер Річард Ширрефф попередив, що якщо Захід не посилить підтримку України, вона може бути втягнута в прямий конфлікт з Росією.",
		"https://www.rferl.org/a/interview-shirreff-challenges-ukraine-counteroffensive-russia/32403483.html"
	],
	[
		"2023-05-08",
		"Ukraine receives Israeli Red alert missile warning radars",
		"Україна отримала ізраїльські радари попередження про ракети Red Alert",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/ukraine_receives_16_israeli_red_alert_missile_warning_radars.html"
	],
	[
		"2023-05-07",
		"Turkey rejected calls from Washington to send a Russian S-400 missile defence system to Ukraine, said Foreign Minister Mevlut Cavusoglu.",
		"Міністр закордонних справ Туреччини Мевлют Чавушоглу заявив, що Туреччина відхилила заклики Вашингтона відправити в Україну російську систему протиракетної оборони С-400.",
		"https://www.aljazeera.com/news/2023/5/8/russia-ukraine-war-list-of-key-events-day-439"
	],
	[
		"2023-05-06",
		"The European Council agreed Friday on €1 billion ($1.1 billion) support for ammunition and missiles for Ukraine under the European Peace Facility (EPF). \"The assistance measure will finance the provision to the Ukrainian Armed Forces of 155-mm-calibre artillery rounds and, if requested, missiles which will be jointly procured by EU member states from the European defence industry,\" it said. \"Together with the previous decision to swiftly provide ammunition from existing stocks, we are committing €2 billion to this purpose, bringing the total EU military support to Ukraine to €5.6 billion,\" said EU foreign policy chief Josep Borrell.",
		"Європейська Рада погодила підтримку в розмірі 1 мільярда євро на боєприпаси та ракети для України в рамках Європейського фонду миру (EPF). «Захід допомоги фінансуватиме забезпечення Збройних Сил України артилерійськими снарядами калібру 155 мм і, за запитом, ракетами, які будуть спільно закуповуватись державами-членами ЄС у європейської оборонної промисловості… Разом із попереднім рішенням про швидке постачання боєприпаси з існуючих запасів, ми виділяємо 2 мільярди євро на цю мету, доводячи загальну військову підтримку ЄС Україні до 5,6 мільярдів євро», – сказав верховний представник ЄС із закордонних справ Жозеп Боррель.",
		"https://www.aa.com.tr/en/russia-ukraine-war/eu-approves-allocation-of-over-11b-for-military-aid-for-ukraine/2890475"
	],
	[
		"2023-05-05",
		"Denmark and Germany join forces to donate 80 Leopard 1 tanks to Ukraine. Acting Defense Minister Troels Lund Poulsen said the tanks will be ready for use in Ukraine by June 1.",
		"Данія та Німеччина об’єдналися, щоб передати Україні 80 танків Leopard 1. Виконуючий обов'язки міністра оборони Троелс Лунд Поульсен заявив, що танки будуть готові до використання в Україні до 1 червня.",
		"https://nyheder.tv2.dk/2023-05-05-danmark-sender-stort-bidrag-af-kampvogne-til-ukraine"
	],
	[
		"2023-05-05",
		"Ukrainian soldiers already training on Leopard 1A5 tanks donated by Denmark",
		"Українські військові вже тренуються на подарованих Данією танках Leopard 1A5",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/ukrainian_soldiers_already_training_on_leopard_1a5_tanks_donated_by_denmark.amp.html"
	],
	[
		"2023-05-04",
		"Belgium is preparing a new military aid package for Ukraine, according to Prime Minister Alexander De Croo.",
		"Бельгія готує новий пакет військової допомоги Україні, заявив прем'єр-міністр Александр Де Кроо.",
		"https://www.brusselstimes.com/489666/new-package-of-belgian-military-aid-for-ukraine-under-preparation"
	],
	[
		"2023-05-03",
		"The Department of Defense (DoD) has announced additional security assistance for Ukraine. It includes additional ammunition for U.S.-provided HIMARS, additional howitzers, artillery and mortar rounds, and anti-armor capabilities valued at up to $300 million.",
		"Міністерство оборони оголосило про додаткову безпекову допомогу Україні. Вона включає додаткові боєприпаси для HIMARS, додаткові гаубиці, артилерійські та мінометні снаряди, а також засоби протитанкової боротьби на суму до 300 мільйонів доларів.",
		"https://www.defense.gov/News/Releases/Release/Article/3383288/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-05-03",
		"Prime Minister Chris Hipkins: \"New Zealand is significantly extending its defence commitments as well as humanitarian, legal and economic support for Ukraine as part of the ongoing international response to Russia’s illegal war of aggression\". The newly announced support include instructors deployment in the EU and UK to train Ukrainian soldiers, $4 mln. for humanitarian purposes, $1.3 mln. for International Criminal Court support in ensuring legal accountability for crimes in Ukraine.",
		"Прем’єр-міністр Кріс Хіпкінс: «Нова Зеландія значно розширює свої зобов’язання щодо оборони, а також гуманітарної, юридичної та економічної підтримки України в рамках поточної міжнародної відповіді на незаконну агресивну війну Росії». Нещодавно оголошена підтримка включає направлення інструкторів до ЄС та Великій Британії для навчання українських військових, 4 мільйони доларів на гуманітарні цілі, 1,3 млн дол. на підтримку Міжнародного кримінального суду в забезпеченні юридичної відповідальності за злочини в Україні.",
		"https://www.miragenews.com/nz-boosts-aid-to-ukraine-998428/"
	],
	[
		"2023-05-03",
		"Hudson Institute experts have long argued that the United States should equip Kyiv with a range of weapons and equipment—some of which the Biden administration has thus far withheld. These include:\n\n- 155mm Dual-Purpose Improved Conventional Munitions (DPICM) \n- Maneuver Short Range Air Defense (M-SHORAD)\n- MQ-9 Reaper Drones and MQ-1C Gray Eagles\n- Advanced Surface-to-Air Missile (SAM) Systems\n- M1150 Assault Breacher Vehicle (ABV) \n- M198 Howitzer\n- MGM-140 Army Tactical Missile System (ATACMS)\n",
		" Експерти Гудзоновського інституту вже давно стверджують, що Сполучені Штати повинні надати Києву низку озброєнь та обладнання, деякі з яких адміністрація Байдена досі не надавала. До них відносяться\n\n- 155-мм вдосконалені звичайні боєприпаси подвійного призначення (DPICM) \n- Маневрений зенітно-ракетний комплекс малої дальності (M-SHORAD)\n- Безпілотники MQ-9 Reaper і MQ-1C Gray Eagles\n- Передові зенітно-ракетні комплекси\n- M1150 Assault Breacher Vehicle (ABV)\n- Гаубиця M198\n- MGM-140 Армійський тактичний ракетний комплекс (ATACMS)",
		"https://www.eurasiareview.com/03052023-what-ukraine-needs-for-its-counteroffensive-oped/"
	],
	[
		"2023-05-02",
		"Denmark announced 1.7 billion kroner ($250 million) worth of military aid to Ukraine “to support the forthcoming Ukrainian offensive,” its defence ministry said. The donation package included mine clearing vehicles, ammunition and financial support for the procurement of air defence.",
		"Міністерство оборони Данії оголосило про надання Україні військової допомоги на суму 1,7 мільярда крон (250 мільйонів доларів) «для підтримки майбутнього українського наступу». Пакет пожертвувань включав машини для розмінування, боєприпаси та фінансову підтримку для закупівлі ППО.",
		"https://punchng.com/denmark-pledges-250m-in-military-aid-to-ukraine/"
	],
	[
		"2023-05-01",
		"House Speaker Kevin McCarthy emphatically stressed his support for military aid to Ukraine on Monday, blistering Russia's “killing of the children” and distancing himself from some in his party who oppose additional major U.S. aid to stave off the Russian invasion.",
		"Спікер Палати представників Кевін Маккарті рішуче наголосив на своїй підтримці військової допомоги Україні, розкритикувавши «вбивство дітей» Росією та дистанціювавшись від деяких членів його партії, які виступають проти додаткової допомоги США для запобігання російському вторгненню.",
		"https://www.military.com/daily-news/2023/05/01/us-speaker-mccarthy-russia-must-pull-out-of-ukraine.html"
	],
	[
		"2023-04-30",
		"The Ukrainian government launched a new initiative meant to streamline and promote innovation in the development of drones and other technologies. As part of the initiative dubbed BRAVE1, the government hopes to bring state, military, and private sector developers working on defense issues together into a tech cluster that would give Ukraine a battlefield advantage.",
		"Український уряд запустив нову ініціативу, спрямовану на оптимізацію та просування інновацій у розробці безпілотників та інших технологій. У рамках ініціативи під назвою BRAVE1 уряд сподівається об’єднати державних, військових і приватних розробників, які займаються питаннями оборони, у технологічний кластер, який дасть Україні перевагу на полі бою.",
		"https://www.arkansasonline.com/news/2023/apr/30/ukraine-seeks-tech-innovation/"
	],
	[
		"2023-04-30",
		"London is looking for long-range missiles for Ukraine",
		"Лондон шукає для України ракети великої дальності",
		"https://www.gov.uk/guidance/international-fund-for-ukraine-ifu"
	],
	[
		"2023-04-28",
		"Ukrainian Defense Minister Oleksii Reznikov on Twitter: \"CAESARs from Denmark are in Ukraine! ... Denmark had intended to use these systems for its army, but wisely and nobly decided to transfer them to the Ukrainian Army due to the significant threat that Russian aggression against Ukraine poses to Europe as a whole.\"",
		"Міністр оборони України Олексій Резніков у Twitter: «CAESAR з Данії в Україні!... Данія мала намір використовувати ці системи для своєї армії, але мудро і благородно вирішила передати їх українській армії через значну загрозу російської агресії проти України для Європи в цілому».",
		"https://twitter.com/oleksiireznikov/status/1651970145462435840?s=20"
	]
]