[
	[
		"2025-05-03",
		"The U.S. State Department has approved a potential Foreign Military Sale (FMS) to Ukraine for F-16 Training and Sustainment and related support, with a total estimated value of $310.5 million.",
		"Державний департамент США схвалив потенційний зовнішній військовий продаж (ЗВП) Україні винищувачів F-16 та пов'язаної з ними підтримки загальною оціночною вартістю 310,5 млн. доларів США.",
		"https://armyrecognition.com/news/army-news/2025/exclusive-u-s-approves-f-16-fighter-jet-support-for-ukraine-as-early-images-suggest-spare-parts-delivery"
	],
	[
		"2025-05-01",
		"US says minerals deal will strengthen Trump in talks with Russia.",
		"США заявляють, що угода про мінеральні ресурси посилить Трампа в переговорах з Росією.",
		"https://www.reuters.com/world/europe/us-says-minerals-deal-will-strengthen-trump-talks-with-russia-2025-05-01/"
	],
	[
		"2025-05-01",
		"This year, Luxembourg will contribute 10 million euros to the Ukraine Energy Support Fund. The country will allocate the same amount to Ukraine's defense sector.",
		"Цього року Люксембург виділить 10 мільйонів євро до Фонду енергетичної підтримки України. Таку ж суму країна виділить на оборонний сектор України.",
		"https://newsukraine.rbc.ua/news/luxembourg-to-allocate-10-million-each-for-1746078387.html"
	],
	[
		"2025-05-01",
		"On Wednesday, the Trump administration informed Congress of its intention to green-light the export of defense-related products to Ukraine through direct commercial sales (DCS) of $50 million or more.",
		"У середу адміністрація Трампа поінформувала Конгрес про свій намір дати зелене світло експорту продукції оборонного призначення в Україну через прямі комерційні продажі (DCS) на суму від 50 мільйонів доларів.",
		"https://www.nationalreview.com/corner/hurrah-a-tiny-bit-of-new-u-s-defense-assistance-for-ukraine/"
	],
	[
		"2025-04-24",
		"The US will demand that Russia accept Ukraine’s right to develop its own, adequately equipped, army and defense industry as part of a peace agreement.",
		"США вимагатимуть від Росії визнати право України на розвиток власної, належним чином оснащеної армії та оборонної промисловості в рамках мирної угоди.",
		"https://www.bloomberg.com/news/articles/2025-04-24/us-to-demand-putin-accept-ukraine-s-right-to-military-force"
	],
	[
		"2025-04-24",
		"Europe is shifting from supplying weapons to Ukraine to funding its defense industries.",
		"Європа переходить від постачання зброї в Україну до фінансування її оборонної промисловості.",
		"https://www.businessinsider.com/europe-shifting-strategy-boost-ukraine-weapons-defense-production-russia-war-2025-4"
	],
	[
		"2025-04-24",
		"Denmark Allocates €42.5 Million Euros for Ammunition Purchases for Ukraine.",
		"Данія виділяє 42,5 млн євро на закупівлю боєприпасів для України.",
		"https://militarnyi.com/en/news/denmark-allocates-e42-5-million-euros-for-ammunition-purchases-for-ukraine/"
	],
	[
		"2025-04-24",
		"The National Association of Defense Industry of Ukraine (NAUDI) has signed a memorandum of cooperation with Agency Alan. The main activity of the Croatian company is the import and export of weapons and special military equipment for the needs of the Ministry of Defense and the Armed Forces of the Republic of Croatia.",
		"Данія виділяє 42,5 млн євро на закупівлю боєприпасів для УкраїниНаціональна асоціація оборонної промисловості України (НАУДІ) підписала меморандум про співпрацю з хорватською компанією «Агенція Алан». Основним видом діяльності хорватської компанії є імпорт та експорт озброєння та спеціальної військової техніки для потреб Міністерства оборони та Збройних сил Республіки Хорватія.",
		"https://militarnyi.com/en/news/ukraine-to-cooperate-with-croatian-arms-exporter-agency-alan/"
	],
	[
		"2025-04-21",
		"Japan’s Institute for Q-shu Pioneers of Space (iQPS), based at Kyushu University, will supply Ukraine with satellite images obtained via synthetic aperture radar (SAR) reconnaissance.",
		"Японський Інститут піонерів космосу Кюсю (iQPS), що базується в Університеті Кюсю, надаватиме Україні супутникові знімки, отримані за допомогою радіолокаційної розвідки з синтезованою апертурою (РЛС САР).",
		"https://militarnyi.com/en/news/japan-to-provide-satellite-imagery-to-ukrainian-intelligence-media/"
	],
	[
		"2025-04-20",
		"Ukraine shocks with call for 115 aircraft and $98B from Germany",
		"Україна шокувала запитом на 115 літаків і $98 млрд від Німеччини",
		"https://bulgarianmilitary.com/2025/04/20/ukraine-shocks-with-call-for-115-aircraft-and-98b-from-germany/"
	],
	[
		"2025-04-20",
		"The European Commission will allocate €2.1 billion in revenue from frozen Russian assets to military assistance for Ukraine. Of this amount, €1.1 billion will be used to purchase weapons for Ukraine, while €1 billion will be directed to Ukraine’s domestic defense industry under the so-called Danish model.",
		"Європейська комісія виділить 2,1 млрд євро доходів від заморожених російських активів на військову допомогу Україні. З цієї суми 1,1 млрд євро буде використано на закупівлю зброї для України, а 1 млрд євро буде спрямовано на вітчизняну оборонну промисловість за так званою данською моделлю.",
		"https://militarnyi.com/en/news/eu-allocates-e1-1b-for-arms-for-ukraine-and-e1b-for-ukrainian-defense-industry/"
	],
	[
		"2025-04-19",
		"Ukraine ramps up its artillery production with the help of direct EU investments. ",
		"Україна нарощує артилерійське виробництво за допомогою прямих інвестицій ЄС. ",
		"https://www.washingtonpost.com/world/2025/04/19/ukraine-bohdana-howitzer-european-military-funding/"
	],
	[
		"2025-04-19",
		"The Swedish Government has placed an order for 18 new ARCHER mobile howitzers from BAE Systems, as part of its 18th military support package to Ukraine.",
		"Уряд Швеції розмістив замовлення на 18 нових мобільних гаубиць ARCHER компанії BAE Systems в рамках 18-го пакету військової допомоги Україні.",
		"https://ukdefencejournal.org.uk/sweden-orders-18-archer-from-bae-in-ukraine-support-package/"
	],
	[
		"2025-04-19",
		"The United States will walk away from efforts to broker a Russia-Ukraine peace deal unless there are clear signs of progress soon, U.S. President Donald Trump and Secretary of State Marco Rubio said.",
		" Сполучені Штати припинять зусилля з посередництва у мирному врегулюванні між Росією та Україною, якщо найближчим часом не буде чітких ознак прогресу, заявили президент США Дональд Трамп і держсекретар Марко Рубіо.",
		"https://www.reuters.com/world/us-ready-abandon-efforts-broker-russia-ukraine-peace-deal-rubio-says-2025-04-18/"
	],
	[
		"2025-04-18",
		"Neither the White House, nor the US Congress are discussing any new military aid packages for Ukraine after resources approved by the Biden administration run out.",
		"Ані Білий дім, ані Конгрес США не обговорюють жодних нових пакетів військової допомоги Україні після того, як вичерпаються ресурси, затверджені адміністрацією Байдена.",
		"https://www.nytimes.com/2025/04/18/us/politics/trump-rubio-putin-ukraine.html"
	],
	[
		"2025-04-17",
		"Germany updated its list of military aid delivered to Ukraine, including self-propelling artillery, artillery and tank shells, armored vehicles, UAVs, and demining equipment.\n\n",
		"Німеччина оновила список військової допомоги, що надається Україні, включивши до нього самохідну артилерію, артилерійські та танкові снаряди, бронетехніку, безпілотні літальні апарати та обладнання для розмінування.\r",
		"https://www.bundesregierung.de/breg-en/news/military-support-ukraine-2054992"
	],
	[
		"2025-04-16",
		"An Economist/YouGov poll conducted on March 17 asked Americans whether they thought Russia and Ukraine were allies or enemies. Some 2% thought Russia was an ally, compared with 46% who saw it as an enemy. In the case of Ukraine, the figures were 26% ally and 4% enemy. Given these figures, Trump’s Russia-friendly policy looks unpopular.",
		"Опитування Economist/YouGov, проведене 17 березня, запитувало американців, чи вважають вони Росію та Україну союзниками чи ворогами. Близько 2% вважали Росію союзником, порівняно з 46%, які бачили в ній ворога. У випадку з Україною ці цифри становили 26% союзників і 4% ворогів. З огляду на ці цифри, дружня до Росії політика Трампа виглядає непопулярною.",
		"https://d3nkl3psvxxpe9.cloudfront.net/documents/econTabReport_ngfganU.pdf"
	],
	[
		"2025-04-12",
		"The UK has announced a further £450 million ($585 million) of military aid to Ukraine.",
		"Великобританія оголосила про виділення додаткової військової допомоги Україні у розмірі 450 мільйонів фунтів стерлінгів (585 мільйонів доларів).",
		"https://www.gdnonline.com/Details/1350154/Ukraine-to-receive-$580-million-of-UK-led-military-support"
	],
	[
		"2025-04-12",
		"Norway will provide €7 billion ($7.9 billion) in military aid to Ukraine in 2025.",
		"Норвегія надасть Україні 7 мільярдів євро (7,9 мільярда доларів) військової допомоги у 2025 році.",
		"https://wenewsenglish.pk/norway-has-pledged-7-9b-in-military-aid-ukrainian-defence-minister/"
	],
	[
		"2025-04-11",
		"During the meeting of the Ukraine Defense Contact Group (UDCG), allies announced the support for Kyiv amounting to more than 21 billion euros (23.85 billion dollars).",
		"Під час засідання Української оборонної контактної групи (UDCG) союзники оголосили про підтримку Києва на суму понад 21 мільярд євро (23,85 мільярда доларів).",
		"https://www.msn.com/en-ca/news/world/ukraine-to-receive-record-aid-from-ramstein-group-amount-announced/ar-AA1CKEqF?cvid=AB6D87FC2F1049419926A2C8EC5F0954&ocid=FUJITSUDHP"
	],
	[
		"2025-04-11",
		"Germany has pledged new deliveries of weapons systems to Ukraine.",
		"Німеччина пообіцяла нові поставки систем озброєння в Україну.",
		"https://www.dw.com/en/germany-announces-fresh-military-aid-to-ukraine/live-72212628"
	],
	[
		"2025-04-11",
		"Lithuania plans to allocate an additional 20 million euros for the purchase of ammunition for Ukraine.",
		"Литва планує виділити додатково 20 мільйонів євро на закупівлю боєприпасів для України.",
		"https://newsukraine.rbc.ua/news/lithuania-to-allocate-20-million-for-ammunition-1744380893.html"
	],
	[
		"2025-04-11",
		"Kyiv and its Western partners launched an electronic warfare coalition in support of Ukraine. The electronic warfare coalition consists of 11 countries and comes on top of other eight Western coalitions to support Ukraine. The new coalition will focus on purchasing equipment, training specialists, and developing electronic warfare policies and doctrines.",
		"Київ та його західні партнери створили коаліцію з радіоелектронної боротьби на підтримку України. Коаліція з радіоелектронної боротьби складається з 11 країн і приєдналася до інших восьми західних коаліцій на підтримку України. Нова коаліція зосередиться на закупівлі обладнання, підготовці фахівців та розробці політики і доктрин у сфері радіоелектронної боротьби.",
		"https://kyivindependent.com/electronic-warfare-coalition-for-ukraine-launched-in-brussels/"
	],
	[
		"2025-04-11",
		"Sweden orders 18 new Archer self-propelled howitzers from BAE Systems as part of largest military aid package to Ukraine.",
		"Швеція замовляє 18 нових самохідних гаубиць Archer у BAE Systems в рамках найбільшого пакету військової допомоги Україні.",
		"https://armyrecognition.com/news/army-news/2025/sweden-orders-18-new-archer-self-propelled-howitzers-from-bae-systems-as-part-of-largest-military-aid-package-to-ukraine"
	],
	[
		"2025-04-09",
		"Belgium has announced a new military aid package for Ukraine, valued at an estimated €1 billion.",
		"Бельгія оголосила про новий пакет військової допомоги Україні на суму близько 1 мільярда євро.",
		"https://news.az/news/belgium-announces-1b-military-aid-package-for-ukraine"
	],
	[
		"2025-04-08",
		"The United States' military will withdraw troops and equipment from Jasionka, a logistics hub in southeastern Poland that supplies most weapons being sent to Ukraine.",
		"Американські військові виведуть війська і техніку з Ясьонки, логістичного центру на південному сході Польщі, який постачає більшість озброєнь, що відправляються в Україну.",
		"https://www.politico.eu/article/us-pull-presence-key-ukraine-arms-aid-hub-poland-jasionka/"
	],
	[
		"2025-04-07",
		"Norway is providing 5 billion kroner for the purchase of artillery shells for Ukraine. Part of the funds will be allocated through the Czech initiative, and the rest through the mechanisms of the European Peace Facility.",
		"Норвегія виділяє 5 мільярдів крон на закупівлю артилерійських снарядів для України. Частина коштів буде виділена через чеську ініціативу, а решта - через механізми Європейського фонду миру.",
		"https://newsukraine.rbc.ua/news/norway-allocates-additional-5-billion-kroner-1744047194.html"
	]
]