[
	[
		"2024-07-13",
		"Away from Washington, Ukrainian President Volodymyr Zelensky sought to broaden support for U.S. military aid speaking to state governors.",
		"Далеко від Вашингтона президент України Володимир Зеленський намагався розширити підтримку військової допомоги США, виступаючи перед губернаторами штатів.",
		"https://www.latimes.com/world-nation/story/2024-07-13/after-embrace-at-nato-summit-zelensky-takes-his-case-for-us-military-aid-to-governors"
	],
	[
		"2024-07-13",
		"Australia announced its largest ever military aid package for Ukraine, committing $250 million to bolster Ukraune defense.",
		"Австралія оголосила про надання найбільшого в історії пакету військової допомоги Україні, виділивши 250 мільйонів доларів на зміцнення обороноздатності України.",
		"https://ilkha.com/english/world/australia-pledges-record-military-aid-to-ukraine-at-nato-summit-404492"
	],
	[
		"2024-07-13",
		"At this week's summit in Washington, NATO members agreed to provide at least €40 billion a year in military aid to Ukraine to repel Russian aggression. Estonia however, has pledged three times the amount agreed upon to continue supporting Ukraine.",
		"На саміті у Вашингтоні цього тижня члени НАТО домовилися надавати Україні щонайменше 40 мільярдів євро на рік у вигляді військової допомоги для відбиття російської агресії. Естонія, однак, пообіцяла втричі більшу суму, щоб продовжувати підтримувати Україну.",
		"https://news.err.ee/1609396207/estonia-contributes-three-times-more-than-agreed-in-nato-to-support-ukraine"
	],
	[
		"2024-07-13",
		"Argentinian Defence Minister Luis Alfonso Petri said neutrality is no longer a real option in the current situation. Therefore, the Argentine government, which previously seemed not to interfere in the situation in Europe, is changing its stance and announcing its readiness to transfer valuable equipment to Ukraine. The list includes Mi-171E transport helicopters, which were once purchased from the Russians, as well as ammunition for light weapons and 155 mm artillery.",
		"Міністр оборони Аргентини Луїс Альфонсо Петрі заявив, що нейтралітет більше не є реальним варіантом у нинішній ситуації. Тому аргентинський уряд, який раніше, здавалося, не втручався в ситуацію в Європі, змінює свою позицію і заявляє про готовність передати Україні цінну техніку. У списку - транспортні вертольоти Мі-171Е, які свого часу були придбані у росіян, а також боєприпаси для легкого озброєння і 155-мм артилерії.",
		"https://www.msn.com/en-gb/news/world/argentina-shifts-stance-may-send-military-aid-to-ukraine/ar-BB1pS2VP"
	],
	[
		"2024-07-12",
		"NATO is helping Ukraine to fight—but not to win. The Washington summit was heavy on promises but light on plans.",
		"НАТО допомагає Україні боротися, але не перемагати. Вашингтонський саміт був багатий на обіцянки, але бідний на плани.",
		"https://foreignpolicy.com/2024/07/12/nato-summit-ukraine-russia-military-war/"
	],
	[
		"2024-07-12",
		"The Biden Administration has announced the 61st presidential drawdown authority package, which has an estimated value of $225 million. This package includes one Patriot battery, munitions for rocket systems, and artillery and antitank weapons.",
		"Адміністрація Байдена оголосила про 61-й пакет президентських повноважень щодо скорочення озброєнь, який оцінюється у 225 мільйонів доларів. Цей пакет включає одну батарею \"Патріотів\", боєприпаси для ракетних систем, а також артилерійське і протитанкове озброєння.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3837709/us-announces-latest-security-package-for-ukraine/"
	],
	[
		"2024-07-12",
		"Canada has announced the allocation of CAD 389 million (more than US$280 million) for training Ukrainian pilots on F-16 fighters.",
		"Канада оголосила про виділення 389 мільйонів канадських доларів (понад 280 мільйонів доларів США) на навчання українських пілотів на винищувачах F-16.",
		"https://www.pravda.com.ua/eng/news/2024/07/12/7465305/"
	],
	[
		"2024-07-11",
		"Portugal will allocate €220 million in military aid to Ukraine in 2025.",
		"Португалія виділить 220 мільйонів євро військової допомоги Україні у 2025 році.",
		"https://mil.in.ua/en/news/portugal-to-allocate-e220-million-in-military-aid-to-ukraine-in-2025/"
	],
	[
		"2024-07-11",
		"Lithuania has handed Ukraine ammunition, antidrons and folding cribes",
		"Литва передала Україні боєприпаси, протиракети та розкладні ліжечка",
		"https://kam.lt/lietuva-ukrainai-perdave-soviniu-antidronu-ir-sulankstomu-lovyciu/"
	],
	[
		"2024-07-08",
		"UK Defense Secretary John Healey announced a new military aid package for Ukraine. The package will include “more artillery guns, a quarter of a million ammunition rounds and nearly 100 precision Brimstone missiles,” according to a government statement.",
		"Міністр оборони Великої Британії Джон Хілі оголосив про новий пакет військової допомоги Україні. Пакет включатиме \"більше артилерійських гармат, чверть мільйона боєприпасів і майже 100 високоточних ракет \"Брімстоун\"\", - йдеться у заяві уряду.",
		"https://www.aa.com.tr/en/europe/uk-announces-new-military-aid-package-for-ukraine/3268904"
	],
	[
		"2024-07-07",
		"London's support for Kiev during the conflict with Moscow will remain at the same level under his leadership, the new Prime Minister of Britain Keir Starmer has told Vladimir Zelensky.",
		"Підтримка Лондоном Києва під час конфлікту з Москвою залишиться на тому ж рівні і під його керівництвом, заявив Володимиру Зеленському новий прем'єр-міністр Великої Британії Кейр Стармер.",
		"https://www.bignewsnetwork.com/news/274445701/new-british-pm-assures-ukraine-of-unshakable-support"
	],
	[
		"2024-07-06",
		"Mistral short-range air defence systems and missiles provided by Estonia have been delivered to Ukraine.",
		"В Україну доставлені зенітно-ракетні комплекси малої дальності \"Містраль\" та ракети, надані Естонією.",
		"https://x.com/MoD_Estonia/status/1809517536356024405"
	],
	[
		"2024-07-06",
		"Hungarian Prime Minister Viktor Orban continues to posture himself as a potential mediator to end the war in Ukraine despite Russian President Vladimir Putin's rejection of mediation or serious negotiations. Orban is likely aiming to shift Western focus towards possible peace negotiations as part of his overarching effort to undermine European support for Ukraine.",
		"Прем'єр-міністр Угорщини Віктор Орбан продовжує позиціонувати себе як потенційного посередника для припинення війни в Україні, незважаючи на те, що президент Росії Володимир Путін відкидає посередництво або серйозні переговори. Орбан, ймовірно, прагне переключити увагу Заходу на можливі мирні переговори як частину своїх загальних зусиль, спрямованих на підрив європейської підтримки України",
		"https://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-july-6-2024"
	],
	[
		"2024-07-06",
		"New defence secretary John Healey announced a fresh British military aid package for Ukraine. Britain will supply a quarter of a million large, 50 calibre rounds of ammunition, 10 of its AS-90 artillery guns, which have a theoretical range of up to 25km, and 90 Brimstone ground-attack, anti-tank missiles from its own stocks.",
		"Новий міністр оборони Джон Хілі оголосив про новий пакет британської військової допомоги Україні. Британія надасть чверть мільйона великих боєприпасів 50-го калібру, 10 своїх артилерійських гармат AS-90, які мають теоретичну дальність стрільби до 25 км, а також 90 протитанкових ракет Brimstone зі своїх запасів.",
		"https://www.theguardian.com/politics/live/2024/jul/07/keir-starmer-labour-uk-general-election-scotland-wales-northern-ireland-visit-latest-news?page=with:block-668abb3c8f08a83a9aece4f1"
	],
	[
		"2024-07-05",
		"Marine Le Pen vowed a prime minister from her party would prevent Kyiv using French-supplied long-range weapons to strike inside Russia and would stymie French President Emmanuel Macron’s suggestion he might put French boots on Ukrainian soil.",
		"Марін Ле Пен, лідер французької ультраправої партії \"Національне об'єднання\" (RN), пообіцяла, що прем'єр-міністр від її партії не дозволить Києву використовувати французьку зброю дальньої дії для нанесення ударів по Росії і не допустить припущення президента Франції Еммануеля Макрона про те, що він може поставити французькі чоботи на українську землю.",
		"https://edition.cnn.com/2024/07/05/europe/france-le-pen-ukraine-mbappe-intl-cmd/index.html"
	],
	[
		"2024-07-05",
		"The Ministry of Defense of Latvia informs that the supply of the next drone package to the Ukrainian Armed Forces will be gradually carried out in July as part of the drone coalition. More than 2,500 different types and performance combat drones worth € 4 million will be delivered to Ukraine. The first shipment of the apious package – 300 drones will be delivered in the coming days.",
		"Міністерство оборони Латвії повідомляє, що поставка чергового пакету безпілотників Збройним силам України буде поступово здійснюватися в липні в рамках безпілотної коаліції. В Україну буде поставлено понад 2500 бойових безпілотників різних типів і характеристик на загальну суму 4 мільйони євро. Перша партія з цього пакету - 300 безпілотників - буде доставлена найближчими днями.",
		"https://www.mod.gov.lv/lv/zinas/aizsardzibas-ministrija-ukrainai-piegadas-nakamo-dronu-pakotni-vairak-neka-2500-dronus-4"
	],
	[
		"2024-06-30",
		"Ukrainian President Volodymyr Zelensky has renewed his appeal for more long-range weapons and air defences.",
		"Президент України Володимир Зеленський поновив свій заклик про надання більшої кількості озброєнь дальньої дії та засобів протиповітряної оборони",
		"https://www.bbc.com/news/articles/c7281yly9n4o"
	],
	[
		"2024-06-29",
		"Ukraine is determined to achieve guarantees on military aid at NATO summit in July.",
		"Україна сповнена рішучості домогтися гарантій щодо військової допомоги на саміті НАТО в липні.",
		"https://uatv.ua/en/ukraine-is-determined-to-achieve-guarantees-on-military-aid-at-nato-summit-in-july/"
	],
	[
		"2024-06-29",
		"The Biden administration will provide Ukraine with $150 million worth of weapons and ammunition, including HAWK air defense interceptors and 155-millimeter artillery munitions, two US officials said on Friday. The weapons aid package is expected to be unveiled on Monday.",
		"Адміністрація Байдена надасть Україні зброю та боєприпаси на суму 150 мільйонів доларів, у тому числі ракети-перехоплювачі HAWK та артилерійські боєприпаси калібру 155 міліметрів, заявили у п’ятницю двоє американських чиновників. Очікується, що пакет допомоги у сфері зброї буде оприлюднено в понеділок.",
		"https://menafn.com/1108389090/US-To-Send-Ukraine-Air-Defense-Missiles-In-Next-Aid-Package-Officials"
	],
	[
		"2024-06-29",
		"Ukrainian Prime Minister Denys Shmyhal said on Friday that military pledges outlined in 20 security agreements Kyiv has signed with its partners total $60 billion annually for the next four years.",
		"Прем'єр-міністр України Денис Шмигаль заявив у п'ятницю, що військові зобов'язання, викладені в 20 угодах у сфері безпеки, які Київ підписав зі своїми партнерами, становлять 60 мільярдів доларів щорічно протягом наступних чотирьох років.",
		"https://www.msn.com/en-gb/news/world/annual-allied-military-aid-60-billion-for-next-four-years-says-ukraine-pm/ar-BB1p3Xn4"
	],
	[
		"2024-06-28",
		"Finland is sending its 24th military aid package to Ukraine, the Ministry of Defence announced on Friday.  The value of the latest aid package is around 159 million euros, bringing Finland's overall support to Ukraine to 2.2 billion euros.",
		"Фінляндія надсилає Україні 24-й пакет військової допомоги, повідомило в п'ятницю Міністерство оборони.  Вартість останнього пакету допомоги становить близько 159 мільйонів євро, що збільшує загальну підтримку України з боку Фінляндії до 2,2 мільярдів євро.",
		"https://yle.fi/a/74-20096915"
	],
	[
		"2024-06-28",
		"DMG Mori, a worldwide leader of cutting machine tools, supplied equipment to Russia that was used in weapons production despite the official ban.",
		"DMG Mori, світовий лідер у виробництві металорізальних верстатів, постачав до Росії обладнання, яке використовувалося у виробництві зброї, незважаючи на офіційну заборону.",
		"https://mil.in.ua/en/news/german-japanese-machine-tool-manufacturer-supplied-weapons-production-equipment-to-russia-despite-official-ban/"
	],
	[
		"2024-06-27",
		"Lithuania will help Ukraine in reforming the military education system.",
		"Литва допоможе Україні у реформуванні системи військової освіти.",
		"https://mil.in.ua/en/news/lithuania-to-help-ukraine-reform-military-education/"
	],
	[
		"2024-06-26",
		"Slovak president Pellegrini during his visit to Czech Republic: \"Slovakia has boosted production in its factories, where ammunition of the required calibres is produced or refurbished.\" He added that a significant portion of the ammunition to be provided to Ukraine based on the Czech initiative will be refurbished in Slovak production plants.",
		"Президент Словаччини Пеллегріні під час свого візиту до Чехії: \"Словаччина збільшила виробництво на своїх заводах, де виробляються або переробляються боєприпаси необхідних калібрів\". Він додав, що значна частина боєприпасів, які будуть надані Україні за чеською ініціативою, буде перероблена на словацьких заводах.",
		"https://www.tasr.sk/tasr-clanok/TASR:2024062600000325"
	],
	[
		"2024-06-26",
		"The Ministry of Defense of Ukraine has authorized the use of Italian Puma armored personnel carriers in the army. Presumably, the batch of Puma APCs was included in one of the classified defense aid packages to Ukraine from the Italian government.",
		"Міністерство оборони України дозволило використовувати в армії італійські бронетранспортери Puma. Імовірно, партія бронетранспортерів Puma була включена в один із засекречених пакетів оборонної допомоги Україні від італійського уряду.",
		"https://mil.in.ua/en/news/armed-forces-of-ukraine-receive-italian-puma-apcs/"
	],
	[
		"2024-06-26",
		"The second batch of Patriot anti-aircraft missiles long-range sent by Spain arrived in Ukraine. Shipping includes, in addition to the Patriots, a second round of Leopard battle tanks, ammunition of various kinds, including 155mm artillery, systems for surveillance and remote weapon turrets.",
		"В Україну прибула друга партія зенітних ракетних комплексів великої дальності Patriot, надісланих Іспанією. До складу вантажу, окрім \"Патріотів\", входить друга партія бойових танків \"Леопард\", боєприпаси різного типу, в тому числі 155-мм артилерійські, системи спостереження та дистанційного керування вогневими установками.",
		"https://www.elmundo.es/internacional/2024/06/24/6679978afdddfff76f8b457d.html"
	],
	[
		"2024-06-26",
		"Serbian Prime Minister Miloš Vučević has called for the continuation of the sale of Serbian ammunition to third countries.",
		"Прем'єр-міністр Сербії Мілош Вучевич закликав продовжити продаж сербських боєприпасів третім країнам.",
		"https://mil.in.ua/en/news/serbia-opposes-restrictions-on-the-sale-of-ammunition-to-third-countries/"
	],
	[
		"2024-06-25",
		"The first shipment of ammunition from Czech initiative arrived in Ukraine. ",
		"В Україну прибула перша партія боєприпасів від чеської ініціативи. ",
		"https://x.com/P_Fiala/status/1805533506501529605"
	],
	[
		"2024-06-24",
		"EU foreign ministers approved 1.4 billion euros (1.5 billion dollars) in military aid for Ukraine, with the package to be financed for the first time by proceeds from frozen Russian Central Bank assets.",
		"Міністри закордонних справ ЄС схвалили 1,4 мільярда євро (1,5 мільярда доларів) військової допомоги Україні, причому цей пакет вперше фінансуватиметься за рахунок надходжень із заморожених активів Центрального банку Росії.",
		"https://www.vanguardngr.com/2024/06/eu-ministers-approve-e1-4bn-ukraine-military-aid-using-russia-assets/"
	],
	[
		"2024-06-23",
		"The president of Slovenia, Natasha Pirc Musar, announced that she will visit the Ukrainian capital, Kyiv, in Thursday, June 27. There she will sign a bilateral agreement between Slovenia and Ukraine in the field of security.",
		"Президент Словенії Наташа Пірц Мусар оголосила, що в четвер, 27 червня, відвідає українську столицю Київ. Там вона підпише двосторонню угоду між Словенією та Україною у сфері безпеки.",
		"https://fakti.bg/en/world/891104-on-thursday-natasha-pirc-musar-the-president-of-slovenia-will-visit-ukraine"
	],
	[
		"2024-06-22",
		"Netherlands and another country intend to jointly hand over to Ukraine another \"Patriot\" air defense system, after Romania made a similar decision this week. This was announced by the Dutch Minister of Defense Kaisa Olongren.",
		"Нідерланди та ще одна країна мають намір спільно передати Україні ще один зенітно-ракетний комплекс \"Патріот\" після того, як цього тижня аналогічне рішення прийняла Румунія. Про це повідомила міністр оборони Нідерландів Кайса Олонгрен.",
		"https://fakti.bg/en/world/890791-ukraine-receives-another-patriot-air-defense-system-from-the-west"
	],
	[
		"2024-06-22",
		"The defense industries of Ukraine and Romania signed a memorandum in Paris. The National Association of Ukrainian Defense Industries (NAUDI) reported that the memorandum with the PATROMIL association provided for the maintenance of equipment and the production of ammunition.",
		"Оборонні підприємства України та Румунії підписали меморандум у Парижі. У Національній асоціації оборонної промисловості України (НАУДІ) повідомили, що меморандум з асоціацією PATROMIL передбачає технічне обслуговування техніки та виробництво боєприпасів.",
		"https://mil.in.ua/en/news/ukraine-to-cooperate-with-the-romanian-business-association-of-the-military-technique-manufacturers/"
	]
]