[
	[
		"2023-06-08",
		"U.S. lawmakers on both sides of the aisle are making a renewed push for the Biden administration to send Ukraine controversial long-range munitions",
		"Американські законодавці з обох політичних сторін знову наполягають на тому, щоб адміністрація Байдена надіслала Україні суперечливі боєприпаси великої дальності.",
		"https://www.politico.com/news/2023/06/08/congress-biden-administration-long-range-weapons-ukraine-00100938"
	],
	[
		"2023-06-06",
		"Australia, the US and Ukraine are discussing sending 41 Royal Australian Air Force F/A-18 Hornets to Kyiv helping fulfil part of President Volodymyr Zelensky’s request for fighter jets, rather than sending them to the scrapheap as planned.",
		"Австралія, США та Україна обговорюють відправку 41 F/A-18 Hornets королівських ВПС Австралії до Києва, щоб допомогти виконати частину запиту президента Володимира Зеленського щодо винищувачів, а не відправляти їх на звалище, як планувалося.",
		"https://www.afr.com/politics/federal/retired-raaf-fighter-jets-could-be-sent-to-ukraine-20230605-p5de0h"
	],
	[
		"2023-06-05",
		"A leaked document shows Iran sold ammunition to Russia for its war in Ukraine.",
		"Оприлюднений документ показує, що Іран продавав Росії боєприпаси для війни в Україні.",
		"https://news.sky.com/story/arms-contract-shows-iran-has-sold-russia-ammunition-for-ukraine-war-says-security-source-12896127"
	],
	[
		"2023-06-02",
		"‘Real Peace’ for Ukraine requires more military support, Blinken says.",
		"«Справжній мир» для України вимагає більшої військової підтримки, каже Блінкен.",
		"https://www.wsj.com/articles/real-peace-for-ukraine-requires-more-military-support-blinken-says-ac1d637e"
	],
	[
		"2023-06-02",
		"China’s envoy Li Hui says in order to achieve peace, Kyiv’s allies must ‘stop sending weapons to the battlefield’.",
		"Посол Китаю Лі Хуей каже, що для досягнення миру союзники Києва повинні «припинити посилати зброю на поле бою».",
		"https://www.aljazeera.com/news/2023/6/2/stop-sending-weapons-hold-talks-to-end-russia-ukraine-war"
	],
	[
		"2023-06-02",
		"The United States is seeking to secure supplies of TNT in Japan for 155mm artillery shells. Tokyo, which hosted US Secretary of Defense Lloyd Austin this week, has told the US government it will allow the sale of industrial TNT because the explosive is not a military-use-only product, according to AlJazeera sources.",
		"Сполучені Штати прагнуть забезпечити постачання тротилу з Японії для 155-мм артилерійських снарядів. Згідно з інформацією AlJazeera, Токіо, який цього тижня приймав міністра оборони США Ллойда Остіна, повідомив уряду США, що дозволить продаж промислового тротилу, оскільки вибухівка не призначена виключно для військових цілей.",
		"https://www.aljazeera.com/news/2023/6/2/us-seeking-tnt-in-japan-for-ukraine-artillery-shells-report"
	],
	[
		"2023-06-02",
		"Defense Minister of Estonia Hanno Pevkur said that his country has arms to donate to Ukraine in the future, but the quantity and varieties are not yet known. Much will depend on Ukraine's summer progress and autumn needs.",
		"Міністр оборони Естонії Ханно Певкур заявив, що його країна може передати Україні зброю в майбутньому, але кількість і сорти поки невідомі. Багато залежатиме від літнього прогресу України та осінніх потреб.",
		"https://news.err.ee/1608996634/estonia-s-arms-aid-depends-on-ukraine-s-needs-in-the-fall"
	],
	[
		"2023-06-01",
		"NATO foreign ministers met in Oslo. One of the key issues under discussion was the subject of Ukrainian accession to the Alliance.",
		"Міністри закордонних справ НАТО зустрілися в Осло. Одним із ключових питань обговорення стала тема вступу України до Альянсу.",
		"https://www.reuters.com/world/nato-squabbles-over-speedy-accession-ukraine-decisive-summit-looms-2023-06-01/"
	],
	[
		"2023-06-01",
		"The U.S. Army has awarded a Florida-based company a contract worth just over $118 million to supply additional German-made Gepard self-propelled 35mm anti-aircraft guns to the Ukrainian military. The Gepards in question look to be ex-Dutch variants that were then sold to Jordan around a decade ago.",
		"Армія США уклала контракт із компанією зі штату Флорида на суму трохи більше 118 мільйонів доларів США на поставку Україні додаткових зенітних установок Gepard німецького виробництва.",
		"https://www.thedrive.com/the-war-zone/u-s-getting-more-gepard-air-defense-vehicles-for-ukraine-from-jordan"
	],
	[
		"2023-05-31",
		"The Defense Department announced the 39th PDA security assistance package for Ukraine valued at up to $300 million:\n\n- Additional munitions for Patriot air defense systems\n- AIM-7 missiles for air defense\n- Avenger air defense systems\n- Stinger anti-aircraft systems\n- Additional ammunition for High Mobility Artillery Rocket Systems (HIMARS)\n- 155mm and 105mm artillery rounds\n- 105mm tank ammunition\n- Precision aerial munitions\n- Zuni aircraft rockets\n- Munitions for Unmanned Aerial Systems\n- AT-4 anti-armor systems\n- Over 30 million rounds of small arms ammunition\n- Mine clearing equipment and systems\n- Demolition munitions for obstacle clearing\n- Night vision devices\n- Spare parts, generators, and other field equipment",
		"Міністерство оборони США оголосило про 39-й пакет допомоги по фонду PDA для України на суму до 300 мільйонів доларів:\r\n\r\n- Додаткові боєприпаси для ЗРК Patriot\r\n- ракети ППО AIM-7\r\n- системи ППО Avenger\r\n- Зенітні комплекси Stinger\r\n- Додаткові боєприпаси для HIMARS\r\n- артилерійські снаряди калібру 155 і 105 мм\r\n- танкові боєприпаси калібру 105 мм\r\n- Високоточні авіаційні боєприпаси\r\n- Авіаційні ракети Zuni\r\n- Боєприпаси для безпілотних літальних систем\r\n- протитанкові системи АТ-4\r\n- Понад 30 мільйонів патронів до стрілецької зброї\r\n- Обладнання та системи для розмінування\r\n- Підривні боєприпаси для прибирання перешкод\r\n- Прилади нічного бачення\r\n- Запчастини, генератори та інше польове обладнання",
		"https://www.defense.gov/News/News-Stories/Article/Article/3412397/dod-announces-new-security-assistance-package-for-ukraine/"
	],
	[
		"2023-05-30",
		"Danish prime minister said that contributions to the Ukraine Fund must be increased by DKK 7.5 billion ($1.08 bln) this year and another DKK 10.4 billion ($1.49 bln.) in 2024.",
		"Прем'єр-міністр Данії заявив, що внески в Український фонд повинні бути збільшені на 7,5 млрд датських крон ($1,08 млрд) цього року і ще на 10,4 млрд датських крон ($1,49 млрд) у 2024 році.",
		"https://www.dr.dk/nyheder/politik/regeringen-vil-poste-nye-milliarder-i-hjaelpefond-til-ukraine-krigen-er-paa-et-meget"
	],
	[
		"2023-05-30",
		"Germany boosts Ukraine's drone fleet with additional delivery of 54 Vector UAVs",
		"Німеччина розширює парк безпілотників України додатковою поставкою 54 БПЛА Vector",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/germany_boosts_ukraine_s_drone_fleet_with_additional_delivery_of_54_vector_uavs.amp.html"
	],
	[
		"2023-05-29",
		"Ukrainian defense minister Oleksiy Reznikov appealed to Australia to join the “tank coalition” and provide Hawkei vehicles.",
		"Міністр оборони України Олексій Резніков звернувся до Австралії з проханням приєднатися до «танкової коаліції» і надати машини Hawkei.",
		"https://euromaidanpress.com/2023/05/29/ukrainian-defense-minister-appealed-to-australia-to-join-the-tank-coalition-and-provide-hawkei-vehicles/"
	],
	[
		"2023-05-29",
		"Italy is preparting a new decree for the 7th package shipment of armaments to Ukraine. This is the second one under Meloni government, just over four months after the first. The defense minister, Guido Crosetto is expected in a hearing for the provision, the content of which is classified.",
		"Італія готує новий указ щодо сьомого пакету вантажів озброєння в Україну. Очікується, що міністр оборони Гвідо Кросетто прийме участь у слуханнях щодо цієї доставки, зміст якої засекречено.",
		"https://www.ilmessaggero.it/mondo/guerra_ucraina_russia_diretta_oggi_29_maggio-7430369.html"
	],
	[
		"2023-05-26",
		"Lindsey Graham, a Republican, said after meeting President Volodymyr Zelensky that US President Joe Biden should send more weapons to Ukraine in addition to the more than $35 billion of weaponry and military hardware already provided. \"There can be no backing off of helping Ukraine because if we fail here, there goes Taiwan,\" Graham told reporters.",
		"Ліндсі Грем, республіканець, після зустрічі з президентом Володимиром Зеленським заявив, що президент США Джо Байден повинен надіслати Україні більше зброї на додаток до вже наданої зброї та військової техніки на понад 35 мільярдів доларів. «Не можна відмовлятися від допомоги Україні, тому що якщо ми тут зазнаємо невдачі, Тайвань піде», — сказав Грем журналістам.",
		"https://www.jpost.com/international/article-744314"
	],
	[
		"2023-05-25",
		"The United States plans to announce up to $300 million worth of military aid for Ukraine comprised mainly of ammunition.",
		"Сполучені Штати планують оголосити про надання Україні військової допомоги на суму до 300 мільйонів доларів, яка складатиметься переважно з боєприпасів.",
		"https://www.reuters.com/world/europe/us-announce-more-military-aid-ukraine-mainly-ammunition-sources-2023-05-25/"
	],
	[
		"2023-05-25",
		"The Pentagon continues to work its way through an accounting error that overstated the value of past aid, an error that may lead the way for more weapons being sent to Ukraine.",
		"Пентагон продовжує намагатися виправити облікову помилку, яка завищила вартість минулої допомоги, помилка, яка може відкрити можливість надсилання нових озброєнь в Україну.",
		"https://www.reuters.com/world/europe/us-announce-more-military-aid-ukraine-mainly-ammunition-sources-2023-05-25/"
	],
	[
		"2023-05-25",
		"The members of the Ukraine Defense Contact Group, which meets in Germany’s Ramstein Air Base, pledged to provide $65 billion of military aid to Ukraine,",
		"Члени Контактної групи з питань оборони України, яка збирається на німецькій авіабазі Рамштайн, пообіцяли надати Україні військову допомогу на суму 65 мільярдів доларів.",
		"https://www.defense.gov/News/Speeches/Speech/Article/3407082/opening-remarks-by-secretary-of-defense-lloyd-j-austin-iii-at-the-12th-ukraine/"
	],
	[
		"2023-05-25",
		"Lithuania's next package of assistance announced at Ramstein meeting would provide to Ukraine drone jamming equipment, ammunition, military rations, and other types of assistance.",
		"Наступний пакет допомоги Литви, оголошений на зустрічі в Рамштайні, передбачатиме надання Україні обладнання для постановки перешкод безпілотникам, амуніції, пайків та інших видів допомоги.",
		"https://kam.lt/en/lithuania-announces-its-next-package-of-support-to-ukraine-at-the-ramstein-format-meeting/"
	],
	[
		"2023-05-25",
		"Anita Anand, Minister of National Defence of Canada and General Wayne Eyre, Chief of the Defence Staff, participated via video link in the twelfth Ukraine Defense Contact Group (UDCG) meeting. During the meeting Canada announced additional assistance to Ukraine: new military trainers for military medics and officers in Poland to train Ukrainians and 43 AIM-9 Sidewinder missiles. Delivery of small arms and ammunition pledged in April is in progress and will be in Ukraine \"by the summer\".",
		"Аніта Ананд, Міністр національної оборони Канади та генерал Уейн Ейр, Начальник штабу оборони Канади, взяли участь через відеозв’язок у дванадцятому засіданні Контактної групи з питань оборони України (UDCG). Під час зустрічі Канада оголосила про додаткову допомогу Україні: нові військові тренажери для військових медиків і офіцерів у Польщі для навчання українців та 43 ракети AIM-9 Sidewinder. Заявлена у квітні поставка стрілецької зброї та боєприпасів триває і буде в Україні «до літа».",
		"https://www.canada.ca/en/department-national-defence/news/2023/05/defence-minister-anita-anand-announces-military-aid-for-ukraine-at-the-twelfth-meeting-of-the-ukraine-defense-contact-group.html"
	],
	[
		"2023-05-25",
		"Sweden’s defense minister says the Nordic country is considering whether to let Ukrainian pilots test its JAS 39 Gripen fighter jets.",
		"Міністр оборони Швеції каже, що скандинавська країна розглядає можливість дозволити українським пілотам випробувати свої винищувачі JAS 39 Gripen.",
		"https://apnews.com/article/ukraine-sweden-gripen-fighter-jets-war-pilots-bfca7aceedd0d7bbd11fab7f8ca4708a"
	],
	[
		"2023-05-24",
		"Germany’s request to buy 25 mothballed Swiss Leopard 2 tanks, intended to make up for stocks it’s sending to Ukraine, won the support of Switzerland’s government.",
		"Заявка Німеччини на купівлю 25 законсервованих швейцарських танків Leopard 2 для компенсації запасів, які вона відправляє в Україну, отримала підтримку уряду Швейцарії.",
		"https://www.bloomberg.com/news/articles/2023-05-24/swiss-back-sale-of-25-tanks-to-germany-to-support-ukraine-effort"
	],
	[
		"2023-05-24",
		"Finland said it would provide Ukraine with 109 million euros ($117 million) in additional military equipment to include anti-aircraft weapons and ammunition. The details of the aid would not be disclosed “for operational reasons and in order to ensure the safe delivery of assistance.” The Finland's total military assistance to Ukraine will become 1.1 billion euros ($1.2 billion). ",
		"Фінляндія заявила, що надасть Україні 109 мільйонів євро додаткового військового обладнання, включаючи зенітну зброю та боєприпаси. Деталі допомоги не розголошуються «з оперативних причин і для забезпечення безпечної доставки допомоги». Загальна військова допомога Фінляндії Україні становитиме 1,1 млрд євро ($1,2 млрд).",
		"https://www.rferl.org/a/finland-ukraine-military-aid-russia-invasion/32427777.html"
	],
	[
		"2023-05-23",
		"Germany has significantly increased their list of military help to Ukraine in planning or execution phase. It includes \n\n- 110 Leopard 1 tanks\n- 20 Marder IFVs\n- 4 IRIS-T air defense systems with 12 launchers\n- 18 self-propelled anti-air GEPARD guns\n- anti-air rockets and ammunition\n- a variety of reconnaissance, military engineer and transport systems\n- artillery and tank shells\n- small arms, equipment and munitions",
		"Німеччина значно розширила перелік військової допомоги Україні на етапі планування або виконання. Він включає \n\n- 110 танків Leopard 1\n- 20 БМП Marder\n- 4 системи ППО IRIS-T з 12 пусковими установками\n- 18 самохідних зенітних установок GEPARD\n- зенітні ракети та боєприпаси\n- різноманітні розвідувальні, військово-інженерні та транспортні системи\n- артилерійські і танкові снаряди\n- стрілецьку зброю, спорядження та боєприпаси",
		"https://www.bundesregierung.de/breg-en/news/military-support-ukraine-2054992"
	],
	[
		"2023-05-23",
		"German Defense Minister Boris Pistorius criticized Hungary for blocking further military aid to Ukraine at a meeting of EU defense ministers in Brussels on May 23. Pistorius said he was \"somewhat disappointed or irritated by the behavior of Hungarian friends\" for blocking the aid. The move comes after Ukraine included Hungary's largest bank OTP in a list of supporters of Russia's invasion, prompting outrage from Budapest. A Hungarian government spokesman said Hungary would reject new military aid unless the OTP bank was removed from the list.",
		"Міністр оборони Німеччини Борис Пісторіус розкритикував Угорщину за блокування подальшої військової допомоги Україні на зустрічі міністрів оборони ЄС у Брюсселі 23 травня. Пісторіус сказав, що він \"дещо розчарований або роздратований поведінкою угорських друзів\" через блокування допомоги. Цей крок стався після того, як Україна включила найбільший банк Угорщини OTP до списку прихильників вторгнення Росії, що викликало обурення Будапешта. Речник угорського уряду заявив, що Угорщина відмовиться від нової військової допомоги, якщо банк OTP не буде вилучено зі списку.",
		"https://www.rferl.org/a/german-minister-slam-hungarian-blockade-eu-military-aid/32424499.html"
	],
	[
		"2023-05-23",
		"The Europe-based unit of the US Army in charge of shipping weapons to Ukraine has sped up deliveries by 30 percent compared to the start of Russia’s full-scale invasion.",
		"Базований у Європі підрозділ армії США, який відповідає за доставку зброї в Україну, прискорив поставки на 30 відсотків порівняно з початком повномасштабного вторгнення Росії.",
		"https://www.defenseone.com/threats/2023/05/arms-ukraine-flow-30-faster-us-relearns-cold-war-skills/386704/"
	],
	[
		"2023-05-23",
		"The Netherlands is contributing €260 million to a joint purchase of 155 mm ammunition for Ukraine.",
		"Нідерланди виділять 260 мільйонів євро на спільну закупівлю 155 мм боєприпасів для України.",
		"https://www.defensie.nl/actueel/nieuws/2023/05/23/eu-raad-defensieministers-munitie-voor-oekraine-opschaling-productie-en-nieuwe-defensieprojecten"
	],
	[
		"2023-05-23",
		"EU Foreign Affairs Council meeting on defence gathered in Brussels on May 22. The meeting addressed possibilities to accelerate the military support to Ukraine and ensure manufacturing and supply of the ammunition required.",
		"22 травня в Брюсселі відбулося засідання Ради ЄС із закордонних справ з питань оборони, на якому обговорювалися можливості прискорити військову підтримку України та забезпечити виробництво та постачання необхідних боєприпасів.",
		"https://www.consilium.europa.eu/en/meetings/fac/2023/05/22/"
	],
	[
		"2023-05-22",
		"Recent polls by SWG show the majority of Italians are in favor of military support of Ukraine. Among the most convinced supporters of military support for Ukraine are the Poles with 68% and the Spanish with 66%.",
		"Останні опитування SWG показують, що більшість італійців виступають за військову підтримку України. Серед найбільш переконаних прихильників військової підтримки України – поляки з 68% та іспанці з 66%.",
		"https://www.open.online/2023/05/22/sondaggio-swg-tgla7-invio-armi-italia-europa/"
	],
	[
		"2023-05-21",
		"The Department of Defense announced thirty-eighth drawdown of equipment from DoD inventories for Ukraine. It includes\n\n- additional ammunition for High Mobility Artillery Rocket Systems (HIMARS)\n- 155mm and 105mm artillery rounds\n- Tube-Launched, Optically-Tracked, Wire-Guided (TOW) missiles\n- Javelin and AT-4 anti-armor systems\n- Laser-guided rocket system munitions\n- demolition munitions\n- armored bridging systems\n- armored medical treatment vehicles\n- trucks and trailers to transport heavy equipment\n- logistics support equipment\n- thermal imagery systems\n- spare parts and other field equipment",
		"Міністерство оборони США оголосило про новий пакет допомоги Україні, якій включає: \n\n- додаткові боєприпаси для ракетно-артилерійських систем високої мобільності (HIMARS)\n- артилерійські снаряди калібру 155 мм і 105 мм\n- ракети трубного пуску з оптичним відстеженням і дротовим наведенням (TOW)\n- протитанкові системи Javelin і AT-4\n- боєприпаси ракетної системи з лазерним наведенням\n- підривні боєприпаси\n- броньовані мостові системи\n- броньовані медичні машини\n- вантажівки та причепи для перевезення важкої техніки\n- обладнання матеріально-технічного забезпечення\n- тепловізійні системи\n- запчастини та інше польове обладнання",
		"https://www.defense.gov/News/Releases/Release/Article/3402206/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-05-21",
		"The Japanese Foreign Ministry said that the country will send 100 vehicles of self-defense forces and 30 thousand food rations to Ukraine",
		"У МЗС Японії заявили, що країна надішле в Україну 100 одиниць техніки та 30 тисяч продовольчих пайків.",
		"https://en.trend.az/world/3751223.html"
	],
	[
		"2023-05-20",
		"The Netherlands has cancelled an agreement to sell its F-16 to private company Draken International. Presumably, these F-16 fighters will be transferred to the needs of the Air Force of the Armed Forces of Ukraine.",
		"Нідерланди скасували угоду про продаж своїх F-16 приватній компанії Draken International. Імовірно, ці винищувачі F-16 будуть передані для потреб Повітряних Сил Збройних Сил України.",
		"https://twitter.com/oryxspioenkop/status/1659875567712325633?s=20"
	],
	[
		"2023-05-19",
		"US signals to allies it won’t block their export of F-16 jets to Ukraine",
		"США сигналізують союзникам, що не блокуватимуть експорт їхніх літаків F-16 в Україну",
		"https://edition.cnn.com/2023/05/18/politics/us-allies-f-16-jets-ukraine/index.html"
	],
	[
		"2023-05-19",
		"The Pentagon overestimated the value of the ammunition, missiles and other equipment it sent to Ukraine by around $3 billion, according to a Senate aide, an error that may lead the way for more weapons being sent to Kyiv for its defense against Russian forces.",
		"Пентагон переоцінив вартість боєприпасів, ракет та іншого обладнання, яке він відправив в Україну, приблизно на 3 мільярди доларів, за словами помічника Сенату, помилка, яка може стати причиною відправки до Києва більшої кількості зброї для його захисту від російських військ.",
		"https://www.reuters.com/world/europe/pentagon-accounting-error-overvalued-ukraine-aid-by-3-billion-sources-2023-05-18/"
	],
	[
		"2023-05-19",
		"Portugal has made a decision to join the aviation coalition aimed at strengthening the Air Force of Ukraine. Dmitro Kuleba wrote in his Twitter accout that he is \"Grateful for Portugal’s decision to join the aviation coalition by beginning to train Ukrainian pilots and technicians\".",
		"Португалія прийняла рішення приєднатися до авіаційної коаліції, спрямованої на посилення ВПС України. Дмитро Кулеба написав у своєму Twitter, що «вдячний за рішення Португалії приєднатися до авіаційної коаліції, почавши навчати українських пілотів і техніків».",
		"https://twitter.com/DmytroKuleba/status/1659630660514922510?s=20"
	],
	[
		"2023-05-18",
		"Norwegian Defence Minister Bjorn Arild Gram \"Today we are confirming the delivery of long-range artillery and radars. Norway provides three Arthur artillery location radars and up to eight long-range rocket artillery of the MLRS type. The donations are made in close collaboration with the UK.\"",
		"Міністр оборони Норвегії Бйорн Арільд Грам: «Сьогодні ми підтверджуємо поставку далекобійної артилерії та радарів. Норвегія надає три артилерійські локаційні радари Arthur і до восьми далекобійних реактивних артилерійських установок типу РСЗВ. Пожертви зроблені в тісній співпраці з Великобританією».",
		"https://www.regjeringen.no/no/aktuelt/statement-from-bjorn-arild-gram-meeting-ben-wallace-in-northwood/id2977724/"
	],
	[
		"2023-05-17",
		"Britain and the Netherlands are working on an “international coalition” to help Ukraine procure F-16 fighter jets.",
		"Британія та Нідерланди працюють над створенням «міжнародної коаліції», щоб допомогти Україні придбати винищувачі F-16.",
		"https://edition.cnn.com/2023/05/16/europe/uk-netherlands-ukraine-f-16-fighters-intl-hnk/index.html"
	],
	[
		"2023-05-17",
		"France is considering to transfer SCALP air-to-surface missiles to Ukraine.",
		"Франція розглядає можливість передати Україні ракети класу «повітря-поверхня» SCALP.",
		"https://www.lemonde.fr/international/article/2023/05/17/la-france-etudie-la-livraison-de-missiles-scalp-a-l-ukraine_6173709_3210.html"
	],
	[
		"2023-05-16",
		"Ukrainian tank crews and maintainers to start training on US M1A1 Abrams in Germany soon.",
		"Незабаром у Німеччині розпочнуться тренування українських танкістів та технічного персоналу на американських M1A1 Abrams.",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/ukrainian_tank_crews_and_maintainers_to_start_training_on_us_m1a1_abrams_in_germany_soon.html"
	],
	[
		"2023-05-16",
		"German company HENSOLDT will supply six more of its TRML-4D high-performance radars to strengthen Ukraine's air defence. As part of an order worth more than 100 million euros, the radars will be delivered in the second half of the year following the training of the Ukrainian operators. ",
		"Німецька компанія HENSOLDT поставить ще шість своїх високоефективних радарів TRML-4D для посилення протиповітряної оборони України. У рамках замовлення вартістю понад 100 мільйонів євро радари будуть доставлені в другій половині року після навчання українських операторів.",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/hensoldt_to_supply_six_more_trml-4d_air_surveillance_radars_to_ukraine.html"
	],
	[
		"2023-05-15",
		"During the meeting in Paris on May 14, 2023, the presidents of Ukraine and the French Republic made the statement in which France ensured that military support to Ukraine will continue. Ukraine will receive new military packages with constant consideration of Ukraine's most significant and unmet needs to strengthen its defense capabilities. France seeks to ensure full capacity in all areas. In the coming weeks, France will train and equip several battalions with dozens of armored vehicles and light tanks, including the AMX-10RC. In addition, France is focusing its efforts on supporting Ukraine's possible air defenses to protect its population from Russian strikes.",
		"Під час зустрічі в Парижі 14 травня 2023 року президенти України та Французької Республіки зробили заяву, в якій Франція запевнила, що військова підтримка України продовжиться. Україна отримає нові військові пакети з постійним врахуванням найбільш значущих і незадоволених потреб України щодо посилення її обороноздатності. Франція прагне забезпечити повну потужність у всіх сферах. Найближчими тижнями Франція проведе підготовку й оснастить кілька батальйонів десятками броньованих машин і легких танків, включно з AMX-10RC. Крім того, Франція зосереджує зусилля на підтриманні протиповітряної оборони України, щоб захистити її населення від ударів Росії.",
		"https://www.president.gov.ua/news/spilna-deklaraciya-ukrayini-ta-francuzkoyi-respubliki-82897"
	],
	[
		"2023-05-15",
		"The government of the UK will confirm today the further provision for Ukraine of hundreds of air defence missiles and further unmanned aerial systems, including hundreds of new long-range attack drones with a range of over 200km.",
		"Уряд Великої Британії сьогодні підтвердить подальше надання Україні сотень ракет протиповітряної оборони та інших безпілотних літальних комплексів, включаючи сотні нових ударних безпілотників дальньої дії з радіусом понад 200 км.",
		"https://news.sky.com/story/ukraines-president-volodymyr-zelenskyy-arrives-in-uk-for-substantive-negotiations-with-rishi-sunak-12881273"
	],
	[
		"2023-05-15",
		"French President Emmanuel Macron said his country has “opened the door” to training Ukrainian fighter pilots.",
		"Президент Франції Еммануель Макрон заявив, що його країна «відкрила двері» для підготовки українських пілотів-винищувачів.",
		"https://www.politico.eu/article/macron-france-to-train-ukrainian-fighter-pilots-war-zelenksyy/"
	],
	[
		"2023-05-14",
		"European Union foreign policy chief Josep Borrell said the EU must speed up the supply of ammunition to Ukraine.",
		"Глава зовнішньополітичного відомства ЄС Жозеп Боррель заявив, що ЄС повинен прискорити постачання боєприпасів в Україну.",
		"https://www.aljazeera.com/news/2023/5/13/russia-ukraine-war-list-of-key-events-day-445"
	],
	[
		"2023-05-13",
		"Germany's Defense Ministry has announced a new military aid package for Ukraine in value of  €2.7 billion ($2.95 billion), which will include 20 additional Marder infantry fighting vehicles, 30 Leopard 1 tanks and four IRIS-T-SLM air defense systems.",
		"Міністерство оборони Німеччини оголосило про новий пакет військової допомоги Україні вартістю 2,7 млрд євро, який включатиме 20 додаткових бойових машин піхоти Marder, 30 танків Leopard 1 і чотири системи ППО IRIS-T-SLM.",
		"https://www.dw.com/en/germany-to-send-ukraine-27-billion-military-aid-package/a-65612028"
	],
	[
		"2023-05-13",
		"Ukrainian Ministry of Defence confirms plan to order locally-made T-84 Oplot tanks",
		"Міністерство оборони України підтверджує плани замовлення танків Т-84 \"Оплот\" вітчизняного виробництва",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/ukrainian_ministry_of_defence_confirms_plan_to_order_locally-made_t-84_oplot_tanks.amp.html"
	],
	[
		"2023-05-13",
		"German company Rheinmetall joins forces with Ukraine's Ukroboronprom to strengthen National Defense Industry",
		"Німецька компанія Rheinmetall об’єднує зусилля з українським Укроборонпромом для посилення національної оборонної промисловості",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/german_company_rheinmetall_joins_forces_with_ukraine_s_ukroboronprom_to_strengthen_national_defense_industry.amp.html"
	],
	[
		"2023-05-12",
		"Britain has delivered long-range ‘Storm Shadow’ cruise missiles to Ukraine.",
		"Великобританія поставила в Україну крилаті ракети великої дальності «Storm Shadow».",
		"https://edition.cnn.com/2023/05/11/politics/uk-storm-shadow-cruise-missiles-ukraine/index.html"
	],
	[
		"2023-05-12",
		"The Belgian government decided to adopt a new package of support measures for Ukraine. This aid comes in a context where Ukraine is preparing its counter-offensive against Russia and where the Ukrainian population must also be supported.",
		"Уряд Бельгії ухвалив новий пакет заходів підтримки України",
		"https://www.armyrecognition.com/defense_news_may_2023_global_security_army_industry/belgium_offers_new_package_of_military_and_financial_aid_to_ukraine.amp.html"
	]
]