[
	[
		"2023-07-09",
		"Poland has supplied Ukraine with about 12 Mi-24 attack helicopters without announcement.",
		"Польща без оголошення поставила Україні близько 12 ударних вертольотів Мі-24.",
		"https://www.wsj.com/articles/ukraine-war-counteroffensive-frontlines-russia-add3e4e4"
	],
	[
		"2023-07-07",
		"Slovakia will supply Ukraine with 16 Zuzanna-2 howitzers.",
		"Словаччина поставить Україні 16 гаубиць Zuzanna-2.",
		"https://en.interfax.com.ua/news/general/921535.html"
	],
	[
		"2023-07-07",
		"The Defense Department announced an additional security assistance package of up to $800 million aimed to support Ukraine: \n\n- 300 Stingers\n- 36 artillery systems M777\n- 17 recovery tactical vehicles\n- 32 Bradleys\n- 32 Strykers\n- UAS Penguin\n- air-to-air AIM-7 missilles\n- TOW missiles\n- small arms munition \n\nThe package also contains dual-purpose improved conventional munitions, or DPICM, which the Pentagon is providing for the first time to Ukraine",
		"Міністерство оборони США оголосило про додатковий пакет безпекової допомоги на суму до 800 мільйонів доларів, спрямований на підтримку України: \n\n- 300 Стінгерів\n- 36 артилерійських систем M777\n- 17 евакуаційно-тактичних машин\n- 32 Бредлі\n- 32 Страйкери\n- UAS Penguin\n- ракети повітря-повітря AIM-7\n- ракети TOW\n- боєприпаси до стрілецької зброї\n\nПакет також містить вдосконалені звичайні боєприпаси подвійного призначення або DPICM, які Пентагон вперше надає Україні",
		"https://www.defense.gov/News/News-Stories/Article/Article/3451905/dod-announces-800m-security-assistance-package-for-ukraine/"
	],
	[
		"2023-07-07",
		"Only around half of heavy weapons committed to Ukraine have been delivered, experts say: 'The gap between promised and delivered military aid is wide'. The Kiel Institute said some European countries like the Czech Republic, Slovenia, Poland, and Slovakia had outperformed others, delivering \"upwards of 80 percent of their promised heavy weapons.\"",
		"Лише близько половини важкого озброєння, обіцяного Україні, було поставлено: «Розрив між обіцяною та наданою військовою допомогою великий». Кільський інститут заявив, що деякі європейські країни, такі як Чехія, Словенія, Польща та Словаччина, перевершили інші, поставивши «понад 80 відсотків своїх обіцяних важких озброєнь».",
		"https://www.businessinsider.com/only-half-of-heavy-weapons-promised-to-ukraine-delivered-experts-2023-7"
	],
	[
		"2023-07-07",
		"Czhech Republic will provide Ukraine with attack helicopters, possibly Mi-24, large-caliber ammunition and will provide training of Ukrainian pilots for F-16s.",
		"Чехія надасть Україні ударні гелікоптери, можливо, Мі-24, великокаліберні боєприпаси та забезпечить навчання українських пілотів на F-16.",
		"https://www.youtube.com/live/-JpwYk3BIjU?feature=share"
	],
	[
		"2023-07-07",
		"Ukraine expects to receive Turkish-made Fırtına self-propelled howitzers.",
		"Україна розраховує отримати самохідні гаубиці Fırtına турецького виробництва.",
		"https://www.overtdefense.com/2023/07/07/ukraine-aims-to-procure-t-155-firtina-howitzers-from-turkey/"
	],
	[
		"2023-07-05",
		"Poland’s foreign and UK defence ministers hold talks on further support for Ukraine and bilateral military cooperation. ",
		"Міністри оборони Польщі та Великої Британії ведуть переговори щодо подальшої підтримки України та двостороннього військового співробітництва.",
		"https://www.polskieradio.pl/395/9766/artykul/3202366,update-polish-uk-fms-defence-ministers-to-discuss-support-for-ukraine-military-ties"
	],
	[
		"2023-07-04",
		"Bulgarian military aid will be increased this year, Defence Minister Todor Tagarev said on state television BNT, adding that the country will send weapons after they finish analysing the needs of the Ukrainian army and how much the Bulgarian armed forces are capable of giving.",
		"Військова допомога Болгарії цього року буде збільшена, заявив міністр оборони Тодор Тагарєв в ефірі державного телебачення BNT, додавши, що країна надішле зброю після того, як завершиться аналіз потреб української армії та того, скільки болгарські збройні сили здатні надати.",
		"https://www.euractiv.com/section/politics/news/bulgaria-to-increase-its-military-aid-to-ukraine-this-year/"
	],
	[
		"2023-07-03",
		"Slovakia and Ukraine have entered into a cooperative agreement to jointly develop a new wheeled self-propelled howitzer.",
		"Словаччина та Україна уклали угоду про співпрацю щодо спільної розробки нової колісної самохідної гаубиці.",
		"https://www.armyrecognition.com/defense_news_july_2023_global_security_army_industry/slovakia_and_ukraine_collaborate_on_new_155mm_wheeled_self-propelled_howitzer.html"
	],
	[
		"2023-06-30",
		"The Biden administration is actively considering sending cluster munitions to Ukraine.",
		"Адміністрація Байдена активно розглядає можливість відправлення касетних боєприпасів в Україну.",
		"https://www.politico.com/news/2023/06/29/cluster-munitions-for-ukraine-under-active-consideration-by-u-s-00104346"
	],
	[
		"2023-06-30",
		"Sweden's military support to Ukraine has reduced stocks of ammunition. The situation is critical, but getting new shells quickly is not possible. Therefore, the government has decided that the manufacture of ammunition should be as important as the long-term investment in Gripen planes and submarines.",
		"Військова підтримка України Швецією призвела до скорочення запасів боєприпасів. Ситуація критична, але швидко отримати нові снаряди неможливо. Тому уряд вирішив, що виробництво боєприпасів має бути таким же важливим, як і довгострокові інвестиції в літаки та підводні човни Gripen.",
		"https://www.dn.se/sverige/ammunitionskris-i-forsvaret-for-lite-pa-lager/"
	],
	[
		"2023-06-30",
		"Ukrainian forces use now Turkish Cobra II armored vehicles",
		"Українські війська зараз використовують турецьку бронетехніку Cobra II",
		"https://www.armyrecognition.com/defense_news_june_2023_global_security_army_industry/ukrainian_forces_use_now_turkish_cobra_ii_armored_vehicle.html"
	],
	[
		"2023-06-29",
		"The EU has agreed to offer “future security commitments” to Ukraine. The agreement commits the EU to continue financing weapons supplies to Kyiv through the European Peace Facility, a fund paid for by capitals, according to a person briefed on the discussions. They also pledged to expand the EU’s initiative to train Ukrainian troops, and to explore the possibility of EU military missions to Ukraine if the conditions for it were deemed suitable.",
		"ЄС погодився запропонувати Україні «майбутні зобов’язання щодо безпеки». Угода зобов’язує ЄС продовжувати фінансувати поставки зброї Києву через Європейський фонд миру. Вони також пообіцяли розширити ініціативу ЄС щодо підготовки українських військових, а також вивчити можливість військових місій ЄС в Україні, якщо умови для цього будуть визнані відповідними.",
		"https://www.ft.com/content/8f0528ba-45a4-42c0-b099-07a34e2ee9ff"
	],
	[
		"2023-06-28",
		"The German arms manufacturer Rheinmetall confirmed the upcoming shipment of 14 Leopard 2A4 tanks to Ukraine.",
		"Німецький виробник озброєнь Rheinmetall підтвердив постачання в Україну 14 танків Leopard 2A4.",
		"https://www.plenglish.com/news/2023/06/28/german-arms-manufacturer-to-supply-military-aid-to-ukraine/"
	],
	[
		"2023-06-28",
		"Solid majorities of Americans support providing weaponry to Ukraine to defend itself against Russia and believe that such aid demonstrates to China and other U.S. rivals a will to protect U.S. interests and allies, according to a Reuters/Ipsos survey.",
		"Згідно з опитуванням Reuters/Ipsos, переважна більшість американців підтримують надання Україні зброї для захисту від Росії та вважають, що така допомога демонструє Китаю та іншим суперникам США бажання захищати інтереси та союзників США.",
		"https://www.reuters.com/world/most-americans-support-us-arming-ukraine-reutersipsos-2023-06-28/"
	],
	[
		"2023-06-28",
		"Switzerland has vetoed a plan to export nearly 100 mothballed Leopard battle tanks to Ukraine. The tanks have never been in service in Switzerland, were never intended for use by the Swiss military and are not based in the country. All 96 are stored in Italy, having been acquired in 2016 from the Italian military in a private transaction by the Swiss arms manufacturer Ruag.",
		"Швейцарія наклала вето на експорт в Україну майже 100 законсервованих бойових танків Leopard. Танки ніколи не були на озброєнні в Швейцарії, ніколи не призначалися для використання швейцарськими військовими і не базуються в країні. Усі 96 зберігаються в Італії, вони були придбані у 2016 році в італійських військових у приватній угоді швейцарським виробником зброї Ruag.",
		"https://www.ft.com/content/f33417b0-89a6-4212-a052-41da96f75234"
	],
	[
		"2023-06-28",
		"Lithuania has announced procurement of two Norwegian-made National Advanced Surface-to-Air Missile System (NASAMS) medium-range  air defense launchers for Ukraine to protect civil infrastructure. The deal is valued $9.8 mlm.",
		"Литва оголосила про закупівлю для України двох норвезьких пускових установок середньої дальності (National Advanced Surface-to-Air Missile System - NASAMS) для захисту цивільної інфраструктури. Вартість угоди становить 9,8 млн доларів.",
		"https://twitter.com/Lithuanian_MoD/status/1673956862042030081?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1673956862042030081%7Ctwgr%5Eb2eddf126103f065d35f8ed88afb419e253ecd76%7Ctwcon%5Es1_c10&ref_url=https%3A%2F%2Feurasiantimes.com%2Fcurious-case-of-nasams-lithuania-to-buy-air-defense-systems%2F"
	],
	[
		"2023-06-27",
		"The Defense Department announced an additional security assistance package of up to $500 million. The package includes additional armored vehicles, antiarmor systems and critical munitions for U.S.-provided Patriot air defense systems and High Mobility Artillery Rocket Systems among other items.",
		"Міністерство оборони США оголосило про додатковий пакет допомоги у сфері безпеки на суму до 500 мільйонів доларів. Пакет включає додаткову бронетехніку, протитанкові системи та боєприпаси для наданих США систем протиповітряної оборони Patriot і високомобільних артилерійських ракетних систем.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3441398/pentagon-announces-500m-in-security-assistance-for-ukraine/"
	],
	[
		"2023-06-26",
		"The Australian government will provide a new A$110 million ($73.5 million) package to Ukraine. It includes 28 M113 armoured vehicles, 14 special operations vehicles, 28 medium trucks and 14 trailers.",
		"Уряд Австралії надасть Україні новий пакет допомоги на 110 мільйонів австралійських доларів. Він включає 28 броньованих машин М113, 14 машин спеціального призначення, 28 середніх вантажівок і 14 причепів.",
		"https://www.reuters.com/world/europe/australia-provide-74-million-assistance-package-ukraine-2023-06-26/"
	],
	[
		"2023-06-26",
		"The Bulgarian government has approved a new military aid package for Ukraine. The cabinet’s approval comes in accordance with a December 2022 parliamentary vote. The details of both aid packages remain classified.",
		"Уряд Болгарії затвердив новий пакет військової допомоги Україні. Схвалення Кабінету міністрів відбулося відповідно до парламентського голосування в грудні 2022 року. Деталі обох пакетів допомоги залишаються засекреченими.",
		"https://www.rferl.org/a/bulgaria-approves-military-aid-ukraine/32476806.html"
	],
	[
		"2023-06-26",
		"Germany will send 45 more Gepard anti-aircraft systems to Ukraine this year",
		"Цього року Німеччина надішле Україні ще 45 зенітних систем Gepard",
		"https://www.thedefensepost.com/2023/06/26/germany-gepard-ukraine/"
	],
	[
		"2023-06-26",
		"Rheinmetall Sending 20 Additional Marder Infantry Vehicles to Ukraine",
		"Rheinmetall відправляє в Україну 20 додаткових машин піхоти Marder",
		"https://www.thedefensepost.com/2023/06/26/rheinmetall-marder-vehicles-ukraine/"
	],
	[
		"2023-06-22",
		"Bulgaria is preparing a new tranche of military aid for Ukraine. Defense Minister Todor Tagarev said Bulgaria will soon join an agreement on providing 1 million artillery rounds to Ukraine. ",
		"Болгарія готує новий транш військової допомоги Україні. Міністр оборони Тодор Тагарєв заявив, що Болгарія незабаром приєднається до угоди про надання Україні 1 млн артилерійських снарядів.",
		"https://www.aa.com.tr/en/europe/bulgaria-preparing-new-tranche-of-military-aid-for-ukraine/2928215"
	],
	[
		"2023-06-21",
		"Rheinmetall has booked a further order from the Ukrainian Ministry of Defence to supply two \"Forward Surgical Team\" (FST) mobile medical facilities systems for field operations.",
		"Компанія Rheinmetall замовила наступне замовлення від Міністерства оборони України на постачання двох мобільних медичних систем «передової хірургічної групи» (FST) для польових операцій.",
		"https://www.armyrecognition.com/defense_news_june_2023_global_security_army_industry/rheinmetall_to_supply_ukraine_with_two_forward_surgical_team_stations.html"
	],
	[
		"2023-06-21",
		"The European Union approved adding 3.5 billion euros  ($3.8 billion) to a fund used to finance military aid for Ukraine against the Russian invasion. Of the new allocation, 1 billion euros are expected to go to Ukraine and 2.5 billion to other countries.",
		"Європейський Союз схвалив виділення 3,5 мільярдів євро до фонду, що використовується для фінансування військової допомоги Україні проти російського вторгнення. З нових асигнувань 1 млрд євро планується для України та 2,5 млрд – іншим країнам.",
		"https://www.laprensalatina.com/eu-adds-3-5-billion-euros-to-ukraine-war-chest/"
	],
	[
		"2023-06-20",
		"The countries of the European Union will train 30,000 Ukrainian soldiers in 2023, as announced by the Ukrainian Ministry of Defense.",
		"Країни Європейського Союзу навчать 30 тисяч українських військових у 2023 році, повідомило Міністерство оборони України.",
		"https://www.armyrecognition.com/defense_news_june_2023_global_security_army_industry/european_union_countries_to_train_30_000_ukrainian_soldiers_in_2023.html"
	],
	[
		"2023-06-20",
		"The Pentagon said it overestimated the value of the weapons it has sent to Ukraine by $6.2 billion over the past two years — about double early estimates — resulting in a surplus that will be used for future security packages.",
		"Пентагон заявив, що переоцінив вартість зброї, яку він відправив в Україну, на 6,2 мільярда доларів за останні два роки, в результаті чого надлишок буде використаний для майбутніх пакетів заходів безпеки.",
		"https://apnews.com/article/ukraine-russia-war-weapons-surplus-funding-72eeb6119439146f1939d5b1973a44ef"
	],
	[
		"2023-06-19",
		"Rheinmetall is waiting for several billion-dollar contracts to manufacture ammunition for Ukraine.",
		"Rheinmetall чекає на кількамільярдні контракти на виробництво боєприпасів для України.",
		"https://ubn.news/rheinmetall-is-waiting-for-several-billion-dollar-contracts-to-manufacture-ammunition-for-ukraine/"
	],
	[
		"2023-06-19",
		"Denmark's military support to Ukraine will be increased to 21.9 billion Danish crowns ($3.21 billion) during 2023-2028.",
		"Військова підтримка України Данією буде збільшена до 21,9 млрд\nданських крон ($3,21 млрд) протягом 2023-2028 років.",
		"https://www.reuters.com/world/europe/denmark-plans-aid-ukraine-military-by-over-3-billion-2023-06-19/"
	],
	[
		"2023-06-19",
		"A group of U.S. lawmakers will meet with French President Emmanuel Macron to urge France to increase its support for Ukraine, while also  assuring him and other European leaders that the U.S. will support Kyiv long-term.",
		"Група законодавців США зустрінеться з президентом Франції Еммануелем Макроном, щоб закликати Францію збільшити підтримку України, а також запевнити його та інших європейських лідерів, що США підтримуватимуть Київ у довгостроковій перспективі.",
		"https://aviationweek.com/shownews/paris-air-show/us-delegation-pressing-france-more-ukraine-aid"
	],
	[
		"2023-06-16",
		"Croatian Minister of Defence Mario Banozic said in an interview that Croatian company Djuro Djakovic Special Vehicles which makes integration services of new-generation NATO interoperable systems for improvement of the existing M-84/T-72 tanks will help in maintenance of soviet-era tanks operating in Ukraine.",
		"Міністр оборони Хорватії Маріо Банозич заявив в інтерв'ю, що хорватська компанія Djuro Djakovic Special Vehicles, яка надає послуги з вдосконалення існуючих танків M-84/T-72, допоможе в обслуговуванні танків радянської епохи, що діють в Україні.",
		"https://balkaninsight.com/2023/06/16/croatia-company-to-help-repair-ukraines-soviet-era-tanks/"
	],
	[
		"2023-06-16",
		"The Council of Ministers of Belgium approved the 15th package of military assistance for Ukraine valued over 11 mln. Euro. As part of this package, Belgium will purchase and hand over M113 armoured vehicles as soon as the Belgian defence industry companies bring them to proper condition. Some sources mention the quantity of these vehicles being from 40 to 50 of M113.",
		"Рада міністрів Бельгії схвалила 15-й пакет військової допомоги Україні на суму понад 11 млн. євро. У рамках цього пакету Бельгія придбає та передасть бронетранспортери M113, щойно підприємства бельгійської оборонної промисловості приведуть їх у належний стан. Деякі джерела згадують про кількість цих машин від 40 до 50 одиниць.",
		"https://www.rtbf.be/article/guerre-en-ukraine-le-conseil-des-ministres-approuve-le-15e-paquet-daides-a-lukraine-11214478"
	],
	[
		"2023-06-16",
		"Spain will give 20 armoured personal carriers and four Leopard 2A4 tanks to Ukraine, Spanish Defense Minister Margarita Robles said in a statement. The equipment was previously under repair and is set to arrive in Poland on June 19. From there, it will be sent directly to Ukraine, News.Az reports citing the Kyiv Independent. The Defense Minister also announced the donation of a Role 2+ hospital to Ukraine, a rapidly deployable emergency unit that is capable of supporting surgery and essential post-operative management.",
		"Іспанія передасть Україні 20 бронетранспортерів і чотири танки Leopard 2A4, повідомила міністр оборони Іспанії Маргарита Роблес. Обладнання раніше перебувало на ремонті і має прибути до Польщі 19 червня, звідти його відправлять напряму в Україну. Вона також оголосила про передачу Україні відділення невідкладної допомоги швидкого розгортання Role 2+, яке здатне підтримувати хірургію та важливе післяопераційне лікування.",
		"https://news.az/news/spain-to-send-20-armoured-personal-carriers-4-leopard-tanks-to-ukraine"
	],
	[
		"2023-06-16",
		"Rheinmetall will ramp up production of propellant powder for ammunition at its plant in the Bavarian town of Aschau by 500 to 600 metric tons per year, adding some 10% to its current global capacity of more than 6,000 tons, its CEO Armin Papperger said. ",
		"Rheinmetall збільшить виробництво метального пороху для боєприпасів на своєму заводі в баварському місті Ашау на 500-600 метричних тонн на рік, додавши приблизно 10% до поточної глобальної потужності, що становить понад 6000 тонн, заявив генеральний директор компанії Армін Паппергер.",
		"https://www.reuters.com/business/aerospace-defense/rheinmetall-boost-propellant-powder-production-by-up-600-tons-per-year-ceo-2023-06-16/"
	],
	[
		"2023-06-16",
		"The Swedish government has decided on a 12th support package to Ukraine, worth 250 million crowns ($23.7 million), that includes Ukrainian pilots test flying the Nordic country's Gripen fighter jets.",
		"Уряд Швеції вирішив надати Україні 12-й пакет підтримки вартістю 250 мільйонів крон (23,7 мільйона доларів), який включає тестування українських пілотів на винищувачах Gripen",
		"https://www.reuters.com/world/europe/swedish-government-inks-24-mln-support-package-ukraine-2023-06-16/"
	],
	[
		"2023-06-15",
		"Ukraine will get a further 14 Leopard-2 battle tanks from Western partners, financed by Denmark and the Netherlands.",
		"Ще 14 бойових танків Leopard-2 Україна отримає від західних партнерів за фінансування Данії та Нідерландів.",
		"https://www.reuters.com/world/europe/ukraine-get-more-leopard-2-tanks-western-partners-2023-06-15/"
	],
	[
		"2023-06-15",
		"Norway and Denmark agree to donate an additional 9,000 rounds of artillery to Ukraine. Norway provides the shells, while Denmark donates fuzes and propellant charges.",
		"Норвегія і Данія домовилися передати Україні ще 9 тисяч артилерійських снарядів. Норвегія надає снаряди, а Данія дарує детонатори та метальні заряди.",
		"https://www.regjeringen.no/en/aktuelt/noreg-og-danmark-samarbeider-om-ny-donasjon-til-ukraina/id2983852/"
	],
	[
		"2023-06-15",
		"Germany delivers two more Wisent 1 MC tanks to boost Ukraine's Mine-Clearing capabilities",
		"Німеччина поставила ще два танки Wisent 1 MC для посилення можливостей України з розмінування",
		"https://www.armyrecognition.com/defense_news_june_2023_global_security_army_industry/germany_delivers_two_more_wisent_1_mc_tanks_to_boost_ukraine_s_mine-clearing_capabilities.html"
	],
	[
		"2023-06-14",
		"The Netherlands will begin to train Ukrainian F-16 fighter jet pilots “as soon as possible” as part of a three-step plan backed by the US Department of Defense and has stepped up military aid to Kyiv by way of a new €40 million ($43.3 million) air defense package. Amsterdam has also agreed to buy four Czech Republic-made VERA-EG passive radars worth €150 million ($162.8 million) to support Ukrainian integrated air defense capabilities.",
		"Нідерланди почнуть навчати українських пілотів винищувачів F-16 «якомога швидше» в рамках триетапного плану, підтриманого Міністерством оборони США, і збільшили військову допомогу Києву у вигляді пакету ППО на 40 мільйонів євро. Амстердам також погодився придбати чотири чеські пасивні радари VERA-EG вартістю 150 мільйонів євро для підтримки інтегрованої системи ППО України.",
		"https://breakingdefense.com/2023/06/netherlands-outlines-3-step-f-16-training-plan-for-ukraine-plus-43-4m-air-defense-package/"
	],
	[
		"2023-06-13",
		"The £92m air defence package is being provided through the International Fund for Ukraine",
		"Пакет протиповітряної оборони вартістю 92 мільйони фунтів стерлінгів надається через Міжнародний фонд для України",
		"https://www.gov.uk/government/news/major-air-defence-package-for-ukraine-announced-at-meeting-of-joint-expeditionary-force-ministers"
	],
	[
		"2023-06-12",
		"The Department of Defense (DoD) announced 40th presidential drawdown of equipment. It includes artillery, anti-armor systems, and ammunition valued at up to $325 million:\nAdditional munitions for National Advanced Surface-to-Air Missile Systems (NASAMS);\nStinger anti-aircraft systems;\nAdditional ammunition for High Mobility Artillery Rocket Systems (HIMARS);\n155mm and 105mm artillery rounds;\n15 Bradley Infantry Fighting Vehicles;\n10 Stryker Armored Personnel Carriers;\nJavelin anti-armor systems;\nTube-Launched, Optically-Tracked, Wire-Guided (TOW) missiles;\nAT-4 anti-armor systems;\nOver 22 million rounds of small arms ammunition and grenades;\nDemolition munitions for obstacle clearing;\nTactical secure communications support equipment;\nSpare parts and other field equipment.",
		"Міністерство оборони (DoD) оголосило про 40-е президентське списання обладнання. Він включає артилерію, протитанкові системи та боєприпаси на суму до 325 мільйонів доларів США:\nдодаткові боєприпаси для національних передових зенітно-ракетних систем (NASAMS);\nзенітні комплекси Stinger;\nдодаткові боєприпаси для ракетно-артилерійських систем високої мобільності (HIMARS);\nартилерійські снаряди калібру 155 мм і 105 мм;\n15 бойових машин піхоти Bradley;\n10 бронетранспортерів Stryker;\nпротиброньові системи Javelin;\nракети трубного пуску з оптичним відстеженням і дротовим наведенням (TOW);\nпротитанкові системи АТ-4;\nпонад 22 мільйони патронів до стрілецької зброї та гранат;\nпідривні боєприпаси для прибирання перешкод;\nзасоби підтримки тактичного захищеного зв'язку;\nзапчастини та інше польове обладнання.",
		"https://www.defense.gov/News/Releases/Release/Article/3426389/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-06-12",
		"Defence Minister Boris Pistorius told broadcaster RTL, in an interview aired late Monday, that \"we will not be able to replace every tank that is now out of action\".",
		"Міністр оборони Борис Пісторіус заявив телекомпанії RTL в інтерв'ю, яке вийшло ввечері в понеділок, що \"ми не зможемо замінити кожен танк, який зараз вийшов з ладу\".",
		"https://www.thelocal.de/20230613/germany-says-cant-replace-all-tanks-provided-to-ukraine"
	]
]