[
	[
		"2024-05-31",
		"Germany's Defence Minister Boris Pistorius has announced a €500 million military support package for Ukraine.",
		"Міністр оборони Німеччини Борис Пісторіус оголосив про надання Україні пакету військової підтримки на суму 500 мільйонів євро.",
		"https://www.euronews.com/my-europe/2024/05/31/german-defence-minister-announces-500-million-military-support-package-for-ukraine"
	],
	[
		"2024-05-30",
		"More NATO allies have approved measures to allow Ukraine to use supplied weapons for attacks on military targets in Russia. At the same time, the Biden administration prohibits the use of American weapons on Russian territory.",
		"Все більше союзників по НАТО схвалили заходи, які дозволять Україні використовувати надану зброю для атак на військові об'єкти в Росії. Водночас, адміністрація Байдена забороняє використання американської зброї на території Росії.",
		"https://www.foxnews.com/world/pressure-grows-biden-admin-allow-ukraine-use-us-weapons-hit-russia-rather-unfortunate"
	],
	[
		"2024-05-29",
		"EU High Representative Josep Borrell yesterday in Brussels repeated his call to national governments of the member states to unblock financial resources intended for military aid to Ukraine, which cannot be used in the absence of consensus.",
		"Верховний представник ЄС Жозеп Боррель вчора в Брюсселі повторив свій заклик до національних урядів країн-членів розблокувати фінансові ресурси, призначені для військової допомоги Україні, які не можуть бути використані за відсутності консенсусу.",
		"https://www.ukrinform.net/rubric-polytics/3869003-eus-borrell-once-again-calls-on-eu-countries-to-unblock-military-aid-for-ukraine.html"
	],
	[
		"2024-05-28",
		"Ukraine and Belgium have signed a security agreement which includes the delivery of 30 U.S.-made F-16 fighter jets under condition they will not fly over Russian territory.",
		"Україна та Бельгія підписали угоду про безпеку, яка передбачає постачання 30 винищувачів F-16 американського виробництва за умови, що вони не літатимуть над територією Росії.",
		"https://politico.eu/article/belgium-supplies-ukraine-with-e977-million-in-military-aid/"
	],
	[
		"2024-05-28",
		"Prime Minister of Belgium Alexander De Croo and Volodymyr Zelensky signed a bilateral security and long-term support agreement between Ukraine and Belgium. The document includes at least €977 million in Belgian military aid to Ukraine this year, as well as Belgium's commitment to providing our country with support over the course of the agreement's ten-year term.",
		"Прем'єр-міністр Бельгії Александр Де Круо та Володимир Зеленський підписали двосторонню угоду про безпеку та довгострокову підтримку між Україною та Бельгією. Документ передбачає щонайменше 977 мільйонів євро бельгійської військової допомоги Україні цього року, а також зобов'язання Бельгії надавати нашій країні підтримку протягом десятирічного терміну дії угоди.",
		"https://x.com/ZelenskyyUa/status/1795358045733564527"
	],
	[
		"2024-05-28",
		"Sweden said it was suspending plans to send Gripen jets to Ukraine, as its partners want to prioritize the delivery of F-16s fighter jets to Kyiv.",
		"Швеція заявила, що призупиняє плани з постачання винищувачів Gripen в Україну, оскільки її партнери хочуть надати пріоритет постачанню винищувачів F-16 до Києва.",
		"https://www.thedefensepost.com/2024/05/29/sweden-pauses-gripen-ukraine/"
	],
	[
		"2024-05-26",
		"President Joe Biden reiterated on Saturday, May 25, that he has no intention of deploying American soldiers to Ukraine.",
		"Президент Джо Байден підтвердив у суботу, 25 травня, що він не має наміру відправляти американських солдатів в Україну.",
		"https://www.kyivpost.com/post/33281"
	],
	[
		"2024-05-26",
		"Russia is producing artillery shells around three times faster than Ukraine's Western allies and for about a quarter of the cost.",
		"Росія виробляє артилерійські снаряди приблизно втричі швидше, ніж західні союзники України, і приблизно за чверть вартості.",
		"https://news.sky.com/story/russia-is-producing-artillery-shells-around-three-times-faster-than-ukraines-western-allies-and-for-about-a-quarter-of-the-cost-13143224"
	],
	[
		"2024-05-25",
		"The Biden administration announced an additional $275 million in military aid to Ukraine. It will include HIMARS rockets and artillery shells.",
		"Адміністрація Байдена оголосила про надання Україні додаткової військової допомоги у розмірі 275 мільйонів доларів. Вона включатиме ракети HIMARS та артилерійські снаряди.",
		"https://www.defense.gov/News/Releases/Release/Article/3787579/biden-administration-announces-new-security-assistance-for-ukraine/"
	],
	[
		"2024-05-25",
		"Germany has supplied Ukraine with another IRIS-T air defense system.",
		"Німеччина поставила Україні чергову систему протиповітряної оборони IRIS-T",
		"https://www.dw.com/en/ukraine-updates-germany-supplies-another-air-defense-system/live-69179887"
	],
	[
		"2024-05-25",
		"Sweden has pledged a massive military support package. The Swedish government and the Sweden Democrats, a key pro-government political party, have come to a consensus on an aid program. This program dedicates an impressive SEK 75 billion ($7.01 billion) to bolster Ukraine’s military over the coming three years (2024-2026), with equal annual installments of SEK 25 billion (approximately $2.3 billion) slated for each year. As a result, the entirety of Sweden’s military and civilian backing to Ukraine is projected to exceed SEK 100 billion ($9.3 billion).",
		"Швеція пообіцяла надати масштабний пакет військової підтримки. Шведський уряд і Шведські демократи, ключова проурядова політична партія, дійшли консенсусу щодо програми допомоги. Ця програма передбачає виділення вражаючої суми в 75 мільярдів шведських крон (7,01 мільярда доларів США) на підтримку українських військових протягом наступних трьох років (2024-2026), з рівними щорічними внесками по 25 мільярдів шведських крон (приблизно 2,3 мільярда доларів США) щороку. Таким чином, загальна військова і цивільна підтримка України з боку Швеції перевищить 100 мільярдів шведських крон (9,3 мільярда доларів США).",
		"https://theubj.com/uae/world/151102/sweden-commits-7-billion-to-ukraines-military-aid-over-a-span-of-three-years/"
	],
	[
		"2024-05-25",
		"G7 finance ministers cited \"progress\" in finding ways to use profits from frozen Russian assets to help Ukraine. They hope to present a proposal \"defined in all its dimensions\" to G7 leaders ahead of a summit in Puglia, southern Italy, on June 13-15.",
		"Міністри фінансів G7 відзначили \"прогрес\" у пошуку шляхів використання прибутку від заморожених російських активів для допомоги Україні. Вони сподіваються представити пропозицію, \"визначену в усіх її аспектах\", лідерам G7 напередодні саміту в Апулії, на півдні Італії, який відбудеться 13-15 червня.",
		"https://www.msn.com/en-us/news/world/g7-ministers-cite-progress-but-no-done-deal-on-russian-assets-for-ukraine/ar-BB1n209b?ocid=BingNewsSearch"
	],
	[
		"2024-05-25",
		"Bavarian Interior Minister Joachim Herrmann called for an end to aid payments to draft-eligible Ukrainian men who avoid military service.",
		"Міністр внутрішніх справ Баварії Йоахім Германн закликав припинити виплату допомоги призовникам, які ухиляються від військової служби.",
		"https://www.yahoo.com/news/bavaria-urges-end-aid-ukrainian-082300318.html"
	],
	[
		"2024-05-25",
		"The Russian invaders have learned how to destabilize the work of the Ukrainian military’s Starlink service.",
		"Російські окупанти навчилися дестабілізувати роботу українського військового сервісу Starlink.",
		"https://mil.in.ua/en/news/russia-has-figured-out-how-to-mess-up-starlink-service-in-ukraine/"
	],
	[
		"2024-05-24",
		"Germany has handed over 10 Leopard 1 A5 tanks, ammunition for Leopard 2 tanks, 8,500 rounds of 155 mm ammunition, 20 Vector reconnaissance drones with spare parts, 34 RQ-35 Heidrun reconnaissance drones, and other aid in its latest delivery of military aid to Ukraine.",
		"В рамках останньої поставки військової допомоги Україні Німеччина передала 10 танків Leopard 1 A5, боєприпаси для танків Leopard 2, 8500 патронів калібру 155 мм, 20 розвідувальних безпілотників Vector із запасними частинами, 34 розвідувальні безпілотники RQ-35 Heidrun та іншу допомогу.",
		"https://kyivindependent.com/germany-sends-leopard-1-tanks-drones-ammunition-in-latest-aid-package-to-ukraine/"
	],
	[
		"2024-05-22",
		"Recent intelligence suggests that China and Russia are cooperating on military equipment destined for use in the Ukrainian conflict, with lethal aid expected to be supplied by China to Russia, as stated by Grant Shapps, the U.K. Defense Secretary.",
		"Нещодавні розвідувальні дані свідчать про те, що Китай і Росія співпрацюють над військовим обладнанням, призначеним для використання в українському конфлікті, причому, як заявив Грант Шаппс, міністр оборони Великої Британії, очікується, що Китай надасть Росії летальну зброю.",
		"https://www.msn.com/en-us/news/world/china-suspected-of-supplying-lethal-military-aid-to-russia-amid-ongoing-ukraine-crisis/ar-BB1n1qlX?ocid=BingNewsSearch"
	],
	[
		"2024-05-21",
		"Germany plans to ramp up military aid for Ukraine by another 3.8 billion euros ($4.13 billion) this year.",
		"Цього року Німеччина планує збільшити військову допомогу Україні ще на 3,8 мільярда євро (4,13 мільярда доларів).",
		"https://www.reuters.com/world/europe/germanys-military-aid-ukraine-rise-by-38-billion-euros-source-2024-05-21/"
	],
	[
		"2024-05-19",
		"Ukrainian forces have reportedly adapted their 9K33M Osa (Sa-8B) Surface-to-Air Missile (SAM) systems to fire R-73 Air-to-Air Missiles (AAMs). ",
		"Як повідомляється, українські війська адаптували свої зенітно-ракетні комплекси (ЗРК) 9К33М \"Оса\" (Са-8Б) для стрільби ракетами Р-73 \"Повітря-повітря\" (ПЗРК). ",
		"https://armyrecognition.com/news/army-news/army-news-2024/ukraine-modifies-soviet-made-sa-8-air-defense-systems-to-fire-r-73-missiles-following-delays-in-military-aid"
	],
	[
		"2024-05-19",
		"On Monday 20 May, the UN Security Council will discuss military assistance to Ukraine at Russia's request. The Russian delegation will once again try to \"condemn\" the supply of Western weapons to the Ukrainian army.",
		"У понеділок, 20 травня, Рада Безпеки ООН обговорюватиме військову допомогу Україні на прохання Росії. Російська делегація вкотре спробує \"засудити\" постачання західної зброї українській армії.",
		"https://menafn.com/1108229838/UN-Security-Council-To-Discuss-Military-Aid-To-Ukraine-At-Russias-Request"
	],
	[
		"2024-05-18",
		"\nGovernments face increased borrowing, taxes and public sector cuts to finance their soaring military budgets. European NATO members are set to spend a record $380 billion on defense this year — a tough sell to voters.",
		"Уряди стикаються зі збільшенням запозичень, податків і скороченнями в державному секторі для фінансування своїх стрімко зростаючих військових бюджетів. Цього року європейські члени НАТО планують витратити на оборону рекордні 380 мільярдів доларів, що буде нелегким завданням для виборців.",
		"https://www.dw.com/en/ukraine-war-the-trillion-dollar-cost-to-the-west/a-69106932"
	],
	[
		"2024-05-16",
		"Gen. Charles Q. Brown Jr., the chairman of the Joint Chiefs of Staff, said on Thursday that a NATO deployment of US trainers in Ukraine appeared inevitable.",
		"Генерал Чарльз Браун-молодший, голова Об'єднаного комітету начальників штабів, заявив у четвер, що розгортання американських інструкторів НАТО в Україні видається неминучим.",
		"https://www.nytimes.com/2024/05/16/us/politics/nato-ukraine.html"
	],
	[
		"2024-05-16",
		"The Danish government announced a new package of military assistance for Ukraine worth 5.6 billion Danish kroner (~$815 million). The package is the 18th such delivery of military aid, the Danish Defense Ministry said. It includes 2.4 billion Danish kroner ($349 million) earmarked for air defense, as well as artillery pieces, shells, and other ammunition.",
		"Уряд Данії оголосив про новий пакет військової допомоги Україні на суму 5,6 млрд данських крон (~815 млн доларів). Цей пакет є 18-им за рахунком надання військової допомоги, повідомляє Міністерство оборони Данії. Він включає 2,4 млрд данських крон ($349 млн), призначених для протиповітряної оборони, а також артилерійські гармати, снаряди та інші боєприпаси.",
		"https://kyivindependent.com/denmark-announces-more-than-850-million-in-new-military-assistance-for-ukraine/"
	],
	[
		"2024-05-16",
		"According to the German Minister of Defence Boris Pistorius, Lithuania is contributing to the German IAAD initiative which aims to strengthen the Ukrainian air defence with six AMBER-1800 air surveillance radars. He did not provide any further details such as a planned delivery date.",
		"За словами міністра оборони Німеччини Бориса Пісторіуса, Литва робить свій внесок у німецьку ініціативу IAAD, яка має на меті посилити українську протиповітряну оборону шістьма радарами повітряного спостереження AMBER-1800. Він не надав жодних додаткових деталей, таких як запланована дата поставки.",
		"https://x.com/deaidua/status/1791183185969135859"
	],
	[
		"2024-05-15",
		"France will deliver extra military aid to Ukraine in coming days and weeks, the Elysee said on Tuesday, after President Emmanuel Macron spoke by phone with Ukrainian President Volodymyr Zelenskiy.",
		"Франція надасть додаткову військову допомогу Україні в найближчі дні і тижні, заявив Єлисейський палац у вівторок після телефонної розмови президента Еммануеля Макрона з президентом України Володимиром Зеленським.",
		"https://www.msn.com/en-gb/news/world/france-to-send-extra-military-aid-to-ukraine-shortly-says-elysee/ar-BB1mniJg"
	],
	[
		"2024-05-14",
		"Secretary of State Antony Blinken met with Ukrainian President Volodymyr Zelensky in Kiyv Tuesday, the start of a two-day visit to Ukraine to buttress the morale of the government in Kyiv and help channel the delivery of newly approved U.S. aid to help resist a grinding Russian offensive.",
		"Державний секретар США Ентоні Блінкен зустрівся з президентом України Володимиром Зеленським у вівторок у Києві, що стало початком дводенного візиту до України з метою підтримати моральний дух уряду в Києві та допомогти спрямувати нещодавно затверджену американську допомогу, щоб допомогти протистояти наступу Росії.",
		"https://www.wsj.com/world/blinken-arrives-in-ukraine-to-boost-spirits-funnel-u-s-military-aid-6a7d77a6"
	],
	[
		"2024-05-14",
		"H&K plans to produce their weapons in Soviet calibers to help Ukrainian troops.",
		"H&K планує виробляти свою зброю в радянських калібрах, щоб допомогти українським військовим.",
		"https://www.welt.de/wirtschaft/article251409022/Ruestungsindustrie-Der-grosse-Kalaschnikow-Plan-von-Heckler-Koch.html"
	],
	[
		"2024-05-12",
		"According to the British Minister of Defense, the British army has 632 Warrior combat vehicles on its balance, which are presented in the form of infantry fighting vehicles, command vehicles, artillery reconnaissance vehicles, repair and recovery vehicles, and artillery fire control vehicles. In addition, he noted that as the write-off process is already underway, more than 80 combat vehicles are planned to be disposed of in 2025.",
		"За словами британського міністра оборони, на балансі британської армії перебуває 632 бойові машини Warrior, які представлені у вигляді бойових машин піхоти, командних машин, артилерійських розвідувальних машин, ремонтно-евакуаційних машин та машин управління вогнем артилерії. Крім того, він зазначив, що оскільки процес списання вже триває, у 2025 році планується утилізувати понад 80 бойових машин.",
		"https://mil.in.ua/en/news/britain-to-dispose-of-80-warrior-infantry-fighting-vehicles-in-2025/"
	],
	[
		"2024-05-10",
		"The Department of Defense (DoD) announced the fifty-seventh tranche of equipment to be provided from DoD inventories for Ukraine. This Presidential Drawdown Authority (PDA) package has an estimated value of $400 million and includes capabilities to support Ukraine's most urgent battlefield requirements, including air defense, artillery rounds, armored vehicles, and anti-tank weapons.",
		"Міністерство оборони (МО) США оголосило про надання Україні п'ятдесят сьомого траншу обладнання зі складів МО США. Цей пакет, наданий в рамках повноважень Президента США щодо скорочення озброєнь (PDA), оцінюється в 400 мільйонів доларів США і включає засоби для забезпечення найбільш нагальних потреб України на полі бою, включаючи засоби протиповітряної оборони, артилерійські боєприпаси, бронетехніку та протитанкові озброєння.",
		"https://www.defense.gov/News/Releases/Release/Article/3771984/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2024-05-05",
		"The US Government is in negotiations with other G7 countries to provide Ukraine with $50 bln. support package which will be financed mostly from the frozen Russian assets.",
		"Уряд США веде переговори з іншими країнами \"Великої сімки\" про надання Україні пакету підтримки на суму 50 млрд доларів, який буде фінансуватися переважно за рахунок заморожених російських активів.",
		"https://www.bloomberg.com/news/articles/2024-05-03/g-7-eyes-plan-on-us-led-50-billion-aid-package-for-ukraine"
	],
	[
		"2024-05-04",
		"The Commander of the Estonian Defence Forces suggested preparing for a possible blockade of the Baltic Sea for Russia.",
		"Командувач Сил оборони Естонії запропонував готуватися до можливої блокади Балтійського моря для Росії.",
		"https://mil.in.ua/en/news/estonia-proposes-to-blockade-the-baltic-sea-for-russia/"
	]
]