[
	[
		"2022-07-18",
		"U.S. Senator Dan Sullivan (R-Alaska), and four other senators sent a letter to Defense Secretary Lloyd Austin and Chairman of the Joint Chiefs of Staff General Mark Milley, asking them to immediately expedite shipments of military equipment to Ukraine as appropriated by Congress under the Additional Ukraine Supplemental Appropriations Act. Passed on May 19, Equipment recommended for immediate delivery includes medium- and long-range air defense systems, 155 mm howitzers, High Mobility Artillery Rocket Systems (HIMARS), armored personnel carriers, larger and more capable unmanned aircraft systems (UAS), and Mi-17 helicopters. The senators also urged the defense leaders to consider recommending the inclusion of fourth-generation fighter aircraft, along with funding for the necessary flight training in future military aid packages",
		"Сенатор США Ден Салліван (республіканець від Аляски) та чотири інших сенатори надіслали листа Міністру оборони Ллойду Остіну та голові Об’єднаного комітету начальників штабів генералу Марку Міллі з проханням негайно прискорити поставки військового обладнання в Україну, як це передбачено Конгресом, а саме Законом про додаткові асигнування Україні. 19 травня було затверджено перелік обладнання, що рекомендоване для негайної поставки, і включає системи протиповітряної оборони середньої та великої дальності, 155-мм гаубиці, реактивні системи залпового вогню (HIMARS), бронетранспортери, більші та потужніші безпілотні авіаційні системи та гелікоптери Мі-17. Сенатори також закликали лідерів оборони розглянути рекомендацію, щодо включення винищувачів четвертого покоління разом із фінансуванням необхідної льотної підготовки до наступних пакетів військової допомоги",
		"https://www.sullivan.senate.gov/newsroom/press-releases/sullivan-fellow-senators-ask-defense-department-to-expedite-critical-military-aid-to-ukraine"
	],
	[
		"2022-07-20",
		"Western countries could provide the Ukrainian air force with jets and pilot training, the U.S. Air Force’s chief of staff said, but military officials say no firm decisions have been made yet",
		"Західні країни могли б надати українським ВПС реактивні літаки та навчати пілотів, заявив начальник штабу ВПС США, але військові чиновники кажуть, що твердих рішень ще немає",
		"https://www.forbes.com/sites/joewalsh/2022/07/20/us-air-force-general-says-west-may-send-jets-to-ukraine-after-all/?sh=763d27e170c2"
	],
	[
		"2022-07-21",
		"Ben Wallace (UK secretary of defence)  reveals latest British military support for Ukraine, including plans to send 50,000 artillery shells and hundreds more anti-tank weapons in the coming weeks.",
		"Бен Уоллес (міністр оборони Великої Британії) оприлюднив останню британську військову підтримку Україні, включаючи плани відправити 50 000 артилерійських снарядів і сотні протитанкових гармат протягом найближчих тижнів.",
		"https://www.gov.uk/government/news/uk-to-send-scores-of-artillery-guns-and-hundreds-of-drones-to-ukraine"
	],
	[
		"2022-07-24",
		"U.S. Ambassador To Ukraine Says Washington Will Support Kyiv 'For As Long As It Takes'",
		"Посол США в Україні заявив, що Вашингтон підтримуватиме Київ \"стільки, скільки буде потрібно\"",
		"https://www.rferl.org/a/ukraine-us-ambassador-brink-support-kyiv/31957319.html"
	],
	[
		"2022-07-25",
		"Польские боевые танки PT-91 Twardy прибыли в Украину, подтвердил глава Офиса Президента Украины.",
		"Польські бойові танки PT-91 Twardy прибули до України, підтвердив голова Офісу Президента України.",
		"https://tvpworld.com/61471733/polish-main-battle-tanks-arrive-in-ukraine"
	],
	[
		"2022-07-25",
		"The Defense Department has announced another package of security assistance for Ukraine, which will include additional High Mobility Artillery Rocket Systems, ammunition and a substantial number of Phoenix Ghost unmanned aerial systems",
		"Міністерство оборони США оголосило про черговий пакет допомоги Україні у сфері безпеки, який включатиме додаткові ракетно-артилерійські системи високої мобільності, боєприпаси та значну кількість безпілотних літальних комплексів Phoenix Ghost.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3103655/more-himars-phoenix-ghost-drones-bound-for-ukraine/"
	],
	[
		"2022-07-26",
		"The longer the Biden administration continues delaying and stinting its support for Ukraine without enabling Kyiv to halt and reverse Russia’s invasion, the more precarious both Ukraine’s and Taiwan’s positions become. ",
		"Чим довше адміністрація Байдена продовжує зволікати та обмежувати свою підтримку України, не дозволяючи Києву зупинити та повернути вторгнення Росії, тим нестабільнішими стають позиції як України, так і Тайваню.",
		"https://thehill.com/opinion/international/3573439-ukraines-lessons-for-taiwan-grow-more-ominous/"
	],
	[
		"2022-07-26",
		"Slovakia is edging closer to a decision on the delivery of its fleet of MiG-29 fighter jets to Ukraine, but no deal has been finalised yet",
		"Словаччина наближається до рішення про поставку Україні свого парку винищувачів МіГ-29, але угода ще не завершена.",
		"https://kafkadesk.org/2022/07/26/no-deal-yet-on-slovakias-delivery-of-mig-29s-to-ukraine/?utm_source=rss&utm_medium=rss&utm_campaign=no-deal-yet-on-slovakias-delivery-of-mig-29s-to-ukraine"
	],
	[
		"2022-07-26",
		"Some Republicans say President Joe Biden is doing too much to help Ukraine, sending massive amounts of money and weapons with no plan for how the war ends while ignoring trouble back home. Others in the Trump wing of the party, however, argued this week that Biden is acting too slowly. He is giving the Ukrainian troops just enough to prolong the conflict and prevent defeat, they say, when he should be sending even more weapons to score a decisive victory over Russia.",
		"Деякі республіканці кажуть, що президент Джо Байден робить занадто багато, щоб допомогти Україні, надсилаючи величезні суми грошей і зброї, не плануючи, як закінчиться війна, ігноруючи проблеми вдома. Однак інші представники крила Трампа цього тижня стверджували, що Байден діє надто повільно. Він дає українським військам рівно стільки, щоб продовжити конфлікт і запобігти поразці, мовляв, тоді як він мав би надсилати ще більше зброї, щоб здобути вирішальну перемогу над Росією.",
		"https://www.defenseone.com/policy/2022/07/biden-arming-ukraine-play-tie-some-america-first-gopers-say/374977/"
	],
	[
		"2022-07-26",
		"On Monday, Ukraine received its first Gepard anti-aircraft tanks from Germany. “Today, the first three Gepards officially arrived,” Defence Minister Olexiy Resnikov announced on Ukrainian television. In addition, he said, tens of thousands of rounds of ammunition had also been handed over. A total of 15 Gepards were expected to arrive, Resnikov added.",
		"У понеділок Україна отримала від Німеччини перші зенітні танки Gepard. «Сьогодні офіційно прибули перші три Гепарди», – повідомив міністр оборони Олексій Ресніков в ефірі українського телебачення. Крім того, за його словами, також було передано десятки тисяч патронів. Всього очікується прибуття 15 Гепардів, додав Резніков.",
		"https://www.wsws.org/en/articles/2022/07/26/pust-j26.html"
	],
	[
		"2022-07-27",
		"Slovakia might donate its MiG-29 fighter jets to Ukraine, defence minister says",
		"Словаччина може передати Україні свої винищувачі МіГ-29, заявив міністр оборони",
		"https://www.euronews.com/2022/07/25/ukraine-war-what-you-need-to-know-about-the-conflict-this-monday"
	],
	[
		"2022-07-27",
		"Republican lawmakers are worried that Indiana Representative Victoria Spartz might be taking it one step too far when it comes to her criticism of the situation in her native Ukraine. Her criticism is aimed at what she sees as a lack of effort in using American aid to fight invading Russian forces.",
		"Законодавці-республіканці стурбовані тим, що конгресмен від Індіани Вікторія Спартц може зайти занадто далеко, коли справа доходить до її критики ситуації в її рідній Україні. Її критика спрямована на те, що вона вважає браком зусиль у використанні американської допомоги для боротьби з російськими військами.",
		"https://www.953mnc.com/2022/07/27/indiana-rep-victoria-spartz-criticizes-situation-in-ukraine/"
	],
	[
		"2022-07-27",
		"Germany has approved sales of 100 self-propelled artillery systems PzH 2000",
		"Німеччина схвалила продаж 100 самохідних артилерійських систем PzH 2000",
		"https://www.spiegel.de/politik/deutschland/ukraine-darf-100-panzerhaubitzen-kaufen-a-6e1c331d-0da2-4218-9653-2ee96560da9d"
	],
	[
		"2022-07-27",
		"A little-known group at U.S. European Command in Germany fills Ukraine’s battlefield requests with donations from more than 40 countries.",
		"Маловідома група Європейського командування США в Німеччині заповнює запити України на полі бою пожертвами з понад 40 країн.",
		"https://www.nytimes.com/2022/07/27/us/politics/ukraine-weapons-center.html"
	],
	[
		"2022-07-27",
		"11 tanks were seized from residents of the Poltava region",
		"У жителів Полтавського регіону вилучено 11 танків",
		"https://ukranews.com/en/news/872001-law-enforcers-seize-11-tanks-from-residents-in-poltava-region"
	],
	[
		"2022-07-27",
		"Azerbaijan had secretly supplied Ukraine with dozens of precision-guided bombs, documents leaked by the Iraqi Sabereen News Telegram channel on July 27 revealed.",
		"Азербайджан таємно постачав Україні десятки високоточних бомб, свідчать документи, оприлюднені 27 липня іракським телеграм-каналом Sabereen News.",
		"https://southfront.org/azerbaijan-supplied-ukraine-with-dozens-of-precision-guided-bombs-in-secret/"
	],
	[
		"2022-07-28",
		"Chancellor Scholz is under constant pressure from the opposition because of the failure to fulfill his promise to supply heavy weapons to Ukraine. Poland directly accused Germany of disrupting supplies.",
		"Канцлер Шольц перебуває під постійним тиском з боку опозиції через невиконання обіцянки постачати Україні важке озброєння. Польща прямо звинуватила Німеччину в зриві поставок.",
		"https://www.politico.eu/article/germany-olalf-scholz-pressure-tank-deliveries-ukraine/"
	],
	[
		"2022-07-28",
		" In the coming days, the Government of Slovenia will discuss a new package of security assistance to Ukraine.",
		"Найближчими днями уряд Словенії обговорить новий пакет безпекової допомоги Україні.",
		"https://www.ukrinform.net/rubric-polytics/3538011-government-of-slovenia-to-discuss-new-security-assistance-package-to-ukraine.html"
	],
	[
		"2022-07-28",
		"Both Democrats and Republicans raised the issue of transferring ATACMS long-range ballistic missiles to Ukraine again.",
		"І демократи, і республіканці піднімали питання передачі Україні балістичних ракет великої дальності ATACMS",
		"https://en.defence-ua.com/events/the_us_congress_declares_the_need_to_transfer_atacms_to_ukraine_democrats_and_republicans_support_the_decision-3699.html"
	],
	[
		"2022-07-28",
		"Bulgaria Supplies Shells For Ukraine’s 100mm MT-12 Rapira Anti-Tank Guns",
		"Болгарія постачає Україні снаряди для 100-мм протитанкових гармат МТ-12 «Рапіра»",
		"https://en.defence-ua.com/weapon_and_tech/bulgaria_supplies_shells_for_ukraines_100mm_mt_12_rapira_anti_tank_guns-3698.html"
	],
	[
		"2022-07-29",
		"The Defense Ministry of Macedonia confirmed on July 28 that a column of Macedonian tanks was heading towards Ukraine.",
		"У Міноборони Македонії 28 липня підтвердили, що колона македонських танків прямує в бік України.",
		"https://news.yahoo.com/north-macedonia-sending-t-72-150700481.html?fr=sycsrp_catchall"
	],
	[
		"2022-07-29",
		"Germany's Federal Minister of Defense Christine Lambrecht announced the decision to deliver a package of 16 BIBER armored bridge-laying vehicles to Ukraine, with the first shipment of six vehicles to begin in the fall. The other ten will follow in 2023.",
		"Федеральний міністр оборони Німеччини Крістін Ламбрехт повідомила про рішення доставити в Україну пакет з 16 броньованих мостоукладальних машин BIBER, перша поставка з шести машин почнеться восени. Інші десять з’являться у 2023 році.",
		"https://www.newsweek.com/biber-tanks-ukraine-western-weapons-1729233"
	],
	[
		"2022-07-29",
		"Norway has donated 14 armored patrol vehicles to Ukraine",
		"Норвегія передала Україні 14 патрульних броньованих машин",
		"https://norwaytoday.info/news/norway-has-donated-14-armored-patrol-vehicles-to-ukraine/"
	],
	[
		"2022-07-30",
		"Western arms supplies to Ukraine only dragging out conflict, Lavrov tells Blinken",
		"Поставки західної зброї в Україну лише затягують конфлікт, каже Лавров Блінкену",
		"https://www.panorama.am/en/news/2022/07/30/Lavrov-Blinken/2713263"
	],
	[
		"2022-07-30",
		"John Kirby, the National Security Council Coordinator for Strategic Communications, announced new military package. “I fully expect that and I think you're going to see another one [military aid package] relatively soon,” Kirby said. The White House representative said he would not specify any dates now, however, according to him, another statement on the security assistance support for Ukraine would be announced 'very soon.'",
		"Про новий військовий пакет повідомив координатор Ради національної безпеки зі стратегічних комунікацій Джон Кірбі. «Я цілком цього очікую, і я думаю, що відносно скоро ви побачите ще один [пакет військової допомоги]», — сказав Кірбі. Представник Білого дому зазначив, що зараз не буде вказувати дати, однак, за його словами, \"дуже скоро\" буде оголошено ще одну заяву щодо підтримки безпекової допомоги Україні.",
		"https://menafn.com/1104616773/US-To-Announce-Another-Military-Aid-Package-For-Ukraine-Very-Soon-White-House"
	],
	[
		"2022-07-30",
		"US already procuring NASAMS air defense systems for Ukraine, says Pentagon, but delivery date unknown. The U.S. Department of Defense said the allocation of the military aid to Ukraine, the 14th package worth $820 million, would include NASAMS air defense systems.",
		"За словами Пентагону, США вже закуповують системи ППО NASAMS для України, але дата доставки невідома. Міністерство оборони США повідомило, що виділення Україні військової допомоги, 14-й пакет на суму 820 мільйонів доларів, включатиме системи ППО NASAMS.",
		"https://news.yahoo.com/us-already-procuring-nasams-air-144400982.html"
	],
	[
		"2022-08-01",
		"Britain will hand over several warships from its fleet to Ukraine in near future - Ambassador Prystayko",
		"Британія найближчим часом передасть Україні кілька військових кораблів зі свого флоту, - посол Пристайко",
		"https://censor.net/en/news/3357726/britain_will_hand_over_several_warships_from_its_fleet_to_ukraine_in_near_future_ambassador_prystayko"
	],
	[
		"2022-08-01",
		"MLRS MARS II missiles arrived from Germany to Ukraine's front ",
		"З Німеччини на український фронт прибули ракети РСЗВ MARS II",
		"https://www.newsweek.com/mars-ii-missiles-join-ukraines-western-arsenal-1729740"
	],
	[
		"2022-08-01",
		"US officials announced another $550 million in military aid will be sent to Ukraine, including 75,000 rounds of 155mm artillery ammunition and additional ammunition for High Mobility Artillery Rocket Systems (HIMARS). ",
		"Офіційні особи США оголосили, що Україні буде надіслано ще 550 мільйонів доларів військової допомоги, включаючи 75 000 артилерійських боєприпасів калібру 155 мм і додаткові боєприпаси для високомобільних артилерійських ракетних систем (HIMARS).",
		"US sending $550 million in military aid to Ukraine, including HIMARS ammunition | Fox News"
	],
	[
		"2022-08-02",
		"Minister of Defense of Spain, Margarita Robles, announced that the government cannot send its Leopard 2A4 tanks to Ukraine",
		"Міністр оборони Іспанії Маргарита Роблес заявила, що уряд не може відправити в Україну свої танки Leopard 2A4.",
		"https://www.eurointegration.com.ua/eng/news/2022/08/2/7144289/"
	],
	[
		"2022-08-04",
		"Russia is working to fake evidence to claim Western rockets destroyed a jail housing Ukrainian prisoners of war, Washington warned yesterday. US intelligence officials say Russia wants it to appear that Ukrainian forces were responsible for the July 29 attack on Olenivka prison that left 53 dead.",
		"Росія працює над підробкою доказів, щоб стверджувати, що західні ракети знищили в'язницю, де містилися українські військовополонені, попередив учора Вашингтон. Співробітники американської розвідки кажуть, що Росія хоче показати, що українські сили відповідальні за напад на Оленівську в'язницю 29 липня, у результаті якого загинули 53 людини.",
		"https://www.dailymail.co.uk/news/article-11082887/Russia-plant-evidence-blaming-West-Ukrainian-prison-camp-rocket-blast-officials-fear.html"
	],
	[
		"2022-08-04",
		"Defence Ministry of North Makedonia neither confirms nor denies media reports that the country has donated its four Sukhoi Su-25 ground attack jets to Ukraine.",
		"Міністерство оборони Північної Македонії не підтверджує і не спростовує повідомлення ЗМІ про те, що країна передала Україні свої чотири штурмовики Су-25.",
		"https://balkaninsight.com/2022/08/04/north-macedonia-maintains-silence-over-jet-donation-to-ukraine/"
	],
	[
		"2022-08-04",
		"Canada is resuming Operation Unifier - up to 225 Canadian troops have been sent to the UK to train the Ukrainian military.",
		"Канада відновлює операцію «Unifier» – до Великої Британії направлено до 225 канадських військових для навчання українських військових.",
		"https://www.canada.ca/en/department-national-defence/news/2022/08/defence-minister-anita-anand-announces-deployment-of-canadian-armed-forces-to-train-ukrainian-soldiers-in-the-united-kingdom.html"
	],
	[
		"2022-08-05",
		"The Biden administration's next security assistance package for Ukraine is expected to be $1 billion, one of the largest so far, and include munitions for long-range weapons and armored medical transport vehicles, three sources briefed on the matter told Reuters on Friday.",
		"Очікується, що наступний пакет допомоги адміністрації Байдена в галузі безпеки для України становитиме 1 мільярд доларів, один із найбільших на сьогодні, і включатиме боєприпаси для зброї далекого радіусу дії та броньованих медичних транспортних засобів, повідомили Reuters у п’ятницю три джерела, поінформовані про це питання.",
		"https://www.reuters.com/world/europe/exclusive-us-readies-new-1-billion-ukraine-weapons-package-2022-08-05/"
	],
	[
		"2022-08-06",
		"The Swedish Defense Ministry announced Sunday that beginning August 12, it will send up to 120 instructors to the UK to conduct basic military training for Ukrainian citizens",
		"Міністерство оборони Швеції оголосило в неділю, що з 12 серпня відправить до Великобританії до 120 інструкторів для проведення базової військової підготовки громадян України.",
		"https://government.se/press-releases/2022/08/sweden-to-train-ukrainian-soldiers-in-uk/"
	],
	[
		"2022-08-07",
		"Under Secretary of Defense Colin Kahl: \"In recent packages for Ukraine we've included a number of anti-radiation missiles that can be fired off Ukrainian aircraft. \"",
		"Заступник міністра оборони Колін Кал: «В останні пакети для України ми включили низку протилокаційних ракет, які можуть бути випущені з українських літаків».",
		"https://www.thedrive.com/the-war-zone/u-s-confirms-air-launched-anti-radiation-missiles-sent-to-ukraine"
	],
	[
		"2022-08-09",
		"The Finnish Defence Forces will send about 20 service members to Britain to assist in training volunteer members of the Ukrainian Armed Forces",
		"Сили оборони Фінляндії (FDF) відправить близько 20 військовослужбовців до Британії для допомоги у підготовці добровольців Збройних сил України",
		"https://yle.fi/news/3-12569098"
	],
	[
		"2022-08-09",
		"The Biden administration will provide $89 million to help Kyiv clear land mines that now litter huge swaths of Ukraine",
		"Адміністрація Байдена виділить 89 мільйонів доларів, щоб допомогти Києву розмінувати величезні території України",
		"https://news.yahoo.com/u-announces-89-million-help-185916017.html"
	],
	[
		"2022-08-09",
		"As the war in Ukraine continues with no end in sight, concerns are mounting in Washington—in both Democratic and Republican circles—that the Biden administration is holding back from supplying Ukraine with certain weapons that could give the invaded country a clear edge against Russia.",
		"Оскільки війна в Україні триває й кінця їй не видно, у Вашингтоні — як у демократичних, так і в республіканських колах — зростає занепокоєння тим, що адміністрація Байдена утримується від постачання Україні певної зброї, яка може дати країні явну перевагу проти Росії",
		"https://www.msn.com/en-us/news/world/lawmakers-want-better-weapons-for-ukraine-biden-isn-t-so-sure/ar-AA10sLsN"
	],
	[
		"2022-08-09",
		"Biden administration declared in separate announcements that it would provide $5.5 billion more in combined foreign aid and military weaponry to the wartorn nation of Ukraine as it continues to fight Russia’s invasion. The United States Agency for International Development (USAID) announced on Monday that it would send another $4.5 billion worth of taxpayers’ money to the Eastern European country in order to help the Ukrainian government function and provide social services for its people.",
		"Адміністрація Байдена оголосила в окремих оголошеннях, що надасть ще 5,5 мільярдів доларів у вигляді комбінованої іноземної допомоги та військового озброєння постраждалій війною нації України, яка продовжує боротися з вторгненням Росії.. Агентство США з міжнародного розвитку (USAID) оголосило в понеділок, що спрямує до цієї східноєвропейської країни ще 4,5 мільярда доларів грошей платників податків, щоб допомогти українському уряду функціонувати та надавати соціальні послуги її громадянам.",
		"https://www.dailywire.com/news/biden-admin-sending-5-5-billion-more-in-aid-to-ukraine"
	],
	[
		"2022-08-09",
		"The latest $1 billion package of U.S. military assistance to Ukraine includes an undisclosed number of “GMLRS,” precision-guided missiles with a 40-mile range that are fired from HIMARS mobile launchers, along with 75,000 rounds of 155 mm artillery ammunition; 20 120 mm mortar systems with 20,000 rounds of ammunition; 1,000 more Javelin anti-armor missiles; and significantly, anti-radar missiles that can be fired from Ukrainian fighter jets and are capable on homing in on Russian anti-aircraft radars, blinding air defense systems. The Pentagon is promising a “steady stream” of the GPS-guided GMLRS missiles but no more HIMARS launchers",
		"Останній пакет військової допомоги США Україні на суму 1 мільярд доларів включає нерозголошену кількість «GMLRS», високоточних ракет з радіусом дії 40 миль, які запускаються з мобільних пускових установок HIMARS, а також 75 000 снарядів 155-мм артилерії; 20 120-мм мінометів з 20 тис. боєприпасів; ще 1000 протитанкових ракет Javelin; і що важливо, протирадіолокаційні ракети, які можуть бути випущені з українських винищувачів і здатні наводитися на російські зенітні радари, засліплюючи системи протиповітряної оборони. Пентагон обіцяє «постійний потік» ракет GMLRS з GPS-наведенням, але не більше пускових установок HIMARS",
		"https://www.washingtonexaminer.com/policy/defense-national-security/us-promises-steady-stream-of-himars-ammo-as-ukraine-prepares-for-southern-offensive"
	],
	[
		"2022-08-10",
		"The Armed Forces of Ukraine have received 50 new Kirpi armored vehicles from Turkey. Another batch of 150 units is expected to be delivered soon.",
		"Збройні сили України отримали від Туреччини 50 нових броньованих автомобілів Kirpi. Незабаром очікується поставка ще однієї партії зі 150 одиниць.",
		"https://www.ukrinform.net/rubric-ato/3546708-armed-forces-receive-first-batch-of-50-kirpi-armored-vehicles-from-turkey.html"
	],
	[
		"2022-08-10",
		"Germany has supplied four more Gepard anti-aircraft armoured fighting vehicles to the Ukrainian Armed Forces.\nUkraine as a whole has received 12 Gepard anti-aircraft armoured fighting vehicles from Germany. Some 49,000 shells for Gepard, and three armoured recovery vehicles have been supplied over the past few days",
		"Німеччина поставила Збройним Силам України ще чотири бойові зенітні броньовані машини Gepard.\nУкраїна в цілому отримала від Німеччини 12 бойових зенітних броньованих машин Gepard. За останні кілька днів було поставлено близько 49 000 снарядів для Gepard і три броньовані евакуаційні машини.",
		"https://caliber.az/en/post/100026/"
	],
	[
		"2022-08-10",
		"Ben Wallace, the British Defence Secretary, confirmed on Wednesday that London would give Ukraine three additional multiple-launch rocket systems in addition to the three already in Kyiv, as well as a \"significant\" number of rockets for them.",
		"Міністр оборони Великої Британії Бен Воллес підтвердив у середу, що Лондон передасть Україні три додаткові реактивні системи залпового вогню на додаток до трьох, які вже є в Києві, а також «значну» кількість ракет для них.",
		"https://www.pravda.com.ua/eng/news/2022/08/10/7362746/"
	],
	[
		"2022-08-11",
		"Britain and Denmark will provide more financial and military aid to Ukraine. The announcement came after defence ministers meeting in Copenhagen.",
		"Британія та Данія нададуть Україні більше фінансової та військової допомоги. Про це заявили після зустрічі міністрів оборони в Копенгагені.",
		"https://www.reuters.com/world/europe/denmark-will-contribute-additional-110-mln-euros-ukraine-pm-2022-08-11/"
	],
	[
		"2022-08-12",
		"Sweden admits the possibility that it could produce weapons for the needs of Ukraine. This was announced by Swedish Minister of Defense Pēters Hultqvist at the conference of Western countries in Copenhagen",
		"Швеція допускає можливість виробництва зброї для потреб України. Про це заявив міністр оборони Швеції Петерс Хультквіст на конференції західних країн у Копенгагені.",
		"https://baltics.news/2022/08/12/sweden-allows-the-possibility-of-producing-weapons-for-ukraine/"
	],
	[
		"2022-08-12",
		"Estonia must continue to help Ukraine and a new comprehensive military support package is being discussed, said Estonian Minister of Defense Hanno Pevkur after a meeting of 24 countries in Copenhagen",
		"Естонія повинна продовжувати допомагати Україні, і зараз обговорюється новий комплексний пакет військової підтримки, заявив міністр оборони Естонії Ханно Певкур після зустрічі 24 країн у Копенгагені.",
		"https://news.err.ee/1608683122/pevkur-estonia-discussing-new-military-support-package-for-ukraine"
	],
	[
		"2022-08-15",
		"Ukraine has received the first four of a total of eight Slovak-made Zuzana 2 howitzers.",
		"Україна отримала перші чотири із восьми гаубиць словацького виробництва Zuzana 2.",
		"https://www.mosr.sk/51851-en/ukrajina-dostala-prve-z-objednanych-hufnic-zuzana-2/"
	],
	[
		"2022-08-15",
		"Latvia transferred two Mi-17 and two Mi-2 helicopters to Ukraine",
		"Латвія передала Україні два вертольоти Мі-17 і два вертольоти Мі-2",
		"https://www.mod.gov.lv/en/node/10886"
	],
	[
		"2022-08-17",
		"Nineteen retired US generals and former officials have called on the Biden administration to step up the pace of arms supplies to Ukraine or run the risk of “unintentionally seizing defeat from the jaws of victory”. They said that the US was providing enough weaponry to ensure a stalemate but not sufficient to help Ukraine recapture territory seized by Russia. The former officers, diplomats and other officials argue that failure to defeat Vladimir Putin in Ukraine increases the danger of a confrontation with Moscow later “on less favourable grounds”.",
		"Дев'ятнадцять американських генералів у відставці та колишніх чиновників закликали адміністрацію Байдена збільшити темпи поставок зброї в Україну, інакше ризикують «ненавмисно отримати поразку з пащі перемоги». Вони сказали, що США надають достатньо зброї, щоб забезпечити тупикову ситуацію, але недостатньо, щоб допомогти Україні повернути територію, захоплену Росією. Колишні офіцери, дипломати та інші офіційні особи стверджують, що нездатність перемогти Володимира Путіна в Україні збільшує небезпеку конфронтації з Москвою пізніше «на менш сприятливих умовах».",
		"https://www.theguardian.com/us-news/2022/aug/17/us-ukraine-arms-supply-retired-generals-officials"
	],
	[
		"2022-08-18",
		"Jaroslav Nad', Slovakia's defence minister has stated that the Government of Slovakia will not stop providing military support to Ukraine despite all Russia’s efforts to influence public opinion in his country on this matter",
		"Міністр оборони Словаччини Ярослав Надь заявив, що уряд Словаччини не припинить надавати військову підтримку Україні, незважаючи на всі зусилля Росії вплинути на громадську думку в його країні з цього приводу.",
		"https://www.ukrinform.net/amp/rubric-ato/3553050-slovakia-to-send-weapons-to-ukraine-despite-russias-efforts-to-prevent-supplies-defence-minister.html"
	],
	[
		"2022-08-18",
		"“We support Ukraine with the weapons we supply so that Ukraine can protect its territorial integrity and sovereignty” said Germany’s Chancellor Olaf Scholz. He was answering a question on whether the Armed Forces of Ukraine can use weapons provided by Germany and Sweden to return Crimea.",
		"Ми підтримуємо Україну зброєю, яку постачаємо, щоб Україна могла захистити свою територіальну цілісність і суверенітет», – заявив канцлер Німеччини Олаф Шольц. Про це він відповідав на запитання, чи можуть Збройні сили України використати для повернення Криму зброю, надану Німеччиною та Швецією.",
		"https://www.kyivpost.com/russias-war/ukraine-has-the-right-to-use-weapons-to-retake-crimea-leaders-of-germany-sweden.html"
	],
	[
		"2022-08-18",
		"The Latvian Ministry of Defence has confirmed the delivery of six self-propelled M109 howitzers and ammunition to Ukrainian forces",
		"Міністерство оборони Латвії підтвердило поставку українським силам шести самохідних гаубиць М109 і боєприпасів.",
		"https://www.mod.gov.lv/en/node/10886"
	],
	[
		"2022-08-19",
		"The Secretary of State Antony J. Blinken announced military suport to Ukraine in amount of $775 mln. This includes arms, munitions and military equipment.",
		"Держсекретар Ентоні Дж. Блінкен оголосив про військову підтримку України в розмірі 775 млн. доларів. Це включає зброю, боєприпаси та військову техніку.",
		"https://www.state.gov/775-million-in-additional-u-s-military-assistance-for-ukraine/"
	],
	[
		"2022-08-19",
		"For the first time, the U.S. is sending 15 ScanEagle surveillance drones to help the Ukrainians spot and correct the precision artillery and rocket strikes.",
		"США вперше надсилають 15 дронів-спостережників ScanEagle, щоб допомогти українцям помітити та скорегувати високоточні артилерійські та ракетні удари.",
		"https://www.politico.com/newsletters/national-security-daily/2022/08/19/u-s-sending-new-drones-to-ukraine-ahead-of-southern-push-00052856"
	],
	[
		"2022-08-21",
		"Australia will provide Ukraine with 300 DefendTex D40 kamikaze drones",
		"Австралія надасть Україні 300 безпілотників-камікадзе DefendTex D40",
		"https://veteranweb.asn.au/news/australia-will-provide-ukraine-with-300-defendtex-d40-kamikaze-drones/"
	],
	[
		"2022-08-21",
		"The Ukrainian servicemen received Bulgarian 60-mm M60CMA mortars.",
		"Українські військові отримали болгарські 60-мм міномети M60CMA. ",
		"https://mil.in.ua/en/news/ukrainian-servicemen-received-bulgarian-m60cma-mortars/"
	],
	[
		"2022-08-21",
		"Lithuanian Defense Minister Arvydas Anusauskas said that Vilnius is preparing new deliveries of military aid to Ukraine. Anusauskas mentioned that another ten M113 armored vehicles would be handed over to Kyiv.",
		"Міністр оборони Литви Арвідас Анусаускас заявив, що Вільнюс готує нові поставки військової допомоги Україні. Анусаускас зазначив, що Києву буде передано ще десять броньованих машин М113.",
		"https://oopstop.com/lithuania-is-preparing-to-send-two-more-shipments-of-military-aid-to-kyiv/"
	],
	[
		"2022-08-21",
		"Sweden will break its doctrine of not sending arms to countries engaged in an active conflict, the country's prime minister announced Sunday. “Sweden is now proposing direct support for Ukraine's armed forces.\"",
		"Швеція порушить свою доктрину не надсилати зброю країнам, які перебувають у активному конфлікті, заявив у неділю прем'єр-міністр країни. «Швеція зараз пропонує пряму підтримку збройних сил України».",
		"https://infonewsmania.com/sweden-to-send-military-aid-to-ukraine-in-break-with-tradition-daily-sabah-daily-sabah/"
	],
	[
		"2022-08-22",
		"Rumors are swirling around Washington that the United States has provided Ukraine with more weapons than the administration has announced publicly.",
		"У Вашингтоні ходять чутки, що Сполучені Штати надали Україні більше зброї, ніж публічно оголосила адміністрація.",
		"https://www.politico.com/newsletters/national-security-daily/2022/08/22/is-the-u-s-giving-ukraine-some-weapons-secretly-00053079"
	],
	[
		"2022-08-23",
		"Lithuania will send two rotations of instructors to the United Kingdom to train Ukrainian troops there, Lithuanian Defence Minister Arvydas Anušauskas said on Tuesday.",
		"Міністр оборони Литви Арвідас Анушаускас заявив у вівторок, що Литва відправить дві ротації інструкторів до Великої Британії для навчання українських військових.",
		"https://www.lrt.lt/en/news-in-english/19/1764946/lithuania-to-send-30-instructors-to-uk-to-train-ukrainian-troops"
	],
	[
		"2022-08-23",
		"Slovakia will deliver 30 tracked BVP-1 armored infantry fighting vehicles to Ukraine.",
		"Словаччина поставить в Україну 30 гусеничних броньованих машин піхоти БВП-1.",
		"https://www.thedefensepost.com/2022/08/24/germany-slovakia-tank-exchange/"
	],
	[
		"2022-08-23",
		"Chancellor Olaf Scholz said on Tuesday that Germany planned to deliver further arms to Ukraine, worth more than 500 million euros ($498.55 million)",
		"Канцлер Олаф Шольц заявив у вівторок, що Німеччина планує поставити Україні додаткові озброєння на суму понад 500 мільйонів євро (498,55 мільйонів доларів).",
		"https://www.reuters.com/world/europe/germanys-scholz-plans-send-more-arms-ukraine-source-2022-08-23/"
	],
	[
		"2022-08-24",
		"British Prime Minister Boris Johnson promised a further package of military support to Ukraine. The 54 million pound ($63.5 million) package will include 2,000 drones and loitering munitions.",
		"Прем'єр-міністр Великої Британії Борис Джонсон пообіцяв подальший пакет військової підтримки Україні. Пакет вартістю 54 мільйони фунтів стерлінгів (63,5 мільйона доларів США) включатиме 2000 безпілотників і боєприпаси.",
		"https://www.reuters.com/world/uk/uk-pm-johnson-pledges-more-military-aid-ukraine-during-visit-kyiv-2022-08-24/"
	],
	[
		"2022-08-24",
		"On August 24, the Department of Defense (DoD) announced approximately $3 billion in additional security assistance for Ukraine under the Ukraine Security Assistance Initiative (USAI).",
		"24 серпня Міністерство оборони (DoD) оголосило приблизно 3 мільярди доларів додаткової допомоги Україні в галузі безпеки в рамках Ініціативи сприяння безпеці в Україні (USAI).",
		"https://www.defense.gov/News/Releases/Release/Article/3138105/nearly-3-billion-in-additional-security-assistance-for-ukraine/"
	],
	[
		"2022-08-25",
		"Norway and Great Britain are jointly providing Ukraine with \"Black Hornet\" military micro-drones that can be used to spy on Russian forces due to their minute size.",
		"Норвегія та Велика Британія спільно надають Україні військові мікродрони \"Чорний шершень\", які через їх незначні розміри можуть використовуватися для шпигування за російськими військами.",
		"https://www.newsweek.com/ukraine-black-hornet-micro-drones-reconnaissance-undetected-1737135"
	],
	[
		"2022-08-25",
		"The Ministry of Defense of Canada allocated two C-130 aircraft (Lockheed Martin C-130J) for transporting weapons to Ukraine.",
		"Міністерство оборони Канади виділило два літаки C-130 (Lockheed Martin C-130J) для транспортування озброєння в Україну.",
		"https://www.txtreport.com/news/2022-08-25-canada-has-allocated-2-planes-for-transporting-weapons-to-ukraine.S1RbVBryo.html"
	],
	[
		"2022-08-27",
		"The UK is giving underwater drones to Ukraine and training Ukrainian personnel in Britain to use them to clear their coastline of mines",
		"Велика Британія надає Україні підводні безпілотники та навчає український персонал у Британії використовувати їх для очищення берегової лінії від мін",
		"https://www.gov.uk/government/news/uk-donating-undersea-minehunter-drones-to-help-ukraine-clear-coastline"
	],
	[
		"2022-08-27",
		"After a direct question, whether the US will supply aircraft, Under Secretary of Defense for Policy Colin Kahl, answers that the US will not. But this doesn’t mean that there are no other options.",
		"Після прямого запитання, чи постачатимуть США літаки, заступник міністра оборони з питань політики Колін Кал відповів, що США не будуть. Але це не означає, що інших варіантів немає",
		"https://en.defence-ua.com/analysis/the_aircraft_for_ukrainian_air_force_have_already_been_decided_and_it_is_not_the_f_16_tips_from_the_pentagon_and_copenhagen-4022.html"
	],
	[
		"2022-08-29",
		"Olaf Scholz promised that Germany would send Ukraine state-of-the-art weapons, such as air defence and radar systems and reconnaissance drones, in the coming weeks and months.",
		"Олаф Шольц пообіцяв, що Німеччина надасть Україні найсучасніші озброєння, такі як протиповітряна оборона та радіолокаційні системи та розвідувальні безпілотники, протягом найближчих тижнів і місяців.",
		"https://www.reuters.com/world/europe/germanys-scholz-we-will-keep-up-support-ukraine-long-it-takes-2022-08-29/"
	],
	[
		"2022-08-29",
		"The foreign minister of Germany Annalena Baerbock said that Germany will continue to support Ukraine in the war against Russia. Baerbok explained the slow pace of military equipment for Ukrainian soldiers to the difficulties of production",
		"Міністр закордонних справ Німеччини Анналена Бербок заявила, що Німеччина продовжить підтримувати Україну у війні проти Росії. Повільні темпи поставок військової техніки для українських військових Баєрбок пояснила складнощами виробництва",
		"https://good-time-invest.com/blog/germany-approaches-transfer-of-heavy-weapons-to-ukraine/"
	],
	[
		"2022-08-30",
		"EU defence ministers voiced support for the start of work on setting up an EU military training mission for Ukrainian forces that would complement current efforts by individual EU countries",
		"Міністри оборони ЄС висловили підтримку початку роботи зі створення військової тренувальної місії ЄС для українських сил, яка доповнить поточні зусилля окремих країн ЄС",
		"https://www.euractiv.com/section/defence-and-security/news/eu-decides-to-start-work-on-ukraine-military-training-mission/"
	],
	[
		"2022-09-01",
		"The Danish Foreign Minister Jeppe Kofod stressed that Denmark would continue to support Ukraine both in the military sphere and in reconstruction. In particular, a new aid package is being prepared.",
		"Міністр закордонних справ Данії Йеппе Кофод наголосив, що Данія й надалі підтримуватиме Україну як у військовій сфері, так і у відбудові. Зокрема, готується новий пакет допомоги",
		"https://closetheskyoverukraine.com/latest-news/denmark-prepares-another-aid-package-for-ukraine"
	],
	[
		"2022-09-01",
		"Sweden will consider providing Ukraine with self-propelled artillery systems Archer, as well as short-range anti-aircraft missile systems RBS 70 to repel Russian aggression. This said Minister of Foreign Affairs of the Kingdom Ann Linde .",
		"Швеція розгляне можливість надання Україні самохідних артилерійських систем Archer, а також зенітно-ракетних комплексів малої дальності RBS 70 для відсічі російської агресії. Про це заявила міністр закордонних справ Королівства Анн Лінде.",
		"https://thetimeshub.in/sweden-will-consider-providing-ukraine-with-acs-archer/35454/"
	],
	[
		"2022-09-02",
		"U.S. President Joe Biden will request $11.7 billion in emergency funding from Congress to provide lethal aid and budget support to Ukraine",
		"Президент США Джо Байден вимагатиме від Конгресу екстреного фінансування в розмірі 11,7 мільярдів доларів для надання летальної допомоги та бюджетної підтримки Україні.",
		"https://www.reuters.com/world/biden-request-117-bln-ukraine-aid-224-bln-covid-relief-2022-09-02/"
	],
	[
		"2022-09-05",
		"European weapons stocks are running low, Josep Borrell warned",
		"Запаси зброї в Європі скорочуються, попередив Жозеп Боррель",
		"https://www.cnbc.com/2022/09/05/russia-ukraine-live-updates.html"
	],
	[
		"2022-09-07",
		"The Pentagon's goal is to deliver 100,000 of 155 mm artillery rounds in 90 days and 15,000 a month after that.",
		"Мета Пентагону - поставити 100 000 артилерійських снарядів калібру 155 мм протягом 90 днів і 15 000 через місяць після цього.",
		"https://edition.cnn.com/2022/09/07/politics/us-military-ukraine-analysis/index.html"
	],
	[
		"2022-09-07",
		"According to the Minister of Digital Transformation Mykhailo Fedorov, the citizens of Ukraine collected UAH 64 million for the purchase of the \"army of drones\". With these funds, 40 Warmate drones were purchased",
		"За словами міністра цифрової трансформації Михайла Федорова, громадяни України зібрали 64 млн грн на закупівлю \"армії дронів\". За ці кошти було придбано 40 безпілотників Warmate",
		"https://en.interfax.com.ua/news/general/857113.html"
	],
	[
		"2022-09-08",
		"Norway sent 160 Hellfire missiles to Ukraine",
		"Норвегія відправила в Україну 160 ракет Hellfire",
		"https://www.tu.no/artikler/attende-vapendonasjon-fra-norge-denne-gang-er-det-hellfire-missiler/522074"
	],
	[
		"2022-09-08",
		"The new package of U.S. assistance to Ukraine valued at up to $675 million dollars includes HIMARS ammunition, 105 mm howitzers, artillery ammunition and HARM missiles, Humvees and armored ambulances, anti-tank systems and more",
		"Новий пакет допомоги США Україні на 675 мільйонів доларів включає боєприпаси для HIMARS, 105-мм гаубиці,  артилерійські боєприпаси та ракети HARM, Humvee та броньовані санітарні машини, протитанкові системи тощо",
		"https://www.defense.gov/News/Transcripts/Transcript/Article/3152582/secretary-of-defense-lloyd-j-austin-iii-and-chairman-of-the-joint-chiefs-of-sta/"
	],
	[
		"2022-09-09",
		"Secretary of State Antony Blinken pledged lasting U.S. support for Ukraine during a visit to Kyiv. His visit signals ongoing U.S. backing for the war, as the Biden administration pledged an additional $675 million in U.S. military supplies for Ukraine.The administration will also provide $1 billion in military financing for Ukraine, Blinken said, along with a similar amount for neighboring nations and countries elsewhere in Europe to strengthen their defenses.",
		"Держсекретар Ентоні Блінкен під час візиту до Києва пообіцяв постійну підтримку України з боку США. Його візит свідчить про постійну підтримку США у війні, оскільки адміністрація Байдена пообіцяла додаткові 675 мільйонів доларів США на військові поставки для України. Адміністрація також надасть 1 мільярд доларів військового фінансування для України, сказав Блінкен, а також аналогічну суму для сусідніх країн і країни в інших частинах Європи для зміцнення своєї оборони.",
		"https://www.washingtonpost.com/national-security/2022/09/08/blinken-visit-kyiv-security-aid/"
	],
	[
		"2022-09-09",
		"The President of Ukraine and the General Director of the Baikar company discussed cooperation in the defense sector",
		"Президент України та генеральний директор компанії «Байкар» обговорили співпрацю в оборонній сфері",
		"https://www.aa.com.tr/en/russia-ukraine-war/ukrainian-president-honors-ceo-of-turkish-defense-industry-firm-baykar/2681704"
	],
	[
		"2022-09-09",
		"Ukraine purchased from France 155-mm towed TRF1 howitzers, which are no longer in service with the French army.",
		"Україна закупила у Франції 155-мм буксирувані гаубиці TRF1, які вже не стоять на озброєнні французької армії.",
		"https://uk.topnews.media/ukraine/weapons-for-ukraine-ukraine-bought-155-mm-trf1-howitzers-from-france-mass-media-09-09-22-0125-war-in-ukraine/"
	],
	[
		"2022-09-11",
		"\"If Lambrecht (German Defense Minister) — quite correctly — concludes that our security is being defended in Ukraine, then it is also important that she and Chancellor Scholz credibly back this up with appropriate deliveries of armored vehicles to Ukraine,\" said Roderich Kiesewetter, a defense policy lawmaker from Germany's main opposition party, the center-right CDU.",
		"«Якщо Ламбрехт (міністр оборони Німеччини) — цілком правильно — робить висновок, що наша безпека захищається в Україні, то також важливо, щоб вона та канцлер Шольц це надійно підтвердили відповідними поставками бронетехніки в Україну», — сказав Родеріх Кізеветтер, законодавець із питань оборонної політики від головної опозиційної партії Німеччини, правоцентристського ХДС.",
		"https://www.politico.eu/article/eu-security-being-defended-in-ukraine-germanys-lambrecht-vows-continued-support-for-kyiv/"
	],
	[
		"2022-09-12",
		"Lithuanian Defense Minister Arvydas Anusauskas says Lithuania will purchase 37 kamikaze drones to provide to Ukraine, using the money raised by the Legion of Boom campaign.",
		"Міністр оборони Литви Арвідас Анусаускас заявив, що Литва закупить 37 безпілотних літальних апаратів-камікадзе для надання Україні на кошти, зібрані в рамках кампанії Legion of Boom.",
		"https://www.ukrinform.net/rubric-ato/3558850-lithuania-to-buy-37-kamikaze-drones-for-ukraine.html"
	],
	[
		"2022-09-12",
		"Deputy Prime Minister Richard Marles has pledged Australia will continue to back Ukraine as it resists Russian aggression.",
		"Віце-прем'єр-міністр Річард Марлз пообіцяв, що Австралія продовжить підтримувати Україну, яка протистоїть російській агресії.",
		"https://www.sheppnews.com.au/national/deputy-pm-praises-inspirational-ukraine/"
	],
	[
		"2022-09-12",
		"Lithianian Ministry of Defence announced that the shipment of 105 mm howitzers are on their way to Ukraine. The photo published by the Ministry shows a U.S.-made M101A1 howitzer.",
		"Міністерство оборони Литви повідомило, що партія 105-мм гаубиць прямує до України. На фото, опублікованому міністерством, зображена гаубиця М101А1 американського виробництва.",
		"https://twitter.com/Lithuanian_MoD/status/1567446474312540160?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1567446474312540160%7Ctwgr%5Ee93a9e4fedab573c043bf14c9755d023dcae9e34%7Ctwcon%5Es1_c10&ref_url=https%3A%2F%2Fmilitaryleak.com%2F2022%2F09%2F12%2Flithuania-sends-m101a1-105mm-towed-light-howitzer-to-ukraine%2F"
	],
	[
		"2022-09-13",
		"Ukrainian Foreign Minister Dmytro Kuleba condemned \"abstract fears and excuses\" behind Germany's reluctance as he pushed for further arms supplies.",
		"Міністр закордонних справ України Дмитро Кулеба засудив \"абстрактні страхи та виправдання\", які стоять за небажанням Німеччини, коли він наполягає на подальших поставках зброї.",
		"https://www.dw.com/en/russia-ukraine-updates-kyiv-decries-germanys-disappointing-signals-on-weapons/a-63101592"
	],
	[
		"2022-09-15",
		"German economy minister Robert Habeck vows to deliver more weapons to Ukraine",
		"Міністр економіки Німеччини Роберт Хабек обіцяє постачати більше зброї в Україну",
		"https://tvpworld.com/62772534/german-economy-minister-vows-to-deliver-more-weapons-to-ukraine"
	],
	[
		"2022-09-15",
		"Germany’s foreign minister is putting pressure on Chancellor Olaf Scholz to decide soon whether to supply Ukraine with advanced tanks as it seeks to reclaim more of its captured territory from Russia.",
		"Міністр закордонних справ Німеччини тисне на канцлера Олафа Шольца, щоб він незабаром вирішив, чи постачати Україні передові танки, оскільки вона прагне повернути більше захопленої території у Росії.",
		"https://abcnews.go.com/International/wireStory/german-fm-urges-swift-decision-tank-delivery-ukraine-89942868"
	],
	[
		"2022-09-15",
		"A. J. Blinken statement 09/15/2022: $600 Million in Additional U.S. Military Assistance for Ukraine: Together with our Allies and partners, we are delivering the arms and equipment that Ukraine’s forces are utilizing so effectively as they continue their successful counter-offensive against Russia’s invasion.  President Biden has been clear we will support the people of Ukraine for as long as it takes. ",
		"Заява А. Я. Блінкена 15/09/2022: 600 мільйонів доларів додаткової військової допомоги США Україні: Разом з нашими союзниками та партнерами ми доставляємо озброєння та техніку, які українські сили використовують настільки ефективно, що вони продовжують успішний контрнаступ проти вторгнення Росії. Президент Байден чітко дав зрозуміти, що ми будемо підтримувати народ України стільки, скільки буде потрібно.",
		"https://www.state.gov/600-million-in-additional-u-s-military-assistance-for-ukraine/"
	],
	[
		"2022-09-15",
		"According to German Defense Minister Christine Lambrecht, Greece will soon send to Ukraine 40 infantry fighting vehicles -- Soviet-built BMP-1 IFVs -- on the completion of a deal in which Greece would receive 40 German infantry fighting vehicles -- Marder IFVs.",
		"За словами міністра оборони Німеччини Крістін Ламбрехт, Греція незабаром надішле Україні 40 бойових машин піхоти радянського виробництва БМП-1 після завершення угоди, згідно з якою Греція отримає 40 німецьких БМП Marder.",
		"https://www.dw.com/en/russia-ukraine-updates-eu-vows-to-support-ukraine-for-as-long-as-it-takes/a-63128716"
	],
	[
		"2022-09-15",
		"Arvidas Anusauskas, Minister of National Defense of Lithuania, announced that Lithuania will repair Ukranian PzH 2000 ",
		"Міністр національної оборони Литви Арвідас Анусаускас заявив, що Литва відремонтує українські PzH 2000",
		"https://twitter.com/a_anusauskas/status/1570859783489728512?s=20&t=5cy1BJLDOmHggEGX9qBdTw"
	],
	[
		"2022-09-15",
		"Russia’s Foreign Ministry warned the U.S. against providing longer-range missiles to Ukraine.",
		"МЗС Росії застерегло США від надання Україні ракет більшої дальності.",
		"https://www.democracynow.org/2022/9/16/headlines/russia_warns_us_arms_shipments_to_ukraine_could_prompt_direct_military_clash"
	],
	[
		"2022-09-16",
		"The Biden administration announced it will send another $600 million in military aid to Ukraine. The new package will include only the same types of ammunition and equipment as before.",
		"Адміністрація Байдена оголосила, що направить Україні ще 600 мільйонів доларів військової допомоги. У новому пакеті будуть тільки ті ж типи боєприпасів і спорядження, що і раніше.",
		"https://www.wsaz.com/2022/09/16/us-sends-new-military-aid-ukraine-boost-momentum/"
	],
	[
		"2022-09-16",
		"Volodymyr Zelenskiy made an urgent appeal to allies to supply additional air- and missile-defense systems that he said are crucial to repelling Russia’s invasion and preventing further disruption to food and energy supplies.",
		"Володимир Зеленський звернувся до союзників з настійним закликом поставити додаткові системи протиповітряної та протиракетної оборони, які, за його словами, мають вирішальне значення для відбиття вторгнення Росії та запобігання подальшим перебоям у постачанні продовольства та енергії.",
		"https://www.bloomberg.com/news/articles/2022-09-16/ukraine-latest-zelenskiy-makes-urgent-appeal-for-air-defense"
	],
	[
		"2022-09-17",
		"After two moths of hesitation, the German federal government finally gave green light to the Ukraine for the purchasing of 18 howitzers RCH-155 weapon system worth 216 million euros from the Krauss-Maffei Wegmann (KMW) armaments group. However the shipment is expected not earlier than 2025.",
		"Після двох місяців коливань федеральний уряд Німеччини нарешті дав зелене світло Україні на закупівлю 18 гаубиць системи озброєння RCH-155 вартістю 216 мільйонів євро у групи озброєнь Krauss-Maffei Wegmann (KMW). Однак відвантаження очікується не раніше 2025 року.",
		"https://www.welt.de/politik/ausland/article241106455/Waffenhilfe-Deutschland-liefert-weitere-Geschuetze-an-die-Ukraine.html"
	],
	[
		"2022-09-17",
		"Spain sent Ukraine five transport planes with ammunition for large-caliber artillery systems",
		"Іспанія направила Україні п'ять транспортних літаків з боєприпасами для великокаліберних артилерійських систем.",
		"https://babel.ua/en/news/84361-spain-sent-five-planes-with-ammunition-for-large-caliber-artillery-to-ukraine"
	],
	[
		"2022-09-17",
		"Admiral Rob Bauer, the Chair of the NATO Military Committee, announced that the Alliance will increase supplies of modern weapons to Ukraine",
		"Голова Військового комітету НАТО адмірал Роб Бауер заявив, що Альянс збільшить поставки сучасної зброї в Україну",
		"https://english.nv.ua/nation/nato-to-increase-support-to-ukraine-news-50270768.html"
	],
	[
		"2022-09-18",
		"Germany’s Chancellor Olaf Scholz and Defence Minister Christine Lambrecht are not willing to supply Western-designed battle tanks to Ukraine, despite increasingly loud demands for them to do so.",
		"Канцлер Німеччини Олаф Шольц і міністр оборони Крістін Ламбрехт не бажають постачати Україні бойові танки західного виробництва, незважаючи на все гучніші вимоги до них.",
		"https://www.deutschland.de/en/news/ticker-solidarity-with-ukraine"
	],
	[
		"2022-09-19",
		"Senor Defence Official in the Department of Defense of the US: \"Now we're seeing the Russians retaliating for Ukrainian gains, they're targeting critical and civilian infrastructure.  So we here at the Department of Defense will continue -- we will continue to provide Ukraine with what they need for their current fight, when they need it.\"",
		"Старший представник оборонного відомства в Міністерстві оборони США: «Зараз ми бачимо, як росіяни мстять за українські здобутки, вони націлюються на критично важливу та цивільну інфраструктуру. Тому ми тут, у Міністерстві оборони, продовжуватимемо -- ми продовжуватимемо забезпечити Україну тим, що їй потрібно для їхньої нинішньої боротьби, коли вона потребує».",
		"https://www.defense.gov/News/Transcripts/Transcript/Article/3163547/senior-defense-official-and-senior-military-official-hold-a-background-briefing/"
	],
	[
		"2022-09-19",
		"Prime Minister of Slovenia Robert Golob and German Chancellor Scholz agreed in a telephone conference to a joint action, so that the Ukrainian side will receive 28 Slovenian M-55S tanks.",
		"Прем'єр-міністр Словенії Роберт Голоб і канцлер Німеччини Шольц на телефонній конференції домовилися про спільні дії, щоб українська сторона отримала 28 словенських танків М-55С.",
		"https://www.gov.si/en/news/2022-09-19-prime-minister-robert-golob-in-a-telephone-conversation-with-german-chancellor-olaf-scholz-about-current-european-affairs/"
	],
	[
		"2022-09-19",
		"Lithuanian President Gitanas Nauseda called to step up military support to Kyiv in its fight against Russia’s aggression after new mass graves and new evidence of torture were found in liberated Ukrainian territories.",
		"Президент Литви Гітанас Науседа закликав посилити військову підтримку Києва в боротьбі з російською агресією після того, як на звільнених українських територіях були виявлені нові масові поховання та нові докази тортур.",
		"https://www.baltictimes.com/nauseda_calls_to_step_up_military_support_to_kyiv_amid_russia_s_genocide_in_ukraine/"
	],
	[
		"2022-09-19",
		"The German government has decided to transfer four more Panzerhaubitze 2000 self-propelled artillery systems to Ukraine.",
		"Уряд Німеччини вирішив передати Україні ще чотири самохідні артилерійські системи Panzerhaubitze 2000.",
		"https://mil.in.ua/en/news/germany-will-supply-ukraine-with-an-additional-4-pzh-2000-self-propelled-guns/"
	],
	[
		"2022-09-20",
		"\nThree German political scientists from the European Council on International Relations - Gustav Gressel, Rafael Loss and Jana Puglierin – said that the supply of battle tanks, in particular Leopards, to Ukraine would be an urgent need rather than an escalation, and such a German initiative would create trust and serve the security of Europe.",
		"Троє німецьких політологів з Європейської ради з міжнародних відносин – Густав Грессель, Рафаель Лосс і Яна Пульєрін – заявили, що постачання Україні бойових танків, зокрема «Леопардів», буде нагальною потребою, а не ескалацією, і така німецька ініціатива створить довіру та послужить безпеці Європи.",
		"https://www.zeit.de/zustimmung?url=https%3A%2F%2Fwww.zeit.de%2Fpolitik%2Fausland%2F2022-09%2Fukraine-krieg-waffenlieferung-leopard-2"
	],
	[
		"2022-09-20",
		"Republican senators signaled tentative support for additional Ukraine aid that the Biden administration has requested following a classified briefing on Monday night. The Biden administration has asked for $12 billion in aid to Ukraine to be added to the continuing resolution that’s needed to keep the government open past September 30. GOP support for this is essential.",
		"Сенатори-республіканці повідомили про попередню підтримку додаткової допомоги Україні, яку запитала адміністрація Байдена після секретного брифінгу в понеділок увечері. Адміністрація Байдена попросила додати Україні допомогу в розмірі 12 мільярдів доларів до резолюції, необхідної для того, щоб уряд залишався відкритим до 30 вересня. Підтримка Республіканської партії для цього є важливою.",
		"https://www.cnn.com/2022/09/19/politics/ukraine-aid-government-funding-bill/index.html"
	],
	[
		"2022-09-20",
		"Russian Deputy Foreign Minister Alexander Grushko in a Tuesday meeting with France's ambassador to Moscow Pierre Levy warned Paris against the “unacceptable” delivery of weapons to Ukraine.",
		"Заступник міністра закордонних справ Росії Олександр Грушко під час зустрічі у вівторок із послом Франції в Москві П’єром Леві застеріг Париж від «неприйнятних» поставок зброї Україні.",
		"https://english.alarabiya.net/News/world/2022/09/20/Russia-warns-France-about-unacceptable-arms-deliveries-to-Ukraine-"
	],
	[
		"2022-09-21",
		"German Chancellor Olaf Scholz said at the UN General Assembly that Germany will not accept a peace dictated by Russia and will continue supporting “Ukraine with all our might financially, economically, with humanitarian assistance and also with weapons”",
		"Канцлер Німеччини Олаф Шольц заявив на Генасамблеї ООН, що Німеччина не прийме мир, який диктує Росія, і продовжить підтримувати Україну «всіма силами фінансово, економічно, гуманітарною допомогою, а також зброєю».",
		"https://www.aljazeera.com/news/2022/9/21/at-un-general-assembly-leaders-condemns-russias-war-in-ukraine"
	],
	[
		"2022-09-21",
		"Ukraine has presented Canada with a new list of its military hardware needs. The request was contained in a letter received by Defence Minister Anita Anand from her Ukrainian counterpart, Oleksii Reznikov.",
		"Україна представила Канаді новий список потреб військової техніки. Прохання містилося в листі, який міністр оборони Аніта Ананд отримала від свого українського колеги Олексія Резнікова.",
		"https://www.cbc.ca/news/politics/ukraine-russia-weapons-1.6589322"
	],
	[
		"2022-09-21",
		"Lawmakers in Bundestag are scheduled to debate German assistance for Ukraine. And there are indications that a majority is in favor of supplying the country with modern tanks.",
		"Депутати в Бундестазі мають обговорити допомогу Німеччини Україні. І є ознаки того, що більшість виступає за постачання країні сучасних танків.",
		"https://www.dw.com/en/ukraine-war-will-the-ukrainian-army-receive-german-battle-tanks/a-63191358"
	],
	[
		"2022-09-22",
		"Putin’s recent threat to use nuclear weapons will not staunch U.S. aid to Ukraine, the Pentagon’s top spokesperson said Thursday. ",
		"Нещодавня погроза Путіна застосувати ядерну зброю не зупинить допомогу США Україні, заявив у четвер головний представник Пентагону.",
		"https://thehill.com/policy/defense/3656740-pentagon-putins-nuclear-threat-wont-deter-us-aid-to-ukraine/"
	],
	[
		"2022-09-22",
		"Dutch Foreign Minister Wopke Hoekstra called on Wednesday for increased weapons supplies to Ukraine amid partial mobilization declared in Russia. \"It is crucial to continue and up our support for Ukraine: more sanctions, more weapons, more aid.\"",
		"Міністр закордонних справ Нідерландів Вопке Хьокстра закликав у середу збільшити постачання зброї в Україну на тлі часткової мобілізації, оголошеної в Росії. «Вкрай важливо продовжувати та збільшувати нашу підтримку України: більше санкцій, більше зброї, більше допомоги».",
		"https://www.urdupoint.com/en/world/dutch-foreign-minister-calls-for-more-arms-su-1566527.html"
	],
	[
		"2022-09-23",
		"Germany’s Defense Minister Christine Lambrecht stated that Putin's latest \"initiatives\" result in even greater support for Ukraine on the part of Europe, including through the supply of military equipment.",
		"Міністр оборони Німеччини Крістін Ламбрехт заявила, що останні «ініціативи» Путіна призводять до ще більшої підтримки України з боку Європи, в тому числі через постачання військової техніки.",
		"https://www.ukrinform.net/rubric-ato/3577281-berlin-to-pursue-arms-supplies-to-ukraine-despite-putins-statements-defense-chief.html"
	],
	[
		"2022-09-23",
		"Pope Francis said Ukraine had a right to defend itself from Russia's invasion, and lend support to other countries that are supplying Ukrainians with arms and war material.",
		"Папа Римський Франциск зазначив, що Україна має право захищатися від вторгнення Росії та надав підтримку іншим країнам, які постачають українцям зброю та військові засоби.",
		"https://www.ncronline.org/news/world/ukrainians-welcome-pope-francis-tougher-stance-russian-invasion"
	],
	[
		"2022-09-25",
		"Canada boosts capacity of key supply hub for weapons to Ukraine",
		"Канада нарощує потужності ключового центру постачання зброї в Україну",
		"https://www.cbc.ca/news/politics/canada-weapons-supply-lines-expanded-1.6594582"
	],
	[
		"2022-09-25",
		"Swedish Foreign Affairs Minister Ann Lind announced that Sweden evaluates the possibility to provide Archer 155mm wheeled self-propelled howitzers, RBS70 man-portable air defense missile systems, and other military equipment to Ukraine.",
		"Міністр закордонних справ Швеції Анн Лінд повідомила, що Швеція оцінює можливість надання Україні 155-мм колісних самохідних гаубиць Archer, переносних ракетних комплексів ППО RBS70 та іншої військової техніки.",
		"https://twitter.com/AnnLinde/status/1564937471028301824"
	],
	[
		"2022-09-26",
		"Secretary of State Antony Blinken said a conversation with Ukraine over the supply of U.S. weapons to aid the country’s war effort is “ongoing,” notably regarding a request from Kyiv for Army Tactical Missile Systems, or ATACMS",
		"Держсекретар Ентоні Блінкен заявив, що розмова з Україною щодо постачання зброї США для допомоги військовим зусиллям країни «триває», зокрема щодо запиту Києва на армійські тактичні ракетні системи (ATACMS)",
		"https://www.washingtonpost.com/world/2022/09/26/blinken-ukraine-weapons-60-minutes-nasams/"
	],
	[
		"2022-09-26",
		"The US Congress has approved $12.3bn in aid which includes $3bn for arms, supplies and salaries for Ukraine’s military.",
		"Конгрес США схвалив допомогу в розмірі 12,3 мільярда доларів, включаючи 3 мільярди доларів на озброєння, постачання та зарплати українським військовим.",
		"https://www.reuters.com/world/us/us-congress-negotiators-set-12-bln-new-ukraine-aid-2022-09-26/"
	],
	[
		"2022-09-27",
		"The United States will not start delivering sophisticated NASAMS air defenses to Ukraine for another two months or so",
		"Сполучені Штати не почнуть постачати Україні складні засоби протиповітряної оборони NASAMS ще приблизно два місяці.",
		"https://www.reuters.com/world/us-has-not-yet-delivered-nasams-air-defenses-ukraine-pentagon-2022-09-27/"
	],
	[
		"2022-09-27",
		"An unnamed senior European official told the Bloomberg agency that it’s “unlikely” that there'll be any dramatic increase in weapons flow to Kiev.",
		"Неназваний високопоставлений європейський чиновник сказав агентству Bloomberg, що «навряд чи» буде різке збільшення потоку зброї до Києва.",
		"https://www.rt.com/news/563584-ukraine-us-eu-weapons/"
	],
	[
		"2022-09-28",
		"$1.1 billion security assistance package for Ukraine is announced on Sept. 28 by the U.S. Defense Department. The package include: 18 High Mobility Artillery Rocket Systems (HIMARS) and associated ammunition, 150 Armored High Mobility Multipurpose Wheeled Vehicles (HMMWVs), 150 Tactical Vehicles to tow weapons, 40 trucks and 80 trailers to transport heavy equipment, other military systems and supplies.",
		"Міністерство оборони США оголосило 28 вересня про пакет допомоги Україні в сфері безпеки на 1,1 мільярда доларів. Пакет включає: 18 ракетно-артилерійських систем високої мобільності (HIMARS) і пов’язаних боєприпасів, 150 броньованих багатоцільових колісних машин високої мобільності (HMMWV), 150 тактичних машин для буксирування зброї, 40 вантажівок і 80 причепів для транспортування важкого обладнання, інших військових систем і припасів",
		"https://www.msn.com/en-us/news/world/ukraine-situation-report-another-18-himars-launchers-for-ukraine/ar-AA12muql"
	],
	[
		"2022-09-28",
		"The HIMARS artillery system in the US’s latest security assistance package for Ukraine will take a few years to be built",
		"Виробництво систем HIMARS для останнього пакету допомоги Україні займе кілька років",
		"https://www.bloomberg.com/news/articles/2022-09-28/us-is-sending-more-artillery-to-ukraine-but-it-won-t-arrive-for-years"
	],
	[
		"2022-09-29",
		"Republicans so far have unsuccessfully pressed the Biden administration to use the leftover $2.1 billion in Ukraine military aid in time. The moves correspond with another Republican push to provide Ukraine with the long-range Army Tactical Missile System that Kyiv has asked for despite the Biden administration’s reluctance.",
		"Республіканці поки що безуспішно тиснули на адміністрацію Байдена, щоб вона вчасно використала залишки військової допомоги Україні в розмірі 2,1 мільярда доларів. Ці кроки відповідають ще одному поштовху республіканців щодо надання Україні армійської тактичної ракетної системи великої дальності, про яку просив Київ, незважаючи на небажання адміністрації Байдена.",
		"https://www.defensenews.com/congress/2022/09/29/republicans-push-biden-to-use-21-billion-ukraine-aid-set-to-expire/"
	],
	[
		"2022-09-30",
		"President Joe Biden announced that the United States \"will continue to support Ukraine's efforts to regain control of its territory by strengthening its hand militarily and diplomatically\".",
		"Президент Джо Байден оголосив, що Сполучені Штати «продовжуватимуть підтримувати зусилля України відновити контроль над своєю територією шляхом зміцнення своєї позиції військовим і дипломатичним шляхом».",
		"https://www.dailymail.co.uk/news/article-11266907/Putin-United-States-created-nuclear-precedent-bombing-Japan.html"
	],
	[
		"2022-09-30",
		"Minister of Defence Christine Lambrecht said during her visit to Odesa that Germany will deliver the first IRIS-T air defence system to Ukraine in the coming days.",
		"Міністр оборони Крістін Ламбрехт під час візиту в Одесу заявила, що Німеччина найближчими днями поставить в Україну першу систему ППО IRIS-T.",
		"https://www.zdf.de/nachrichten/politik/lambrecht-besuch-ukraine-krieg-russland-100.html"
	],
	[
		"2022-10-01",
		"France is preparing to supply Ukraine with a new series of Caesar guns, taken from an order originally intended for Denmark. This supply could relate to 6 to 12 howitzers",
		"Франція готується поставити в Україну нову серію гаубиць Caesar, взяту із замовлення, спочатку призначеного для Данії. Це постачання може стосуватися від 6 до 12 гаубиць",
		"https://www.lemonde.fr/international/article/2022/10/01/la-france-prepare-la-livraison-de-nouveaux-canons-caesar-a-l-ukraine_6143991_3210.html"
	],
	[
		"2022-10-02",
		"Germany, Denmark and Norway will buy 16 Slovak Zuzana-2 howitzers for Ukraine with delivery to begin next year.",
		"Німеччина, Данія та Норвегія закуплять для України 16 словацьких гаубиць Zuzana-2, постачання яких розпочнеться наступного року.",
		"https://www.usnews.com/news/world/articles/2022-10-02/germany-denmark-norway-to-give-ukraine-16-slovak-zuzana-2-howitzers"
	],
	[
		"2022-10-02",
		"The heads of nine European NATO members on Sunday issued a joint statement backing a path to membership for Ukraine in the U.S.-led security alliance, and calling on all 30 NATO nations to ramp up military aid for Kyiv.",
		"Глави дев'яти європейських країн-членів НАТО в неділю виступили зі спільною заявою, в якій підтримують шлях до членства України в очолюваному США безпековому альянсі та закликають усі 30 країн НАТО збільшити військову допомогу Києву.",
		"https://www.cnbc.com/2022/10/02/9-nato-members-urge-support-for-ukraine-after-annexation.html"
	],
	[
		"2022-10-03",
		"Arquus (France) will supply Ukraine with 20 Bastion armored vehicles.",
		"Arquus (Франція) поставить в Україну 20 броньованих машин Bastion.",
		"https://www.latribune.fr/entreprises-finance/industrie/aeronautique-defense/la-france-va-fournir-des-vehicules-blindes-bastion-arquus-a-l-ukraine-935022.html"
	],
	[
		"2022-10-04",
		"The Department of Defense (DoD) announced the authorization of a Presidential Drawdown of security assistance valued at up to $625 million. This package include: 4 High Mobility Artillery Rocket Systems (HIMARS); 16 155mm Howitzers; 16 105mm Howitzers; 200 MaxxPro Mine Resistant Ambush Protected Vehicles and associated ammunition.",
		"Міністерство оборони США оголосило про пакет допомоги на 625 мільйонів доларів. Цей пакет включає: 4 артилерійські ракетні системи високої мобільності (HIMARS); 16 155-мм гаубиць; 16 105-мм гаубиць; 200 протимінних транспортних засобів MaxxPro із захистом від засідки та відповідних боєприпасів.",
		"https://www.defense.gov/News/Releases/Release/Article/3179323/625-million-in-additional-security-assistance-for-ukraine/"
	],
	[
		"2022-10-05",
		"European Parliament speaker Roberta Metsola told that the European Union should deliver tanks to Ukraine and speed up the procedure of having the country join the bloc. \"The Ukrainians need weapons that they can fight with in order to regain their territory, and that means, for example, Leopard II tanks that several members states have.\"",
		"Спікер Європарламенту Роберта Мецола заявила, що Євросоюз має доставити Україні танки та прискорити процедуру вступу країни до блоку. «Українцям потрібна зброя, якою вони можуть воювати, щоб повернути свою територію, і це означає, наприклад, танки Leopard II, які є у кількох держав-членів».",
		"https://www.france24.com/en/live-news/20221005-eu-should-give-tanks-to-ukraine-european-parliament-chief"
	],
	[
		"2022-10-05",
		"Ukraine will receive new upgraded T-72M battle tanks called T-72 Avenger from Czech Republic. ",
		"Україна отримає від Чехії нові модернізовані бойові танки Т-72М під назвою Т-72 «Месник».",
		"https://www.armyrecognition.com/defense_news_october_2022_global_security_army_industry/czech_republic_delivers_t-72_avenger_tanks_to_ukraine_thanks_to_crowdfunding_campaign.html"
	],
	[
		"2022-10-07",
		"Estonian Minister of Defense Hanno Pevkur announced the next military aid package for Ukraine. According to a Ministry of Defence, the package will include artillery shells, anti-tank ammunition, winter uniforms and personal protective equipment.",
		"Міністр оборони Естонії Ханно Певкур анонсував черговий пакет військової допомоги Україні. За даними Міноборони, пакет міститиме артилерійські снаряди, протитанкові боєприпаси, зимову форму та засоби індивідуального захисту.",
		"https://news.err.ee/1608742171/estonia-sends-more-ammunition-protective-equipment-to-ukraine"
	],
	[
		"2022-10-07",
		"EU foreign policy chief Josep Borrell pushed the 27-nation bloc on Friday to earmark more money to pay for the military support of Ukraine.",
		"Верховний представник ЄС із закордонних справ Жозеп Боррель у п’ятницю підштовхнув блок із 27 країн виділити більше грошей на оплату військової підтримки України.",
		"https://www.reuters.com/world/europe/eu-needs-provide-more-money-pay-military-aid-ukraine-top-diplomat-2022-10-07/"
	],
	[
		"2022-10-08",
		"French President Emmanuel Macron has announced that he will step up arms supplies to Ukraine in the wake of criticism that Paris wasn't doing enough to help the war effort.",
		"Президент Франції Еммануель Макрон оголосив, що він збільшить постачання зброї в Україну після критики, що Париж робить недостатньо, щоб допомогти військовим зусиллям.",
		"https://newseu.cgtn.com/news/2022-10-08/Macron-ups-Ukraine-military-aid-after-criticism-over-low-spending-1dWJsVKfsJy/index.html"
	],
	[
		"2022-10-09",
		"The White House said on Sunday it would continue to arm Ukraine but declined direct comment on an explosion that damaged Russia's road-and-rail bridge to Crimea.",
		"У неділю Білий дім заявив, що продовжить озброювати Україну, але відмовився від прямих коментарів щодо вибуху, який пошкодив російський автомобільно-залізничний міст до Криму.",
		"https://www.usnews.com/news/world/articles/2022-10-09/u-s-says-it-will-continue-offering-security-assistance-to-ukraine"
	],
	[
		"2022-10-09",
		"Germany announced new deliveries of weapons to Ukraine, in particular IRIS-T air defense systems and 100 tanks from Greece and Slovakia, said German Defense Minister Christine Lambrecht during a visit to Lithuania.",
		"Німеччина оголосила про нові поставки зброї в Україну, зокрема систем ППО IRIS-T і 100 танків з Греції та Словаччини, повідомила міністр оборони ФРН Крістін Ламбрехт під час візиту до Литви.",
		"https://apa.az/en/europe/germany-announces-new-weapon-deliveries-to-ukraine-386667"
	],
	[
		"2022-10-09",
		"Jaroslaw Nagy, Slovakia's Defence Minister announced the transfer of two Zuzana 2 self-propelled artillery units to Ukraine.",
		"Міністр оборони Словаччини Ярослав Надь повідомив про передачу Україні двох самохідних артилерійських установок Zuzana 2.",
		"https://news.yahoo.com/gift-aggressor-putin-slovakia-handed-080018294.html"
	],
	[
		"2022-10-09",
		"Over the next few days, Spain will send 12 more heavy trucks to Ukraine. Spanish Defense Minister Margarita Robles said that starting from next month, more Ukrainian soldiers will arrive in the country for training.",
		"Найближчими днями Іспанія відправить в Україну ще 12 великовагових вантажівок. Міністр оборони Іспанії Маргарита Роблес повідомила, що з наступного місяця до країни прибуде більше українських військових для навчання.",
		"https://www.urdupoint.com/en/world/spain-sends-5-tons-of-humanitarian-aid-to-ukr-1574250.html"
	],
	[
		"2022-10-10",
		"French President Emmanuel Macron expressed his “extreme concern” about Russian strikes during a call with his Ukrainian counterpart Volodymyr Zelensky and promised that France would increase military aid.",
		"Президент Франції Еммануель Макрон під час телефонної розмови з українським колегою Володимиром Зеленським висловив «надзвичайну стурбованість» російськими ударами та пообіцяв, що Франція збільшить військову допомогу.",
		"https://www.thelocal.fr/20221010/macron-tells-zelensky-of-extreme-concern-and-pledges-more-military-aid/"
	],
	[
		"2022-10-10",
		"EU foreign policy chief Josep Borrell said he was \"deeply shocked\" by Russia's targeted missile strikes: \"We stand with Ukraine. Additional military support from the EU is on its way.\"",
		"Верховний представник ЄС із закордонних справ Жозеп Боррель заявив, що «глибоко шокований» цілеспрямованими ракетними ударами Росії: «Ми підтримуємо Україну. Додаткова військова підтримка з боку ЄС вже на шляху».",
		"https://www.msn.com/en-au/news/world/eu-foreign-policy-chief-josep-borrell-said-he-was-deeply-shocked-by-russias-targeted-missile-strikes-monday-on-kyiv-and-other-parts-of-ukraine/ar-AA12MO4k"
	],
	[
		"2022-10-10",
		"The United States will soon be unable to provide Ukraine with certain types of ammunition that are essential to battle against Russia’s invasion, as supplies are being used up faster than they can be replaced.",
		"Сполучені Штати незабаром не зможуть забезпечити Україну певними видами боєприпасів, які необхідні для боротьби з вторгненням Росії, оскільки запаси витрачаються швидше, ніж їх можна замінити.",
		"https://www.thedefensepost.com/2022/10/10/us-ammunition-supplies-dwindle/"
	],
	[
		"2022-10-11",
		"Australian government is preparing to deliver another round of military assistance to Ukraine. Their Defence personnel will travel to Europe to help train Ukrainian soldiers.",
		"Уряд Австралії готується надати Україні черговий пакет військової допомоги. Їхні військовослужбовці вирушать до Європи, щоб допомагати навчати українських військових.",
		"https://www.theage.com.au/politics/federal/australia-considers-sending-defence-staff-to-train-ukrainian-troops-20221011-p5bovw.html"
	],
	[
		"2022-10-11",
		"Canada said on Tuesday it will send 40 more combat engineers to help support Polish efforts to train Ukrainian forces, as part of its commitment to increasing military aid for Ukraine.",
		"Канада заявила, що відправить ще 40 інженерів для підтримки польських зусиль у навчанні українських військ, як частину свого зобов’язання щодо збільшення військової допомоги Україні.",
		"https://www.reuters.com/world/canada-send-40-combat-engineers-poland-train-ukraine-soldiers-minister-2022-10-11/"
	],
	[
		"2022-10-12",
		"Canadian Defence Minister Anita Anand announced a new military aid package over C$47 million ($34 million) to assist Ukraine in dealing with Russia's invasion, with the package including artillery rounds, satellite communications, winter clothing and drone cameras, among other assistance.",
		"Міністр оборони Канади Аніта Ананд оголосила про новий пакет військової допомоги на суму понад 47 мільйонів канадських доларів (34 мільйона доларів США), щоб допомогти Україні впоратися з вторгненням Росії, серед іншого пакет включає артилерійські снаряди, супутниковий зв’язок, зимовий одяг і камери для дронів.",
		"https://www.reuters.com/world/canada-announces-new-military-package-ukraine-after-russian-missile-attacks-2022-10-12/"
	],
	[
		"2022-10-12",
		"According to German Ministry of Defence's twitter, \"In the next few weeks, more PzH2000 and MARSII will be handed over to Ukraine\".",
		"Згідно з твіттером міністерства оборони Німеччини, «протягом наступних кількох тижнів Україні буде передано більше PzH2000 і MARSII».",
		"https://twitter.com/BMVg_Bundeswehr/status/1580177624516947971"
	],
	[
		"2022-10-13",
		"The UK and France have pledged to help improve Ukraine's defences. London promised to send air defence missiles, while Paris said it would deliver its own anti-aircraft defence systems.",
		"Велика Британія та Франція пообіцяли допомогти покращити оборону України. Лондон пообіцяв надіслати ракети протиповітряної оборони, а Париж заявив, що поставить власні системи протиповітряної оборони.",
		"https://www.euronews.com/my-europe/2022/10/12/nato-allies-set-to-boost-military-support-to-ukraine-at-two-day-meeting"
	],
	[
		"2022-10-13",
		"NATO chief Jens Stoltenberg said Spain was sending 4 medium-range air defense systems to Ukraine.",
		"Глава НАТО Єнс Столтенберг заявив, що Іспанія надсилає в Україну 4 системи ППО середньої дальності.",
		"https://www.thelocal.es/20221014/spain-to-send-air-defence-systems-to-ukraine-nato-chief/"
	],
	[
		"2022-10-13",
		"Portugal Defense Minister Helena Carreiras announced transfer of 6 Russian Kamov helicopters to Ukraine. ",
		"Міністр оборони Португалії Хелена Каррейрас повідомила про передачу Україні 6 російських вертольотів Камов.",
		"https://www.theportugalnews.com/news/2022-10-13/portugal-to-send-broken-helicopters-to-ukraine/71186"
	],
	[
		"2022-10-13",
		"Minister of National Defence of Lithuania Arvydas Anušauskas announced transfer of \"M113-mounted 120mm mortars, armoured vehicles, thermal vision devices, drones, and other equipment\" to Ukraine.",
		"Міністр національної оборони Литви Арвідас Анушаускас заявив про передачу Україні «120-мм мінометів, встановлених на М113, бронетехніки, тепловізійних приладів, безпілотників та іншої техніки».",
		"https://www.delfi.lt/en/politics/lithuania-transfers-to-ukraine-mortar-carriers-and-armoured-vehicles.d?id=91480615"
	],
	[
		"2022-10-14",
		"The Department of Defense announced the 23rd authorization of a Presidential Drawdown of security assistance to Ukraine valued at up to $725 million. This drawdown includes 200 High Mobility Multipurpose Wheeled Vehicles (HMMWV) HIMARS rockets, artillery rounds, anti-tank weapons, high-speed anti-radiation missiles (HARMs), small arms and ammunition.",
		"Міністерство оборони США оголосило про 23-й пакет допомоги Україні на суму до 725 мільйонів доларів. Він включає 200 багатоцільових колісних транспортних засобів високої мобільності (HMMWV), ракети HIMARS, артилерійські снаряди, протитанкову зброю, високошвидкісні протирадіаційні ракети (HARM), стрілецьку зброю та боєприпаси.",
		"https://www.defense.gov/News/Releases/Release/Article/3189571/725-million-in-additional-security-assistance-for-ukraine/"
	],
	[
		"2022-10-14",
		"Democrats on Capitol Hill have suggested transferring US weapons systems in Saudi Arabia to Ukraine and suspending a planned transfer of Patriot missiles to Riyadh",
		"Демократи на Капітолійському пагорбі запропонували передати Україні системи озброєнь США в Саудівській Аравії та призупинити заплановану передачу Ер-Ріяду ракет Patriot.",
		"https://www.theguardian.com/us-news/2022/oct/14/democrats-us-weapons-systems-saudi-arabia-ukraine"
	],
	[
		"2022-10-16",
		"Germany handed over Biber tank bridge-layers to Ukraine.",
		"Німеччина передала Україні танкові мостоукладачі Biber.",
		"https://en.defence-ua.com/events/ukraine_gets_16_bridge_laying_tanks_as_germany_hands_them_over-4552.html"
	],
	[
		"2022-10-16",
		"Ukraine on Tuesday received the first of four IRIS-T air defence systems Germany promised to supply",
		"Україна у вівторок отримала першу з чотирьох систем ППО IRIS-T, які Німеччина обіцяла поставити)",
		"https://www.reuters.com/world/europe/ukraine-has-received-iris-t-air-defence-system-germany-spiegel-2022-10-11/"
	],
	[
		"2022-10-16",
		"Israeli Minister of Diaspora Affairs Nachman Shai has said that military aid should be provided to Ukraine in view of recent reports about Iran's possible supply of ballistic missiles to Russia.",
		"Міністр у справах діаспори Ізраїлю Нахман Шаї заявив, що Україні необхідно надати військову допомогу з огляду на останні повідомлення про можливе постачання Іраном Росії балістичних ракет.",
		"https://twitter.com/DrNachmanShai/status/1581579455650492416"
	],
	[
		"2022-10-18",
		"Italy has provided Ukraine with the 5th military aid package. There was no disclosure what was included into it.",
		"Італія надала Україні 5-й пакет військової допомоги. Не було розголошено, що там було включено.",
		"https://finance.yahoo.com/news/italy-provides-ukraine-fifth-military-110100850.html"
	],
	[
		"2022-10-18",
		"The Biden administration laid out its vision for the Senate version of the annual Pentagon policy bill on a range of issues. It also asked Congress to include new authorities in the bill, including for military support to Ukraine.",
		"Адміністрація Байдена виклала своє бачення сенатської версії щорічного законопроекту про політику Пентагону з низки питань. Він також звернувся до Конгресу з проханням включити до законопроекту нові повноваження, включно з військовою підтримкою України.",
		"https://rollcall.com/2022/10/18/white-house-seeks-more-ukraine-weapons-support-in-senate-ndaa/"
	],
	[
		"2022-10-18",
		"NATO will deliver air defence systems to Ukraine in coming days to help the country defend itself against the drones, including those from Iran, that Russia is using to target critical infrastructure, the alliance's secretary-general said on Tuesday.",
		"Генеральний секретар альянсу заявив у вівторок, що найближчими днями НАТО доставить Україні системи ППО, щоб допомогти країні захиститися від безпілотників",
		"https://www.reuters.com/world/europe/ukraine-get-anti-drone-systems-coming-days-natos-stoltenberg-says-2022-10-18/"
	],
	[
		"2022-10-18",
		"The Pentagon is considering paying for Elon Musk’s Starlink satellite network in Ukraine",
		"Пентагон розглядає можливість оплати супутникової мережі Starlink Ілона Маска в Україні.",
		"https://www.euractiv.com/section/global-europe/news/pentagon-considers-funding-musks-starlink-network-for-ukraine/"
	],
	[
		"2022-10-18",
		"The French Defence Minister announced that France will supply Ukraine with Crotale air defence systems",
		"Міністр оборони Франції повідомив, що Франція поставить Україні системи ППО Crotale",
		"https://www.republicworld.com/amp/world-news/russia-ukraine-crisis/france-proposes-to-train-2000-ukrainian-soldiers-amid-russia-ukraine-war-articleshow.html"
	],
	[
		"2022-10-19",
		"Israel has refused a Ukrainian request for air defenses against the barrage of Russian attacks enabled by Iranian drones.",
		"Ізраїль відхилив прохання України про протиповітряну оборону від шквалу російських атак іранських безпілотників.",
		"https://www.washingtonexaminer.com/policy/defense-national-security/israel-rejects-ukraine-military-aid-russia-threat"
	],
	[
		"2022-10-20",
		"Czech Republic prepares new military aid package for Ukraine. Two weeks ago provided aid was almost CZK 400 million ($7.5 million), and today is CZK 22 million ($413,193). Defense minister apologized that she couldn't provide detailes.",
		"Чехія готує новий пакет військової допомоги Україні. Два тижні тому надана допомога становила майже 400 мільйонів чеських крон (7,5 мільйона доларів), а сьогодні – 22 мільйони чеських крон (413 193 доларів). Міністр оборони вибачилася, що не може надати подробиць.",
		"https://sports.yahoo.com/czech-republic-prepares-military-aid-091300386.html"
	],
	[
		"2022-10-20",
		"Germany delivers to Ukraine four Hensoldt’s TRML-4D multifunction radar for IRIS-T SLM air defence system.",
		"Німеччина поставить в Україну чотири багатофункціональні радари Hensoldt TRML-4D для системи ППО IRIS-T SLM.",
		"https://www.armyrecognition.com/defense_news_october_2022_global_security_army_industry/hensoldt_delivers_trml-4d_high-performance_air_defence_radars_for_ukraine.html"
	],
	[
		"2022-10-21",
		"\"Arguably, Ukraine would not have been able to sustain Russia’s aggression if it had relied solely on European support to fight the war\", says CEPS think tank in their recent report on military aid to Ukraine. They also point at \"absence of clear leadership within the EU in coordinating the delivery of military aid to Ukraine\"",
		"«Можливо, Україна не змогла б витримати агресію Росії, якби вона покладалася виключно на європейську підтримку для ведення війни», — йдеться в останньому звіті аналітичного центру CEPS про військову допомогу Україні. Також вказують на «відсутність чіткого лідерства всередині ЄС у координації постачання військової допомоги Україні».",
		"https://www.ceps.eu/ceps-publications/assessing-the-eus-military-assistance-to-ukraine/"
	],
	[
		"2022-10-23",
		"Israel is providing Ukraine with intelligence on Iranian-made drones.",
		"Ізраїль надає Україні інформацію щодо іранських безпілотників",
		"https://www.haaretz.com/israel-news/2022-10-13/ty-article/.premium/report-israel-providing-ukraine-with-intel-on-russias-iranian-drones/00000183-cfd6-d8cc-afc7-fffe2a4c0000"
	],
	[
		"2022-10-23",
		"Ukraine not cooperating with Israel on proposed missile alert system. Israeli officials believe Kyiv may be unhappy with the offer, as Jerusalem is refusing to supply it with interceptor systems. ",
		"Україна не співпрацює з Ізраїлем щодо запропонованої системи оповіщення про ракети. Ізраїльські офіційні особи вважають, що Київ може бути незадоволений цією пропозицією, оскільки Єрусалим відмовляється постачати системи перехоплення.",
		"https://www.timesofisrael.com/report-ukraine-not-cooperating-with-israel-on-proposed-missile-alert-system/amp/"
	],
	[
		"2022-10-23",
		"The Chicago Council on Global Affairs published report on its 2022 survey of American public opinion on U.S. foreign policy. It states that nearly three-quarters of Americans support continuing economic (71%) and military (72%) aid to Ukraine, and 58 percent are willing to continue to support the country “as long as it takes,” even if U.S. households will have to pay higher prices for gas and food.",
		"Чиказька Рада з Глобальних Справ (The Chicago Council on Global Affairs) опублікувала звіт про своє дослідження американської громадської думки щодо зовнішньої політики США у 2022 році. У ньому зазначено, що майже три чверті американців підтримують продовження економічної (71%) і військової (72%) допомоги Україні, а 58 відсотків готові продовжувати підтримувати країну «стільки, скільки буде потрібно», навіть якщо домогосподарства США будуть змушені платити вищі ціни за газ і їжу.",
		"https://www.globenewswire.com/Tracker?data=HXZ99wjde4jpd6JgTqs5_NgXH3mN-J5ItQVi_S1DYqudES_rYm6LC1OTT4EAapZeBRy3Nq4Jq0edpSI85VcjrWWkRgFtFNKz-0NeqK-t4NTDXPwKJzJteJFhpIsnMmBCHomLM9OI5mv8QFb5B9J1K61amudc5IuzoZ8sxzaAHZjnaQGAIP3t03b8os9wToOaKAMSsymXQMbGppdmNLi3ee-QQVzI3P2lPrjNTYfjUtcUOwE3-CwDv5nc6iwKXxRK3dwTvRqjxrXzrwJNDw5BVA=="
	],
	[
		"2022-10-25",
		"The United States is considering sending older HAWK air defense equipment from storage to Ukraine",
		"Сполучені Штати розглядають можливість відправлення Україні старих засобів протиповітряної оборони HAWK",
		"https://www.reuters.com/world/europe/exclusive-us-considers-hawk-air-defense-equipment-ukraine-say-us-officials-2022-10-25/"
	],
	[
		"2022-10-25",
		"30 lawmakers from the liberal wing of the Democratic Party pressed Biden in a letter to seek direct talks with Moscow. The letter didn’t explicitly threaten votes against further aid but it propose to \"pair the military and economic support the United States has provided to Ukraine with a proactive diplomatic push, redoubling efforts to seek a realistic framework for a ceasefire\". This letter has been recalled the next day.",
		"30 законодавців від ліберального крила Демократичної партії натиснули на Байдена в листі, щоб він домагався прямих переговорів з Москвою. У листі прямо не погрожували голосувати проти подальшої допомоги, але в ньому пропонується «поєднати військову та економічну підтримку, яку Сполучені Штати надали Україні, з активним дипломатичним поштовхом, подвоюючи зусилля для пошуку реалістичних рамок для припинення вогню». Цей лист був відкликаний наступного дня.",
		"https://www.washingtonpost.com/politics/2022/10/25/bidens-ukraine-policy-faces-bipartisan-squeeze/"
	],
	[
		"2022-10-25",
		"On Tuesday, October 25, 2022, German President Frank-Walter Steinmeier announced the delivery to Ukraine of two more MARS II M270 MLRS and four PzH 2000 155mm tracked self-propelled howitzers, as well as new air defense missile systems.",
		"Президент Німеччини Франк-Вальтер Штайнмаєр анонсував поставку в Україну ще двох РСЗВ MARS II M270 та чотирьох 155-мм гусеничних самохідних гаубиць PzH 2000, а також систем ППО",
		"https://www.armyrecognition.com/defense_news_october_2022_global_security_army_industry/germany_to_supply_ukraine_with_two_more_mars_ii_rocket_launchers_and_4_pzh_2000_155mm_howitzers.html"
	],
	[
		"2022-10-25",
		"Prime Minister Denys Shmyhal has announced an agreement with Germany on the increase of military aid for Ukraine in 2023 from EUR 690 million to more than EUR 2 billion.",
		"Прем'єр-міністр Денис Шмигаль заявив про домовленість з Німеччиною про збільшення військової допомоги Україні у 2023 році з 690 млн євро до понад 2 млрд євро.",
		"https://ukranews.com/en/news/890294-ukraine-agrees-with-germany-on-military-aid-increase-from-eur-690-million-to-eur-2-billion-in-2023"
	],
	[
		"2022-10-25",
		"The Biden administration's lifting of the U.S. arms embargo on Cyprus on Oct. 1 has rekindled the prospect of Nicosia transferring its Russian military arsenal to Ukraine in return for Western-made weaponry.",
		"Скасування адміністрацією Байдена ембарго США на постачання зброї на Кіпр 1 жовтня відродило перспективу того, що Нікосія передасть свій російський військовий арсенал Україні в обмін на зброю західного виробництва.",
		"https://www.forbes.com/sites/pauliddon/2022/10/25/cyprus-could-transfer-its-russian-weaponry-to-ukraine-if-guaranteed-swift-replacements/?sh=3a9ec7583d7d"
	],
	[
		"2022-10-26",
		"Up to 70 Australian defence force personnel will be deployed to the UK to train Ukrainian troops in the latest increase in Australia’s support for Kyiv. The Albanese government will provide Ukraine with 30 more Bushmaster protected mobility vehicles.",
		"До 70 військовослужбовців австралійських сил оборони буде направлено до Сполученого Королівства для навчання українських військових у рамках останнього збільшення підтримки Києва Австралією. Уряд Албанії надасть Україні ще 30 захищених мобілів Bushmaster.",
		"https://www.theguardian.com/australia-news/2022/oct/26/australian-defence-force-troops-to-train-ukrainian-soldiers-in-the-uk"
	],
	[
		"2022-10-26",
		"Sweden MoD could provide Ukraine with 12 of their 48 Archer 155mm 6x6 self-propelled howitzers",
		"Міноборони Швеції може надати Україні 12 із своїх 48 самохідних гаубиць Archer 155 мм 6x6",
		"https://www.armyrecognition.com/defense_news_october_2022_global_security_army_industry/sweden_mod_could_provide_ukraine_with_12_archer_155mm_8x8_self-propelled_howitzers.html"
	],
	[
		"2022-10-26",
		"Italian Prime Minister Giorgia Meloni said the only way to facilitate a peace deal between Russia and Ukraine is by helping Kyiv defend itself militarily.",
		"Прем’єр-міністр Італії Джорджія Мелоні заявила, що єдиний спосіб сприяти укладенню мирної угоди між Росією та Україною – це допомогти Києву захистити себе військовим шляхом.",
		"https://www.aljazeera.com/news/2022/10/26/meloni-wins-final-confidence-vote-pledges-support-for-ukraine"
	],
	[
		"2022-10-27",
		"The Pentagon is sending Ukraine a new $275 million package of weapons and other aid. Officials said there are no major new weapons in the package",
		"Пентагон надсилає Україні новий пакет зброї та іншої допомоги на суму 275 мільйонів доларів. Офіційні особи сказали, що в пакеті немає серйозної нової зброї",
		"https://apnews.com/article/russia-ukraine-europe-government-and-politics-db8dbbe1ce0032550208a43824853ad5"
	],
	[
		"2022-10-28",
		"South Korean President Yoon Suk-yeol has denied that Seoul provided any lethal weapons to Ukraine after Russian President Vladimir Putin said such a decision would destroy their bilateral relations.",
		"Президент Південної Кореї Юн Сук Йоль заперечив, що Сеул надав Україні будь-яку летальну зброю після того, як Путін заявив, що таке рішення зруйнує їхні двосторонні відносини",
		"https://www.aljazeera.com/news/2022/10/28/south-korea-denies-sending-weapons-to-ukraine-after-putin-remark"
	],
	[
		"2022-10-28",
		"At a conference in Moscow on Thursday, President Putin threatened South Korea with retaliation from North Korea if South Korea will continue to support Ukraine.",
		"На конференції в Москві в четвер Путін пригрозив Південній Кореї помстою з боку Північної Кореї, якщо Південна Корея продовжить підтримувати Україну.",
		"https://www.aljazeera.com/news/2022/10/28/south-korea-denies-sending-weapons-to-ukraine-after-putin-remark"
	],
	[
		"2022-10-29",
		"Slovenia handed over 28 modernized M-55S tanks to the Armed Forces of Ukraine.",
		"Словенія передала Збройним силам України 28 модернізованих танків М-55С.",
		"https://sundries.com.ua/en/ukraine-received-28-modernized-m-55s-tanks-with-a-new-gun-and-a-powerful-engine/"
	],
	[
		"2022-10-30",
		"Italy and France will supply Ukraine with SAMP-T Air Defense Systems. ",
		"Італія та Франція постачатимуть Україні ЗРК SAMP-T.",
		"https://www.reddit.com/r/UkrainianConflict/comments/yher1x/italy_and_france_will_supply_ukraine_with_sampt/"
	],
	[
		"2022-10-30",
		"The Swedish authorities are going to transfer more modern and heavier weapons to Ukraine, the new Swedish Defence Minister Paul Johansson has said, Dagens Nyheter reported. According to him, in particular, this applies to air defense systems.",
		"Влада Швеції збирається передати Україні більш сучасне та важке озброєння, заявив новий міністр оборони Швеції Пауль Йоханссон, повідомляє Dagens Nyheter. За його словами, зокрема, це стосується систем ППО.",
		"https://news.am/eng/news/727632.html"
	],
	[
		"2022-10-30",
		"The Italian Government has approved the supply of six PzH 2000 155mm self-propelled howitzers, two M270 MLRS (Multiple Launch Rocket System), 20 to 30 M109L 155mm self-propelled howitzers and dozen of M113 tracked APCs.",
		"Уряд Італії схвалив постачання шести 155-мм самохідних гаубиць PzH 2000, двох РСЗВ M270 (реактивної системи залпового вогню), 20-30 155-мм самохідних гаубиць M109L та десятки гусеничних БТРів М113.",
		"https://www.repubblica.it/esteri/2022/10/29/news/ucraina_kiev_armi_italia-372176795/"
	],
	[
		"2022-10-31",
		"Bulgaria doesn’t send weapons to Ukraine but Bulgarian arms manufacturers has so far supplied at least €1 billion of weapons and ammunition to Ukraine via brokers.",
		"Болгарія не постачає зброї в Україну, але болгарські виробники зброї наразі поставили в Україну через брокерів зброї та боєприпасів щонайменше на 1 мільярд євро.",
		"https://www.euractiv.com/section/all/short_news/bulgaria-doesnt-send-weapons-to-ukraine-but-arms-industry-flourishes/"
	],
	[
		"2022-10-31",
		"Israel will provide Ukraine with military communication systems.",
		"Ізраїль надасть Україні військові системи зв'язку.",
		"https://m.jpost.com/breaking-news/article-721137"
	],
	[
		"2022-10-31",
		"Ukraine receives first Armtrac 400 mine clearing vehicle from UK.",
		"Україна отримала від Великобританії першу машину для розмінування Armtrac 400.",
		"https://www.armyrecognition.com/ukraine_-_russia_conflict_war_2022/ukraine_receives_first_armtrac_400_mine_clearing_vehicle_from_uk.html"
	],
	[
		"2022-10-31",
		"Recent poll shows that despite a large proportion of Britons saying the situation in Ukraine is impacting their cost of living, few oppose supporting Ukraine through the conflict. Six in 10 (60%) support Britain’s current role in the conflict, including providing a range of economic, humanitarian and defensive military assistance to Ukraine, as well as imposing additional sanctions on Russia and Belarus.",
		"Нещодавнє опитування показує, що незважаючи на те, що значна частина британців каже, що ситуація в Україні впливає на їхню вартість життя, мало хто виступає проти підтримки України в конфлікті. Шість із 10 (60%) підтримують нинішню роль Великобританії в конфлікті, включаючи надання ряду економічної, гуманітарної та військової допомоги Україні, а також запровадження додаткових санкцій проти Росії та Білорусі.",
		"https://www.ipsos.com/en-uk/public-continues-support-britains-role-ukraine-conflict"
	],
	[
		"2022-11-02",
		"Italy freezes military aid to Ukraine. Need to coordinate with NATO.",
		"Італія заморозила військову допомогу Україні. Потрібна координація з НАТО.",
		"https://www.rt.com/news/565815-italy-ukraine-military-aid/"
	],
	[
		"2022-11-02",
		"Turkish drone maker Baykar is planning to complete the construction of its manufacturing plant in Ukraine in two years.",
		"Турецький виробник безпілотників Baykar планує завершити будівництво заводу в Україні за два роки.",
		"https://militaryleak.com/2022/11/02/turkish-drone-maker-baykar-to-complete-plant-in-ukraine-in-two-years/"
	],
	[
		"2022-11-02",
		"According to journalist and political analyst Nikola Mikovic, the Jewish state could eventually start providing weapons to Ukraine – although Israeli officials are unlikely to publicly confirm it.",
		"За словами журналіста та політолога Ніколи Міковича, єврейська держава може з часом почати постачати зброю в Україну, хоча ізраїльські офіційні особи навряд чи публічно це підтвердять.",
		"https://theloop.ecpr.eu/ukraine-has-asked-israel-for-weapons-support-and-they-might-eventually-get-it/"
	],
	[
		"2022-11-02",
		"The Jamestown Foundation has assessed that the true amount for Russian defense spending in 2022 may well reach as much as 5.5 trillion rubles ($90.9 billion) by the end of the year. If the rate of military aid to Ukranian will remain the same till the end of 2022, it will be just 62% of Russian military budget.",
		"Джеймстаунський фонд підрахував, що справжня сума російських витрат на оборону в 2022 році цілком може сягнути 5,5 трильйонів рублів (90,9 мільярдів доларів) до кінця року. Якщо обсяг військової допомоги Україні залишиться таким же до кінця 2022 року, то він становитиме лише 62% російського військового бюджету.",
		"https://www.newsweek.com/fact-check-ukraine-military-aid-russia-defense-budget-1756393"
	],
	[
		"2022-11-03",
		"German Defence Minister Christine Lambrecht had written to the government in Bern asking for permission to supply 12,400 rounds of Swiss-made ammunition for Gepard anti-aircraft tanks, but Switzerland has again rejected an appeal from Germany to allow it to re-export Swiss-made ammunition to Ukraine. ",
		"Міністр оборони Німеччини Крістін Ламбрехт звернулася до уряду в Берні з проханням надати дозвіл на поставку 12 400 боєприпасів швейцарського виробництва для зенітних танків Gepard, але Швейцарія знову відхилила звернення Німеччини дозволити їй реекспорт боєприпасів швейцарського виробництва в Україну.",
		"https://www.reuters.com/world/europe/swiss-government-rejects-german-request-re-export-swiss-ammunition-ukraine-2022-11-03/"
	],
	[
		"2022-11-03",
		"Bulgarian lawmakers approved the first military aid shipments to Ukraine, ending months of resistance from Russia-friendly political parties and the nation’s president.",
		"Болгарські законодавці схвалили перші поставки військової допомоги Україні, поклавши край місяцям опору з боку дружніх до Росії політичних партій і президента країни.",
		"https://www.bloomberg.com/news/articles/2022-11-03/bulgaria-breaks-taboo-and-backs-first-military-aid-for-ukraine"
	],
	[
		"2022-11-04",
		"France Plans to Provide Ukraine with Crotale Surface-to-air Missile System",
		"Франція планує надати Україні зенітно-ракетний комплекс Crotale",
		"https://militaryleak.com/2022/11/04/france-plans-to-provide-ukraine-with-crotale-surface-to-air-missile-system/"
	],
	[
		"2022-11-04",
		"The United States on Friday announced an additional $400 million in military aid to Ukraine from USAI fund, which includes money to refurbish HAWK air defense missiles and 45 Czech T-72B tanks, 1,100 Phoenix Ghost drones, 40 armored riverine boats, funding to refurbish 250 M-1117 armored vehicles, tactical secure communications systems, surveillance systems and funding for training, maintenance and sustainment.",
		"У п’ятницю Сполучені Штати оголосили про виділення Україні додаткових 400 мільйонів доларів військової допомоги від фонду USAI, який включає кошти на модернізацію ППО HAWK та 45 чеських танків T-72B, 1100 дронів Phoenix Ghost, 40 броньованих річкових катерів, фінансування на модернізацію 250 броньованих машин M-1117, тактичні системи безпечного зв'язку, системи спостереження та фінансування навчання, технічного обслуговування та забезпечення.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3210698/aid-package-to-ukraine-includes-t-72b-tanks/"
	],
	[
		"2022-11-04",
		"Italian Premier Giorgia Meloni's new government is set to approve Italy's sixth package of military aid for Ukraine.",
		"Новий уряд прем'єр-міністра Італії Джорджії Мелоні має намір затвердити шостий пакет військової допомоги Італії Україні.",
		"https://www.ansa.it/english/news/politics/2022/11/04/ukraine-sixth-military-aid-package-coming-says-crosetto_eb40769e-b41e-4f0f-bdb9-5d2633ad7529.html"
	],
	[
		"2022-11-05",
		"The Ministries of Defense of the Netherlands, the Czech Republic and the US Department of Defense jointly announced about reaching an agreement to support Ukraine by overhauling 90 T-72B tanks.",
		"Міністерства оборони Нідерландів, Чехії та Міністерства оборони США спільно заявили про досягнення домовленості про підтримку України капітальним ремонтом 90 танків Т-72Б.",
		"https://en.defence-ua.com/weapon_and_tech/the_czech_republic_to_update_90_t_72b_tanks_for_ukraine_worth_1_million_dollars_each_the_arrival_dates_of_vehles_are_named-4755.html"
	]
]