[
	[
		"2025-02-23",
		"Estonia is sending 10,000 artillery shells and 750,000 food packages for Ukrainian soldiers.",
		"Естонія відправляє 10 000 артилерійських снарядів та 750 000 продуктових наборів для українських солдатів",
		"https://global.espreso.tv/world-about-ukraine-estonia-announces-new-military-aid-package-for-ukraine-whats-included"
	],
	[
		"2025-02-22",
		"France and Italy are slowing down the adoption of the EU's €20 billion military aid package for Ukraine due to budget constraints. The package includes 1.5 million rounds of ammunition and air defense support, but the time for approval is limited.",
		"Франція та Італія сповільнюють ухвалення пакету військової допомоги ЄС для України на суму 20 мільярдів євро через бюджетні обмеження. Пакет включає 1,5 мільйона боєприпасів і підтримку протиповітряної оборони, але час на його ухвалення обмежений.",
		"https://unn.ua/en/news/france-italy-block-euro20-billion-eu-military-aid-package-for-ukraine-spiegel"
	],
	[
		"2025-02-22",
		"Italian defense analyst has reported that multiple B1 Centauro wheeled tank destroyers are being sent to Ukraine. While the exact number remains undisclosed, this development suggests a potential expansion of Western military aid to Kyiv.",
		"Італійський оборонний аналітик повідомив, що в Україну відправляють кілька колісних танкових есмінців B1 Centauro. Хоча точна кількість залишається нерозкритою, ця подія свідчить про потенційне розширення західної військової допомоги Києву.",
		"https://defence-blog.com/italy-reportedly-sending-b1-centauros-to-ukraine/"
	],
	[
		"2025-02-16",
		"Trump administration officially proposes rare earth mineral deal with Ukraine in exchange for military aid.",
		"Адміністрація Трампа офіційно запропонувала Україні угоду про постачання рідкоземельних мінералів в обмін на військову допомогу.",
		"https://www.dimsumdaily.hk/trump-administration-officially-proposes-rare-earth-mineral-deal-with-ukraine-in-exchange-for-military-aid/"
	],
	[
		"2025-02-15",
		"Norway is joining the international drone coalition for Ukraine.",
		"Норвегія приєднується до міжнародної коаліції безпілотників для України.",
		"https://x.com/Forsvarsdep/status/1890693771500589219"
	],
	[
		"2025-02-14",
		"The United Kingdom has begun supplying Ukraine with the Gravehawk, a newly developed air defense system designed to integrate Soviet-era missiles into a modern, ground-based platform.",
		"Велика Британія почала постачати Україні «Грейвхок» - нову систему протиповітряної оборони, розроблену для інтеграції ракет радянських часів у сучасну наземну платформу.",
		"https://www.newsweek.com/gravehawk-shipping-container-air-defense-uk-ukraine-2031396"
	],
	[
		"2025-02-13",
		"The British Ministry of Defense announced a new £150 million military aid package for Ukraine which includes drones, T-72 main battle tanks (MBTs), and air defense systems.",
		"Міністерство оборони Великої Британії оголосило про новий пакет військової допомоги Україні на суму 150 мільйонів фунтів стерлінгів, який включає безпілотники, основні бойові танки (ОБТ) Т-72 та системи протиповітряної оборони.",
		"https://www.armyrecognition.com/news/army-news/2025/flash-news-uk-announces-new-military-aid-to-ukraine-including-t-72-tanks"
	],
	[
		"2025-02-13",
		"The Dutch Ministry of Defense is sending YPR armored infantry vehicles to Ukraine. The package will consist of 25 vehicles in a medical transport configuration.",
		"Міністерство оборони Нідерландів відправляє в Україну броньовані піхотні машини YPR. Пакет складатиметься з 25 машин у конфігурації медичного транспорту.",
		"https://thedefensepost.com/2025/02/13/ukraine-ypr-netherlands/"
	],
	[
		"2025-02-13",
		"The Norwegian government has decided to spend another NOK 1.2 billion ($108 mln.) on air defense measures for Ukraine.",
		"Уряд Норвегії вирішив витратити ще 1,2 млрд норвезьких крон ($108 млн) на заходи протиповітряної оборони для України.",
		"https://interfax.com.ua/news/general/1047599.html"
	],
	[
		"2025-02-13",
		"The U.K. has now given Ukraine 500,000 rounds of artillery ammunition, valued at more than £1 billion (€1.2 billion), the British Ministry of Defence announced.",
		"Велика Британія передала Україні 500 000 артилерійських боєприпасів на суму понад 1 мільярд фунтів стерлінгів (1,2 мільярда євро), повідомило Міністерство оборони Великої Британії",
		"https://tvpworld.com/85032806/uk-artillery-ammunition-deliveries-to-ukraine-reach-500000-rounds"
	],
	[
		"2025-02-13",
		"Germany has announced the delivery of 6,000 modern AI-powered HX-2 kamikaze drones to Ukraine. ",
		"Німеччина оголосила про постачання Україні 6 000 сучасних дронів-камікадзе HX-2 на базі штучного інтелекту. ",
		"https://unn.ua/en/news/kamikaze-drones-with-ai-germany-announces-new-military-aid-to-ukraine"
	],
	[
		"2025-02-08",
		"Lithuania has donated trucks and spare parts for American M113 armored personnel carriers to the Ukrainian Defense Forces.",
		"Литва передала Збройним силам України вантажівки та запчастини до американських бронетранспортерів М113.",
		"https://mil.in.ua/en/news/lithuania-donates-trucks-and-spare-parts-for-armored-personnel-carriers-to-ukraine/"
	],
	[
		"2025-02-08",
		"Bulgaria stands to receive about €500 million from its military support to Ukraine over the past three years. Sofia benefited from about €300 million in compensation from the United States and the European Commission for sending Soviet-era military hardware to Kyiv. It also received €174 million from Denmark as part of two contracts to support Ukraine’s military in its struggle against the Russian invasion.",
		"Болгарія може отримати близько 500 мільйонів євро від військової підтримки України за останні три роки. Софія отримала близько 300 мільйонів євро компенсації від США та Європейської комісії за відправку до Києва військової техніки радянських часів. Вона також отримала 174 мільйони євро від Данії в рамках двох контрактів на підтримку українських військових у боротьбі проти російського вторгнення.",
		"https://www.telegraph.co.uk/world-news/2025/02/07/bulgaria-to-make-500m-from-military-aid-to-ukraine/"
	],
	[
		"2025-02-07",
		"Ukraine’s air force has received F-16s from the Netherlands.",
		"Військово-повітряні сили України отримали винищувачі F-16 від Нідерландів.",
		"https://edition.cnn.com/2025/02/07/europe/ukraine-france-mirage-fighter-jets-intl-hnk-ml/index.html"
	],
	[
		"2025-02-06",
		"Ukraine received the first Mirage 2000 fighter jets from France.",
		"Україна отримала перші винищувачі Mirage 2000 від Франції.",
		"https://www.defensenews.com/global/europe/2025/02/06/ukraine-receives-first-mirage-2000-fighter-jets-from-france/"
	],
	[
		"2025-02-06",
		"A majority of German citizens support providing military assistance to Ukraine, with a significant portion advocating for increased aid, according to a new poll by the Wahlen research group.",
		"Більшість громадян Німеччини підтримують надання військової допомоги Україні, причому значна частина виступає за її збільшення, згідно з новим опитуванням, проведеним дослідницькою групою Wahlen.",
		"https://kyivindependent.com/majority-of-germans-support-military-aid-to-ukraine-survey-shows/"
	],
	[
		"2025-01-31",
		"Finland has provided Ukraine with its 27th military aid package, totaling 198 million euros.",
		"Фінляндія надала Україні 27-й пакет військової допомоги на загальну суму 198 мільйонів євро.",
		"https://odessa-journal.com/ukraine-will-receive-a-new-aid-package-from-finland-worth-nearly-200-million-euros"
	],
	[
		"2025-01-31",
		"Ukraine to ratify a defense agreement with the UK, securing £2 billion for air defense, missile systems, and military repair bases.",
		"Україна ратифікує оборонну угоду з Великою Британією, що передбачає виділення 2 мільярдів фунтів стерлінгів на протиповітряну оборону, ракетні системи та військові ремонтні бази.",
		"https://odessa-journal.com/the-united-kingdom-is-allocating-2-billion-in-military-aid-to-ukraine"
	],
	[
		"2025-01-30",
		"Sweden will provide Ukraine with a military aid package worth over $1.2 billion.",
		"Швеція надасть Україні пакет військової допомоги на суму понад $1,2 млрд.",
		"https://kyivindependent.com/sweden-unveils-its-largest-military-aid-package-for-ukraine-worth-1-2-billion/"
	],
	[
		"2025-01-30",
		"Germany’s budget committee has called Finance Minister Joerg Kukies to approve an additional €3 billion in military aid for Ukraine.",
		"Бюджетний комітет Німеччини закликав міністра фінансів Йорга Кукіса затвердити додаткові 3 мільярди євро військової допомоги для України.",
		"https://mil.in.ua/en/news/bundestag-calls-for-additional-e3-billion-for-military-aid-to-ukraine/"
	],
	[
		"2025-01-29",
		"Croatia will provide Ukraine with a new package of military and technical assistance.",
		"Хорватія надасть Україні новий пакет військово-технічної допомоги.",
		"https://mil.in.ua/en/news/croatia-is-preparing-a-military-aid-package-for-ukraine/"
	],
	[
		"2025-01-29",
		"The United States has transferred around 90 Patriot missiles from storage in Israel to Poland for delivery to Ukraine.",
		"Сполучені Штати передали близько 90 ракет Patriot зі сховища в Ізраїлі до Польщі для доставки в Україну.",
		"https://kyivindependent.com/us-transfers-90-patriot-missiles-from-israel-to-ukraine-axios-reports/"
	],
	[
		"2025-01-28",
		"The Italian parliament's lower house on Jan. 28 approved the prolongation of military support for Ukraine until Dec. 31, 2025.",
		"Нижня палата італійського парламенту 28 січня схвалила продовження військової підтримки України до 31 грудня 2025 року.",
		"https://kyivindependent.com/italian-parliament-approves-extension-of-military-assistance-to-ukraine-in-2025/"
	]
]