[
	[
		"2024-05-19",
		"Ukrainian forces have reportedly adapted their 9K33M Osa (Sa-8B) Surface-to-Air Missile (SAM) systems to fire R-73 Air-to-Air Missiles (AAMs). ",
		"Як повідомляється, українські війська адаптували свої зенітно-ракетні комплекси (ЗРК) 9К33М \"Оса\" (Са-8Б) для стрільби ракетами Р-73 \"Повітря-повітря\" (ПЗРК). ",
		"https://armyrecognition.com/news/army-news/army-news-2024/ukraine-modifies-soviet-made-sa-8-air-defense-systems-to-fire-r-73-missiles-following-delays-in-military-aid"
	],
	[
		"2024-05-19",
		"On Monday 20 May, the UN Security Council will discuss military assistance to Ukraine at Russia's request. The Russian delegation will once again try to \"condemn\" the supply of Western weapons to the Ukrainian army.",
		"У понеділок, 20 травня, Рада Безпеки ООН обговорюватиме військову допомогу Україні на прохання Росії. Російська делегація вкотре спробує \"засудити\" постачання західної зброї українській армії.",
		"https://menafn.com/1108229838/UN-Security-Council-To-Discuss-Military-Aid-To-Ukraine-At-Russias-Request"
	],
	[
		"2024-05-18",
		"\nGovernments face increased borrowing, taxes and public sector cuts to finance their soaring military budgets. European NATO members are set to spend a record $380 billion on defense this year — a tough sell to voters.",
		"Уряди стикаються зі збільшенням запозичень, податків і скороченнями в державному секторі для фінансування своїх стрімко зростаючих військових бюджетів. Цього року європейські члени НАТО планують витратити на оборону рекордні 380 мільярдів доларів, що буде нелегким завданням для виборців.",
		"https://www.dw.com/en/ukraine-war-the-trillion-dollar-cost-to-the-west/a-69106932"
	],
	[
		"2024-05-16",
		"Gen. Charles Q. Brown Jr., the chairman of the Joint Chiefs of Staff, said on Thursday that a NATO deployment of US trainers in Ukraine appeared inevitable.",
		"Генерал Чарльз Браун-молодший, голова Об'єднаного комітету начальників штабів, заявив у четвер, що розгортання американських інструкторів НАТО в Україні видається неминучим.",
		"https://www.nytimes.com/2024/05/16/us/politics/nato-ukraine.html"
	],
	[
		"2024-05-16",
		"The Danish government announced a new package of military assistance for Ukraine worth 5.6 billion Danish kroner (~$815 million). The package is the 18th such delivery of military aid, the Danish Defense Ministry said. It includes 2.4 billion Danish kroner ($349 million) earmarked for air defense, as well as artillery pieces, shells, and other ammunition.",
		"Уряд Данії оголосив про новий пакет військової допомоги Україні на суму 5,6 млрд данських крон (~815 млн доларів). Цей пакет є 18-им за рахунком надання військової допомоги, повідомляє Міністерство оборони Данії. Він включає 2,4 млрд данських крон ($349 млн), призначених для протиповітряної оборони, а також артилерійські гармати, снаряди та інші боєприпаси.",
		"https://kyivindependent.com/denmark-announces-more-than-850-million-in-new-military-assistance-for-ukraine/"
	],
	[
		"2024-05-16",
		"According to the German Minister of Defence Boris Pistorius, Lithuania is contributing to the German IAAD initiative which aims to strengthen the Ukrainian air defence with six AMBER-1800 air surveillance radars. He did not provide any further details such as a planned delivery date.",
		"За словами міністра оборони Німеччини Бориса Пісторіуса, Литва робить свій внесок у німецьку ініціативу IAAD, яка має на меті посилити українську протиповітряну оборону шістьма радарами повітряного спостереження AMBER-1800. Він не надав жодних додаткових деталей, таких як запланована дата поставки.",
		"https://x.com/deaidua/status/1791183185969135859"
	],
	[
		"2024-05-15",
		"France will deliver extra military aid to Ukraine in coming days and weeks, the Elysee said on Tuesday, after President Emmanuel Macron spoke by phone with Ukrainian President Volodymyr Zelenskiy.",
		"Франція надасть додаткову військову допомогу Україні в найближчі дні і тижні, заявив Єлисейський палац у вівторок після телефонної розмови президента Еммануеля Макрона з президентом України Володимиром Зеленським.",
		"https://www.msn.com/en-gb/news/world/france-to-send-extra-military-aid-to-ukraine-shortly-says-elysee/ar-BB1mniJg"
	],
	[
		"2024-05-14",
		"Secretary of State Antony Blinken met with Ukrainian President Volodymyr Zelensky in Kiyv Tuesday, the start of a two-day visit to Ukraine to buttress the morale of the government in Kyiv and help channel the delivery of newly approved U.S. aid to help resist a grinding Russian offensive.",
		"Державний секретар США Ентоні Блінкен зустрівся з президентом України Володимиром Зеленським у вівторок у Києві, що стало початком дводенного візиту до України з метою підтримати моральний дух уряду в Києві та допомогти спрямувати нещодавно затверджену американську допомогу, щоб допомогти протистояти наступу Росії.",
		"https://www.wsj.com/world/blinken-arrives-in-ukraine-to-boost-spirits-funnel-u-s-military-aid-6a7d77a6"
	],
	[
		"2024-05-14",
		"H&K plans to produce their weapons in Soviet calibers to help Ukrainian troops.",
		"H&K планує виробляти свою зброю в радянських калібрах, щоб допомогти українським військовим.",
		"https://www.welt.de/wirtschaft/article251409022/Ruestungsindustrie-Der-grosse-Kalaschnikow-Plan-von-Heckler-Koch.html"
	],
	[
		"2024-05-12",
		"According to the British Minister of Defense, the British army has 632 Warrior combat vehicles on its balance, which are presented in the form of infantry fighting vehicles, command vehicles, artillery reconnaissance vehicles, repair and recovery vehicles, and artillery fire control vehicles. In addition, he noted that as the write-off process is already underway, more than 80 combat vehicles are planned to be disposed of in 2025.",
		"За словами британського міністра оборони, на балансі британської армії перебуває 632 бойові машини Warrior, які представлені у вигляді бойових машин піхоти, командних машин, артилерійських розвідувальних машин, ремонтно-евакуаційних машин та машин управління вогнем артилерії. Крім того, він зазначив, що оскільки процес списання вже триває, у 2025 році планується утилізувати понад 80 бойових машин.",
		"https://mil.in.ua/en/news/britain-to-dispose-of-80-warrior-infantry-fighting-vehicles-in-2025/"
	],
	[
		"2024-05-10",
		"The Department of Defense (DoD) announced the fifty-seventh tranche of equipment to be provided from DoD inventories for Ukraine. This Presidential Drawdown Authority (PDA) package has an estimated value of $400 million and includes capabilities to support Ukraine's most urgent battlefield requirements, including air defense, artillery rounds, armored vehicles, and anti-tank weapons.",
		"Міністерство оборони (МО) США оголосило про надання Україні п'ятдесят сьомого траншу обладнання зі складів МО США. Цей пакет, наданий в рамках повноважень Президента США щодо скорочення озброєнь (PDA), оцінюється в 400 мільйонів доларів США і включає засоби для забезпечення найбільш нагальних потреб України на полі бою, включаючи засоби протиповітряної оборони, артилерійські боєприпаси, бронетехніку та протитанкові озброєння.",
		"https://www.defense.gov/News/Releases/Release/Article/3771984/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2024-05-05",
		"The US Government is in negotiations with other G7 countries to provide Ukraine with $50 bln. support package which will be financed mostly from the frozen Russian assets.",
		"Уряд США веде переговори з іншими країнами \"Великої сімки\" про надання Україні пакету підтримки на суму 50 млрд доларів, який буде фінансуватися переважно за рахунок заморожених російських активів.",
		"https://www.bloomberg.com/news/articles/2024-05-03/g-7-eyes-plan-on-us-led-50-billion-aid-package-for-ukraine"
	],
	[
		"2024-05-04",
		"The Commander of the Estonian Defence Forces suggested preparing for a possible blockade of the Baltic Sea for Russia.",
		"Командувач Сил оборони Естонії запропонував готуватися до можливої блокади Балтійського моря для Росії.",
		"https://mil.in.ua/en/news/estonia-proposes-to-blockade-the-baltic-sea-for-russia/"
	],
	[
		"2024-05-03",
		"British Foreign Secretary David Cameron promised three billion pounds ($3.74 billion) of annual military aid for Ukraine for \"as long as it takes\", adding that London had no objection to the weapons being used inside Russia.",
		"Міністр закордонних справ Великобританії Девід Кемерон пообіцяв три мільярди фунтів стерлінгів ($3,74 млрд) щорічної військової допомоги Україні \"стільки, скільки буде потрібно\", додавши, що Лондон не заперечує проти використання зброї всередині Росії.",
		"https://www.reuters.com/world/uk/britains-cameron-kyiv-promises-ukraine-aid-as-long-it-takes-2024-05-02/"
	],
	[
		"2024-05-03",
		"Ukraine’s president and foreign minister have pressed British Foreign Secretary David Cameron to accelerate the delivery of promised military aid to Kyiv.",
		"Президент і міністр закордонних справ України закликали міністра закордонних справ Великої Британії Девіда Кемерона прискорити надання Києву обіцяної військової допомоги.",
		"https://www.irishexaminer.com/world/arid-41387779.html"
	],
	[
		"2024-05-03",
		"The Italian government has included an additional battery of the SAMP/T air defense system in the new military aid package for Ukraine.",
		"Уряд Італії включив додаткову батарею системи протиповітряної оборони SAMP/T до нового пакету військової допомоги Україні.",
		"https://mil.in.ua/en/news/italy-plans-to-provide-ukraine-with-additional-samp-t-air-defense-systems/"
	],
	[
		"2024-05-02",
		"French President Emmanuel Macron said he has not ruled out sending ground troops to Ukraine if Russia breaks through Ukrainian front lines and the government in Kyiv made such a request.",
		"Президент Франції Еммануель Макрон заявив, що не виключає введення сухопутних військ в Україну, якщо Росія прорве українську лінію фронту і уряд у Києві звернеться з таким проханням.",
		"https://ca.news.yahoo.com/nato-country-said-could-join-112923689.html"
	],
	[
		"2024-04-30",
		"Norway has made a decision to allocate an additional $600 million to support Ukraine.",
		"Норвегія прийняла рішення про виділення додаткових 600 мільйонів доларів на підтримку України.",
		"https://x.com/ZelenskyyUa/status/1785340280926806342"
	],
	[
		"2024-04-30",
		"The government of Latvia has just approved the transfer of NBS anti-aircraft guns, tactical unmanned surveillance systems, as well as other essential material and technical assets to the Armed Forces of Ukraine.",
		"Уряд Латвії щойно схвалив передачу Збройним силам України зенітних гармат NBS, тактичних безпілотних систем спостереження, а також інших необхідних матеріально-технічних засобів.",
		"https://x.com/DefenceU/status/1785303619622883330"
	],
	[
		"2024-04-29",
		"Australia, one of Ukraine's largest non-NATO donors, has announced a military aid package worth around $65 million to support Kyiv’s war effort following Russia’s invasion. The package includes funding for drones, short-range air defense systems, inflatable boats and generators, as well as equipment like helmets, masks and boots.",
		"Австралія, один з найбільших донорів України поза межами НАТО, оголосила про надання військової допомоги на суму близько 65 мільйонів доларів для підтримки військових зусиль Києва після вторгнення Росії. Пакет включає фінансування безпілотників, систем протиповітряної оборони ближнього радіусу дії, надувних човнів і генераторів, а також обладнання, такого як шоломи, маски і черевики.",
		"https://www.voanews.com/a/australia-boosts-military-aid-to-ukraine-/7588968.html"
	],
	[
		"2024-04-28",
		"A former us Lt and military expert has warned that Russia will “win” the war and it is “almost impossible for Ukraine to win.”",
		"Колишній американський лейтенант і військовий експерт попередив, що Росія \"виграє\" війну, а Україні \"майже неможливо перемогти\".",
		"https://londonlovesbusiness.com/us-military-expert-warns-its-almost-impossible-for-ukraine-to-win/"
	],
	[
		"2024-04-28",
		"Australia backs Ukraine with $100-mln military aid",
		"Австралія підтримала Україну військовою допомогою на $100 млн",
		"https://www.yahoo.com/news/australia-backs-ukraine-100-mln-071957070.html"
	],
	[
		"2024-04-28",
		"Estonian Center for Defense Investments (RKIK) and the eState Academy will use European Peace Facility resources to procure various nonlethal military equipment for Moldovan armed forces. A contract for passive radars has been signed with a Czech company.",
		"Естонський центр оборонних інвестицій (RKIK) та Академія електронної держави використовуватимуть ресурси Європейського фонду миру для закупівлі різного нелетального військового обладнання для збройних сил Молдови. З чеською компанією було підписано контракт на поставку пасивних радарів.",
		"https://news.err.ee/1609326753/estonia-to-procure-military-equipment-for-moldova-and-ukraine"
	],
	[
		"2024-04-27",
		"The US will \"rush\" Patriot air defense missiles to Ukraine as part of a military aid package, Defense Secretary Lloyd Austin has said.",
		"США \"поспішатимуть\" з ракетами ППО Patriot в Україну в рамках пакету військової допомоги, заявив міністр оборони Ллойд Остін.",
		"https://www.businessinsider.com/us-to-rush-patriot-missiles-to-ukraine-amid-russian-airstrikes-2024-4"
	],
	[
		"2024-04-27",
		"British and American defence pledges for Ukraine should inspire other countries to follow suit, Kaja Kallas, the prime minister of Estonia, has said.",
		"Обіцянки Великої Британії та США щодо підтримки України повинні надихнути інші країни наслідувати їхній приклад, заявила Кая Каллас, прем'єр-міністр Естонії.",
		"https://www.telegraph.co.uk/world-news/2024/04/27/uk-and-us-ukraine-aid-must-inspire-others-says-kaja-kallas/"
	],
	[
		"2024-04-26",
		"The Department of Defense (DoD) announced a historic new security assistance package valued at $6 bln. to address Ukraine's ongoing battlefield needs and demonstrate unwavering U.S. support for Ukraine. This package, provided through the Ukraine Security Assistance Initiative (USAI) includes additional munitions for Patriot air defense systems; additional munitions for National Advanced Surface-to-Air Missile Systems (NASAMS); equipment to integrate Western air defense launchers, missiles, and radars with Ukraine's air defense systems; counter-UAS equipment and systems; munitions for laser-guided rocket systems; multi-mission radars; counter-artillery radars; additional ammunition for High Mobility Artillery Rocket Systems (HIMARS); 155mm and 152mm artillery rounds; precision aerial munitions; Switchblade and Puma Unmanned Aerial Systems (UAS); tactical vehicles to tow weapons and equipment; demolition munitions; components to support Ukrainian production of UAS and other capabilities; small arms and additional small arms ammunition and ancillary items and support for training, maintenance, and sustainment activities.",
		"Міністерство оборони (МО) США оголосило про надання нового історичного пакету допомоги у сфері безпеки на суму 6 млрд. доларів для задоволення поточних потреб України на полі бою та демонстрації непохитної підтримки України з боку США. Цей пакет, що надається в рамках Ініціативи безпекової допомоги Україні (USAI), включає додаткові боєприпаси для систем ППО Patriot; додаткові боєприпаси для національних передових зенітно-ракетних комплексів (NASAMS); обладнання для інтеграції західних пускових установок, ракет і радарів з українськими системами ППО; обладнання та системи протидії БПЛА; боєприпаси для ракетних систем з лазерним наведенням; багатоцільові радіолокаційні станції; контр-артилерійські радіолокаційні станції; додаткові боєприпаси для високомобільних артилерійських ракетних систем (HIMARS); артилерійські снаряди калібру 155 мм і 152 мм; високоточні авіаційні боєприпаси; безпілотні авіаційні комплекси (БАК) Switchblade і Puma; тактичні транспортні засоби для буксирування озброєння і техніки; боєприпаси для підриву; компоненти для підтримки українського виробництва БАК та інших засобів; стрілецька зброя і додаткові боєприпаси до стрілецької зброї, а також допоміжні засоби, підтримка для тренувань, технічного обслуговування і забезпечення діяльності.",
		"https://www.defense.gov/News/Releases/Release/Article/3757794/biden-administration-announces-historic-new-security-assistance-package-for-ukr/"
	]
]