[
	[
		"2025-01-12",
		"Annalena Baerbock, German Foreign Minister and co-leader of the Greens, insists that Berlin should provide Ukraine with more military aid than currently planned in the budget.",
		"Анналена Бербок, міністр закордонних справ Німеччини та співголова партії Зелених, наполягає на тому, що Берлін повинен надати Україні більше військової допомоги, ніж зараз заплановано в бюджеті.",
		"https://www.pravda.com.ua/eng/news/2025/01/12/7493144/"
	],
	[
		"2025-01-12",
		"Germany will deploy two Patriot air defense systems in Poland to protect the logistics center of international military assistance to Ukraine.",
		"Німеччина розмістить у Польщі два комплекси ППО Patriot для захисту логістичного центру міжнародної військової допомоги Україні.",
		"https://mil.in.ua/en/news/germany-to-deploy-patriot-air-defense-systems-in-poland-to-protect-aid-center-for-ukraine/"
	],
	[
		"2025-01-12",
		"Ukraine will receive 30,000 new surveillance and attack drones as part of a multinational initiative jointly led by Latvia and the United Kingdom.",
		"Україна отримає 30 000 нових розвідувальних і ударних безпілотників в рамках багатонаціональної ініціативи, яку спільно очолюють Латвія і Велика Британія.",
		"https://www.aviacionline.com/international-support-grows-ukraine-to-receive-advanced-drones-and-defense-funds"
	],
	[
		"2025-01-11",
		"US President Joe Biden’s administration has not managed to use nearly US$4 billion of the aid package for Ukraine approved by Congress in April.",
		"Адміністрація президента США Джо Байдена не змогла використати майже 4 мільярди доларів США з пакету допомоги Україні, схваленого Конгресом у квітні.",
		"https://www.pravda.com.ua/eng/news/2025/01/11/7493005/"
	],
	[
		"2025-01-09",
		"Norway has allocated 2 billion euros  ($2.1 billion) for military aid to Ukraine in 2025.",
		"Норвегія виділила 2 мільярди євро ($2,1 мільярда) на військову допомогу Україні у 2025 році.",
		"https://kyivindependent.com/norway-allocates-over-2-billion-in-military-aid-for-ukraine-in-2025-umerov-says/"
	],
	[
		"2025-01-09",
		"The Department of Defense (DoD) announced additional Presidential Drawdown Authority (PDA) package, which has an estimated value of $500 million, which includes: missiles for air defense; air-to-ground munitions; and equipment to support Ukraine's use of F-16s.",
		"Міністерство оборони (МО) оголосило про додатковий пакет президентських повноважень зі скорочення озброєнь (PDA), який оцінюється в 500 млн доларів і включає: ракети для протиповітряної оборони; боєприпаси класу «повітря-земля»; а також обладнання для підтримки використання Україною F-16.",
		"https://www.defense.gov/News/Releases/Release/Article/4025039/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2024-12-28",
		"Greece will provide Ukraine with 24 RIM-7 Sea Sparrow anti-aircraft missiles. This transfer is part of Greece’s broader military aid to Ukraine, which includes artillery shells, weaponry and ammunition. ",
		"Греція надасть Україні 24 зенітні ракети RIM-7 Sea Sparrow.",
		"https://www.ekathimerini.com/politics/foreign-policy/1257256/greece-to-send-sea-sparrows-to-ukraine/"
	],
	[
		"2024-12-28",
		"The Netherlands is planning to provide an additional 6 billion euros (some $6.24 billion) in military aid to Ukraine, Dutch Ambassador to Ukraine Alle Dorhout has said.",
		"Нідерланди планують надати Україні додатково 6 мільярдів євро (близько 6,24 мільярдів доларів) військової допомоги, заявив посол Нідерландів в Україні Алле Дорхаут.",
		"https://www.thestatesman.com/world/netherlands-plans-to-provide-6-billion-euros-in-additional-military-aid-to-ukraine-1503380454.html"
	],
	[
		"2024-12-27",
		"Germany allocated a new military aid package to Ukraine, including IRIS-T air defense systems, Patriot systems, Leopard 1A5 tanks, and Gepard self-propelled anti-aircraft guns.",
		"Німеччина виділила Україні новий пакет військової допомоги, що включає системи протиповітряної оборони IRIS-T, системи Patriot, танки Leopard 1A5 та самохідні зенітні установки Gepard.",
		"https://english.nv.ua/nation/ukraine-bolsters-forces-with-58-leopard-tanks-from-germany-50477360.html"
	],
	[
		"2024-12-24",
		"The Italian government has approved the continuation of military aid to Ukraine. Italian government adopted the relevant law on December 23.",
		"Уряд Італії схвалив продовження військової допомоги Україні. Відповідний закон італійський уряд ухвалив 23 грудня.",
		"https://ukranews.com/en/news/1054719-italian-government-approves-continuation-of-military-aid-to-ukraine"
	],
	[
		"2024-12-22",
		"German Rheinmetall will supply Ukraine with 155mm artillery shells. The deliveries are planned in the first half of 2025.",
		"Німецька компанія Rheinmetall поставить Україні 155-мм артилерійські снаряди. Поставки заплановані на першу половину 2025 року.",
		"https://www.linkedin.com/posts/dpa-mod-ukraine_the-defense-procurement-agency-of-ukraines-activity-7275792040590729217-SYVX"
	],
	[
		"2024-12-19",
		"The Danish Government informed the Foreign Policy Committee on the 23rd donation package to Ukraine which includes 2.1 billion DKK to strengthen Ukraine’s air defence and the capacity for fighter aircrafts. Furthermore, funding will be spent on additional infantry fighting vehicles.",
		"Уряд Данії поінформував Комітет з питань зовнішньої політики про 23-й пакет допомоги Україні, який включає 2,1 мільярда данських крон на посилення протиповітряної оборони України та розвиток потенціалу винищувальної авіації. Крім того, кошти будуть витрачені на додаткові бойові машини піхоти.",
		"https://www.fmn.dk/en/news/2024/new-donation-package-to-strengthen-ukraines-air-defence/"
	],
	[
		"2024-12-19",
		"The Danish government has prepared the 23rd package of military aid to Ukraine worth DKK 2.1 billion (€281.5 million).",
		"Уряд Данії підготував 23-й пакет військової допомоги Україні на суму 2,1 млрд данських крон (281,5 млн євро).",
		"https://mil.in.ua/en/news/denmark-and-sweden-prepare-cv90-ifvs-for-ukraine/"
	]
]