[
	[
		"2025-11-23",
		"The top U.S. and Ukrainian officials held closed-door discussions at Geneva’s InterContinental Hotel, focusing on expanding military cooperation and refining battlefield strategy against Russia.",
		"Вищі посадові особи США та України провели закриті переговори в готелі InterContinental у Женеві, зосередившись на розширенні військового співробітництва та вдосконаленні стратегії ведення бойових дій проти Росії.",
		"https://internationalnewsandviews.com/us-ukraine-secret-geneva-talks-military-aid-russia-strategy-392024-2/"
	],
	[
		"2025-11-22",
		"US Vice President JD Vance has said that it is essential for the Trump administration that any peace agreement be acceptable to Ukraine, guarantee its sovereignty, and prevent a resumption of the war.",
		"Віцепрезидент США Джей Ді Венс заявив, що для адміністрації Трампа надзвичайно важливо, щоб будь-яка мирна угода була прийнятною для України, гарантувала її суверенітет і запобігала відновленню війни.",
		"https://www.pravda.com.ua/eng/news/2025/11/22/8008493/"
	],
	[
		"2025-11-21",
		"Canada is shipping more than 150,000 pieces of winter equipment worth $30 million to Ukraine. The package also includes 78,351 pairs of wet weather winter boots and 51,679 winter jackets.",
		"Канада відправляє в Україну понад 150 000 одиниць зимового спорядження на суму 30 мільйонів доларів. У пакет також входять 78 351 пара зимових чобіт для дощової погоди та 51 679 зимових курток.",
		"https://euromaidanpress.com/2025/11/21/canada-delivers-25-m113-apcs-and-air-to-air-missile-components-to-ukrainian-forces/"
	],
	[
		"2025-11-19",
		"Ukrainian military intelligence reportedly noticed that North Korea is no longer able to supply Russia with as much ammunition as it used to.",
		"Українська військова розвідка, як повідомляється, помітила, що Північна Корея більше не в змозі постачати Росії стільки боєприпасів, скільки раніше.",
		"https://www.technology.org/2025/11/19/north-korea-is-slowing-down-military-support-for-russia/"
	],
	[
		"2025-11-19",
		"Spain’s Prime Minister Pedro Sanchez on Tuesday announced a new EUR 817 million support package for Ukraine, including funds for U.S.-made weapons and reconstruction.",
		"Прем'єр-міністр Іспанії Педро Санчес у вівторок оголосив про новий пакет допомоги Україні на суму 817 млн євро, що включає кошти на придбання зброї американського виробництва та відновлення країни.",
		"https://www.polskieradio.pl/395/9766/Artykul/3609447,spain-announces-new-eur-817-million-aid-package-for-ukraine"
	],
	[
		"2025-11-11",
		"The German government has confirmed an additional €11.5 billion in military aid to Ukraine. The increase was unexpected and added to the draft 2026 budget at the last minute. The additional funds are earmarked for artillery, drones, armored vehicles, and the replacement of two Patriot anti-aircraft missile systems. ",
		"Уряд Німеччини підтвердив виділення додаткової військової допомоги Україні у розмірі 11,5 млрд євро. Це збільшення було несподіваним і додане до проекту бюджету на 2026 рік в останній момент. Додаткові кошти призначені для придбання артилерії, дронів, броньованих транспортних засобів та заміни двох зенітних ракетних комплексів Patriot.",
		"https://europeanconservative.com/articles/news-corner/germany-adds-e11-5bn-ukraine-aid-in-surprise-budget-move/"
	],
	[
		"2025-11-11",
		"A Slovak investigator has halted a criminal case into the 2023 transfer of MiG-29 fighter jets and parts of a KUB air-defense system to Ukraine, finding no evidence of a crime.",
		"Словацький слідчий припинив кримінальну справу щодо передачі Україні в 2023 році винищувачів МіГ-29 та частин системи протиповітряної оборони КУБ, не знайшовши доказів злочину.",
		"https://united24media.com/latest-news/no-crime-found-in-slovakias-mig-29-donation-to-ukraine-case-now-closed-13293"
	],
	[
		"2025-11-11",
		"The United States has stopped spending money to support Ukraine and is now receiving funds through NATO from weapons sales, President Donald Trump said during a White House press event on Nov. 10.",
		"Сполучені Штати припинили витрачати кошти на підтримку України і зараз отримують кошти через НАТО від продажу зброї, заявив президент Дональд Трамп під час прес-конференції в Білому домі 10 листопада.",
		"https://english.nv.ua/nation/trump-says-u-s-stopped-funding-ukraine-now-gets-nato-money-for-weapons-sales-50559679.html"
	],
	[
		"2025-11-10",
		"Ukraine has received Italian Centauro B1 armored “tank destroyers” as part of a recent military aid package from Italy. In early November 2025, Ukraine’s 78th Air Assault Regiment publicly displayed newly delivered Italian Centauro B1 8×8 gun vehicles. Italy has not disclosed when or how many were sent. ",
		"Україна отримала італійські броньовані «танкознищувачі» Centauro B1 в рамках нещодавнього пакету військової допомоги від Італії. На початку листопада 2025 року 78-й повітряно-десантний полк України публічно продемонстрував нещодавно поставлені італійські бойові машини Centauro B1 8×8. Італія не розкрила, коли і скільки їх було надіслано.",
		"https://www.overtdefense.com/2025/11/10/ukraine-receives-italian-centauro-b1-armored-vehicles/"
	],
	[
		"2025-11-10",
		"Canada should increase its military aid to Ukraine in proportion to the size of its own economy, according to the former commander of the army.",
		"Канада повинна збільшити військову допомогу Україні пропорційно до розміру своєї економіки, вважає колишній командувач армії.",
		"https://www.ukrinform.net/rubric-ato/4056760-canada-should-increase-military-aid-to-ukraine-says-former-commander-of-army.html"
	],
	[
		"2025-11-07",
		"Former NATO Secretary-General Jens Stoltenberg says the way to change Russian President Vladimir Putin's mind and bring him to the negotiating table to end the war in Ukraine is to step up military aid to Kyiv.",
		"Колишній генеральний секретар НАТО Єнс Столтенберг заявляє, що єдиний спосіб змінити думку російського президента Володимира Путіна і змусити його сісти за стіл переговорів, щоб покласти край війні в Україні, – це посилити військову допомогу Києву.",
		"https://www.rferl.org/a/nato-stoltenberg-weapons-kyiv-putin-trump-war/33584297.html"
	],
	[
		"2025-11-07",
		"Latvia has handed over more than 20 Patria armored personnel carriers to Ukraine.",
		"Латвія передала Україні понад 20 бронетранспортерів Patria.",
		"https://newsukraine.rbc.ua/news/ukraine-receives-patria-armored-vehicles-1762506937.html"
	],
	[
		"2025-11-07",
		"Defense Minister Denys Shmyhal said on Nov. 6 that Sweden has helped Ukraine produce 400 long-range drones, which are then often used to hit targets such as oil refineries deep inside Russia.",
		"6 листопада міністр оборони Денис Шмигаль заявив, що Швеція допомогла Україні виготовити 400 безпілотників дальньої дії, які часто використовуються для ураження таких цілей, як нафтопереробні заводи в глибині Росії.",
		"https://kyivindependent.com/sweden-is-helping-fund-ukraines-drone-strikes-on-russian-oil-refineries/"
	],
	[
		"2025-11-06",
		"Sweden and Ukraine are progressing in talks over a major defense agreement that could see Kyiv acquire up to 150 Gripen E multirole fighter jets, according to Swedish Defense Minister Pål Jonson.",
		"Швеція та Україна просуваються в переговорах щодо укладення важливої оборонної угоди, за якою Київ може придбати до 150 багатоцільових винищувачів Gripen E, за словами міністра оборони Швеції Пола Джонсона.",
		"https://united24media.com/latest-news/sweden-considers-financing-part-of-gripen-fighter-jet-deal-with-ukraine-in-landmark-defense-move-13190"
	],
	[
		"2025-11-05",
		"Norway will provide Ukraine with $7 billion in 2026 to support its defense sector, Prime Minister Denys Shmyhal announced on X on Nov. 5.",
		"Норвегія надасть Україні 7 мільярдів доларів у 2026 році для підтримки оборонного сектору, оголосив прем'єр-міністр Денис Шмигаль 5 листопада.",
		"https://kyivindependent.com/norway-to-allocate-7-billion-in-aid-to-ukraine-in-2026/"
	],
	[
		"2025-11-05",
		"Estonia's Minister of Defense Hanno Pevkur announced Estonia's initiative to allocate €3 million for the purchase and maintenance of Starlink satellite communication systems for Ukraine.",
		"Міністр оборони Естонії Ганно Певкур оголосив про ініціативу Естонії виділити 3 мільйони євро на придбання та обслуговування супутникових систем зв'язку Starlink для України.",
		"https://newsukraine.rbc.ua/news/estonia-to-invest-millions-in-starlink-for-1762339230.html"
	],
	[
		"2025-11-05",
		"The North Atlantic Alliance will allocate $60 billion in aid to Ukraine in 2026, according to Patrick Turner, head of NATO's representation in Ukraine.",
		"Північноатлантичний альянс виділить Україні 60 мільярдів доларів допомоги у 2026 році, за словами Патріка Тернера, глави представництва НАТО в Україні.",
		"https://euromaidanpress.com/2025/11/05/nato-confirms-60-bn-ukraine-aid-package-for-2026-double-of-countrys-self-funding-capacity/"
	]
]