[
	[
		"2023-12-02",
		"The Bundeswehr has trained a second group of Ukrainian military personnel to work with the Patriot air defense system.",
		"Бундесвер навчив другу групу українських військових роботі з ЗРК Patriot",
		"https://www.dw.com/uk/bundesver-navciv-drugu-grupu-ukrainciv-obslugovuvati-zrk-patriot/a-67614067"
	],
	[
		"2023-11-30",
		"The Netherlands on Thursday revealed plans to provide an additional €2.5 billion (over $2.7 billion) aid in support of Ukraine in its war with Russia next year.",
		"У четвер Нідерланди оприлюднили плани надати додаткові 2,5 мільярда євро допомоги на підтримку України у війні з Росією наступного року.",
		"https://www.aa.com.tr/en/europe/netherlands-to-send-ukraine-over-27b-in-additional-aid-in-2024/3069339"
	],
	[
		"2023-11-30",
		"The Reagan National Defense Survey found that 59 percent of Americans still support sending military aid to Kyiv, roughly the same level as a June poll and one from November 2022. The poll does show a divide between political parties with Democrat support hovering at 75 percent, while Republican support hangs at 49 percent.",
		"Опитування Reagan National Defense Survey показало, що 59 відсотків американців все ще підтримують відправку військової допомоги Києву, приблизно такий самий рівень, як червневе опитування та опитування в листопаді 2022 року. Опитування справді показує розрив між політичними партіями з підтримкою демократів на рівні 75 відсотків, тоді як підтримка республіканців становить 49 відсотків.",
		"https://breakingdefense.com/2023/11/ahead-of-high-level-defense-gathering-at-reagan-forum-poll-finds-consistent-support-for-ukraine/"
	],
	[
		"2023-11-30",
		"Ukraine will need to wait until next year before it receives its first big shipment of rocket-propelled bombs the U.S. has adapted to strike at a nearly 100-mile (160km) range, according to the Pentagon and people familiar with the timing.",
		"Україні доведеться зачекати до наступного року, перш ніж вона отримає свою першу велику партію ракетних бомб, адаптованих США для нанесення ударів на відстані майже 160 км.",
		"https://www.reuters.com/world/europe/ukraines-new-long-range-rocket-delivery-us-pushed-next-year-2023-11-30/"
	],
	[
		"2023-11-29",
		"The European union has delivered about 300,000 of its promised million shells to Ukraine so far, Ukraine's Foreign Minister Dmytro Kuleba said on Wednesday while attending a NATO meeting in Brussels.",
		"Європейський Союз поставив Україні близько 300 тисяч із обіцяного мільйона снарядів",
		"https://www.reuters.com/world/europe/ukraine-has-received-300000-eus-promised-million-shells-foreign-minister-2023-11-29/"
	],
	[
		"2023-11-29",
		"Slovakia's newly-elected President, Robert Fico, promised to halt military aid to Ukraine, although later clarified that he would not block arms purchases from private companies.",
		"Новообраний президент Словаччини Роберт Фіцо пообіцяв припинити військову допомогу Україні, але пізніше уточнив, що не блокуватиме закупівлі зброї у приватних компаній.",
		"https://www.reuters.com/world/europe/ukraine-has-received-300000-eus-promised-million-shells-foreign-minister-2023-11-29/"
	],
	[
		"2023-11-24",
		"Canada announced another $60-million contribution of military aid for Ukraine on Friday, including nine million rounds of ammunition and around 11,000 firearms. That's part of a $500-million package of aid that was announced during the summer.",
		"Канада оголосила про черговий внесок у розмірі 60 мільйонів доларів військової допомоги Україні, включаючи дев'ять мільйонів боєприпасів і близько 11 000 одиниць вогнепальної зброї. Це частина пакету допомоги на 500 мільйонів доларів, який було оголошено влітку.",
		"https://www.ctvnews.ca/politics/trudeau-accuses-tories-of-turning-their-backs-on-ukraine-s-needs-announces-more-aid-1.6659663"
	],
	[
		"2023-11-24",
		"Denmark will increase its military support for Ukraine by 2.3 billion Danish Crowns ($336.65 million) this year, the Danish defence ministry said on Friday. The donation comes on top of the 5.4 billion the Nordic country had allocated to a fund set up for military donations to Ukraine. Parliament also agreed to allocate an additional 23.5 billion crowns between 2025 and 2027 for the fund.",
		"Данія збільшить військову підтримку України на 2,3 млрд датських крон ($336,65 млн) цього року, повідомило в п'ятницю міністерство оборони Данії. Ця пожертва є доповненням до 5,4 мільярдів, які скандинавська країна виділила у фонд, створений для військових пожертвувань Україні. Парламент також погодився виділити для фонду додаткові 23,5 мільярда крон у період з 2025 по 2027 рік.",
		"https://www.reuters.com/world/europe/denmark-send-additional-336-mln-ukraine-this-year-military-aid-2023-11-24/"
	],
	[
		"2023-11-23",
		"Rustem Umierov, Ukraine’s Defense Minister, reported that 20 countries had joined the alliance of air defense for Ukraine, with Germany and France leading the way.",
		"Міністр оборони України Рустем Умеров повідомив, що до альянсу протиповітряної оборони України приєдналися 20 країн, лідирують Німеччина та Франція.",
		"https://www.facebook.com/story.php?story_fbid=pfbid038EGqKZQhEUTE7D5dBaCJYLREcHzSXZtEouXfj9pqihV3HBGaCWuhp27UWH8XQHSl&id=100069073844828"
	],
	[
		"2023-11-23",
		"The Bulgarian parliament ratified an agreement between the Bulgarian Interior Ministry and the Ukrainian Defense Ministry on the transfer of 100 armored personnel carriers.",
		"Парламент Болгарії ратифікував угоду між МВС Болгарії та Міноборони України про передачу 100 бронетранспортерів.",
		"https://mil.in.ua/en/news/bulgarian-parliament-approves-transfer-of-100-armored-personnel-carriers-to-ukraine/"
	],
	[
		"2023-11-22",
		"North Macedonia has completed the successful training of the first batch of Ukrainian soldiers. Defence Minister Slavjanka Petrovska told the national broadcaster Macedonian Television , and said that she had delayed sharing this information until now for security reasons.",
		"Північна Македонія завершила успішне навчання першої групи українських військових.",
		"https://balkaninsight.com/2023/11/22/north-macedonia-completes-training-first-batch-of-ukrainian-soldiers/"
	],
	[
		"2023-11-22",
		"A new Lithuanian military support package has reached Ukraine. Lithuanian army delivered and handed over 3 million units of 7.62×51 mm cartridges, remote detonation systems and winter equipment to the Ukrainian army.",
		"Новий пакет військової підтримки Литви надійшов до України. Литовська армія доставила та передала українській армії 3 мільйони одиниць патронів 7,62×51 мм, системи дистанційного підриву та зимове спорядження.",
		"https://kam.lt/lietuva-perdave-ukrainos-kariuomenei-3-mln-soviniu-nuotolinio-detonavimo-sistemas-ir-ziemai-skirta-iranga/?fbclid=IwAR0YAWx-LnAeSjZ92qfzjuhrX4BVReaqak_edIOwMfCDlFsE5JfUi6THEiE"
	],
	[
		"2023-11-22",
		"Defense Minister of Denmark Lund Poulsen has reported about delays in delivery of American F-35s which should substitute F-16s, commited by Denmark to Ukraine. The delays are due to the software upgrade difficulties of F-35s at Lockheed Martin factory. Mr. Poulsen assured that he does not expect the delays with the F-35A to affect the delivery of F-16s to Ukraine or any of Denmark’s NATO commitments.",
		"Міністр оборони Данії Лунд Поульсен повідомив про затримки з поставками американських F-35, які повинні замінити F-16, допущені Данією в Україну. Затримки пов'язані з проблемами оновлення програмного забезпечення F-35 на заводі Lockheed Martin. Пан Поульсен запевнив, що не очікує, що затримки з F-35A вплинуть на поставку F-16 в Україну або будь-які зобов’язання Данії перед НАТО.",
		"https://www.bloomberg.com/news/articles/2023-11-22/denmark-will-get-f-35-jets-later-due-to-further-delivery-delays"
	],
	[
		"2023-11-21",
		"Germany on Tuesday announced €1.3 billions ($1.4 billion) more in military gear for Ukraine, including four further IRIS T-SLM air defense systems as well as artillery ammunition.",
		"Німеччина оголосила про виділення Україні ще 1,3 мільярда євро на військове спорядження, включаючи ще чотири системи ППО IRIS T-SLM, а також артилерійські боєприпаси.",
		"https://p.dw.com/p/4ZG1d"
	],
	[
		"2023-11-21",
		"According to preliminary information, Armenia could transfer three Tochka-U to the Ukrainian military.",
		"За попередньою інформацією, Вірменія могла передати українським військовим три \"Точки-У\".",
		"https://www.eurasiantimes.com/angry-armenia-to-arm-ukraine-with-tochka-u-ballistic-missile/"
	],
	[
		"2023-11-20",
		"The Department of Defense (DoD) announced fifty-first tranche of equipment for Ukraine. This package includes additional air defense capabilities, artillery ammunition, anti-tank weapons, and other equipment. The value of the package is up to $100 million.",
		"Міністерство оборони США оголосило про п'ятдесят перший транш обладнання для України. Цей пакет включає додаткові засоби ППО, артилерійські боєприпаси, протитанкову зброю та інше обладнання. Вартість пакету становить до 100 мільйонів доларів.",
		"https://www.defense.gov/News/Releases/Release/Article/3594318/biden-administration-announces-new-security-assistance-for-ukraine/"
	],
	[
		"2023-11-17",
		"The Dutch government has earmarked an additional 2 billion euros ($2.2 billion) in military aid for Ukraine in 2024.",
		"Уряд Нідерландів виділив додаткові 2 млрд євро на військову допомогу Україні у 2024 році.",
		"https://www.reuters.com/world/europe/dutch-deliver-additional-22-bln-military-aid-kyiv-2024-defence-minister-2023-11-17/"
	],
	[
		"2023-11-17",
		"Minister of Defence of Finland Antti Häkkänen informed about the 20th military package for Ukraine in value of 100 million euros. Due to operational reasons, and to ensure the aid package arrives safely at its destination, the ministry added that no further details on the content, the method of delivery, or the schedule would be provided. The total value of defence support provided by Finland to Ukraine since Russia's invasion amounts to 1.5 billion euros.",
		"Міністр оборони Фінляндії Антті Хаккянен повідомив про 20-й військовий пакет для України вартістю 100 млн євро. З оперативних причин і щоб забезпечити безпечне прибуття пакету допомоги до місця призначення, міністерство додало, що жодних додаткових деталей щодо вмісту, способу доставки чи графіку надавати не буде. Загальна вартість оборонної підтримки, яку Фінляндія надала Україні з моменту вторгнення Росії, становить 1,5 млрд євро.",
		"https://yle.fi/a/74-20060891"
	],
	[
		"2023-11-17",
		"Norway’s Labour-Center government has proposed giving Ukraine NOK 7.5 billion worth of military support through its Nansen Program, which promises NOK 75 billion ($7.5 bln) in military and humanitarian support over the next five years.",
		"Уряд Норвезького центру праці запропонував надати Україні військову підтримку на суму 7,5 мільярдів норвезьких крон через програму Нансена, яка обіцяє 75 мільярдів норвезьких крон (7,5 мільярдів доларів) військової та гуманітарної підтримки протягом наступних п’яти років.",
		"https://www.newsinenglish.no/2023/11/17/norway-denies-any-cuts-in-support-for-ukraine/"
	],
	[
		"2023-11-17",
		"Five Italian arms and military equipment companies have joined the Alliance of Ukrainian Defense Industries.",
		"П'ять італійських компаній з виробництва озброєння та військової техніки приєдналися до Альянсу ОПК України.",
		"https://mspu.gov.ua/news/piat-italiiskykh-kompanii-doluchylysia-do-aliansu-oboronnykh-industrii"
	],
	[
		"2023-11-15",
		"The Czech initiative ‘Darek pro Putina’ (A Gift for Putin) will raise funds for a UH-60 Black Hawk helicopter for Ukraine.",
		"Чеська ініціатива «Darek pro Putina» (Подарунок для Путіна) збиратиме кошти на гелікоптер UH-60 Black Hawk для України.",
		"https://mil.in.ua/en/news/czech-volunteers-rally-to-donate-black-hawk-to-ukraine/"
	],
	[
		"2023-11-14",
		"German Minister of Foreign Affairs, Annalena Baerbock: Germany will not just continue to support to Ukraine, it will expand such assistance during winter months and throughout next year.",
		"Міністр закордонних справ Німеччини Анналена Бербок: Німеччина не просто продовжить підтримувати Україну, вона розширить таку допомогу протягом зимових місяців і протягом наступного року.",
		"https://www.ukrinform.net/rubric-polytics/3786206-putin-rejoices-too-soon-at-international-turbulence-baerbock.html"
	],
	[
		"2023-11-14",
		"The Ukrainian government has awarded Rheinmetall a contract for Leopard 1 systems, including 25 main battle tanks Leopard 1A5, five armoured recovery vehicles (Bergepanzer 2) and two driver training tanks. The order, financed by Germany and worth a figure in the upper-two-digit million-euro range, also includes training, logistics, spare parts, maintenance and other support services.",
		"Уряд України уклав з Rheinmetall контракт на поставку систем Leopard 1, включаючи 25 основних бойових танків Leopard 1A5, п'ять броньованих евакуаційних машин (Bergepanzer 2) і два танки для підготовки водіїв. Замовлення, фінансоване Німеччиною, також включає навчання, логістику, запасні частини, технічне обслуговування та інші допоміжні послуги.",
		"https://www.rheinmetall.com/en/media/news-watch/news/2023/11/2023-11-14-rheinmetall-to-supply-ukraine-with-leopard-systems-on-behalf-of-german-government"
	],
	[
		"2023-11-14",
		"Up until now Ukraine has not sent an order for purchasing of 100 PzH 2000 to Germany. The contract has been approved by the German government in 2022 and is valued at EUR 1.7 bln. The reasons for the decistion are not known. At the same time KNDS confirmed preparations for the production of the RCH 155 wheeled self-propelled howitzers. Currently, KMW is at the stage of construction of the production line. Ukraine has become the 1st customer of KMW for RCH 155 with an order of 18 units. The contract is valued at EUR 216 mln.",
		"Досі Україна не надсилала замовлення на закупівлю 100 PzH 2000 до Німеччини. Контракт був схвалений урядом Німеччини в 2022 році і оцінюється в 1,7 млрд євро. Причини такого рішення невідомі. Водночас KNDS підтвердила підготовку до виробництва колісних самохідних гаубиць RCH 155. Зараз KMW знаходиться на стадії будівництва виробничої лінії. Україна стала першим замовником KMW на RCH 155 із замовленням 18 одиниць. Контракт оцінюється в 216 млн євро.",
		"https://x.com/Bjoern__M/status/1724444791935472127?s=20"
	],
	[
		"2023-11-13",
		"The Canadian government has asked Parliament to approve 500 million CAD (approximately 385 million US dollars) for military aid to Ukraine",
		"Уряд Канади попросив парламент схвалити 500 млн канадських доларів (приблизно 385 млн доларів США) на військову допомогу Україні",
		"https://www.armyrecognition.com/defense_news_november_2023_global_security_army_industry/canada_to_allocate_new_$385_mn_financial_aid_to_ukraine_military_support.html"
	],
	[
		"2023-11-11",
		"Chancellor Olaf Scholz’s governing coalition has agreed to double German military aid for Ukraine next year to €8 billion ($8.6 billion).",
		"Урядова коаліція канцлера Олафа Шольца погодилася подвоїти військову допомогу Німеччини Україні наступного року до 8 мільярдів євро",
		"https://www.bloomberg.com/news/articles/2023-11-11/germany-set-to-double-its-ukraine-military-aid-under-scholz-plan"
	],
	[
		"2023-11-10",
		"A European Union plan to spend up to 20 billion euros ($21.4 billion) on military aid for Ukraine is meeting resistance from EU countries and may not survive in its current form, diplomats say.",
		"План Європейського Союзу витратити до 20 мільярдів євро на військову допомогу Україні зустрічає опір з боку країн ЄС і може не вижити в нинішньому вигляді, кажуть дипломати.",
		"https://www.reuters.com/world/europe/eus-20-billion-euro-plan-ukraine-military-aid-hits-resistance-2023-11-10/"
	],
	[
		"2023-11-10",
		"The Canadian government has asked Parliament to allocate CAD 500 million (about $385 million) for military aid to Ukraine.",
		"Уряд Канади звернувся до парламенту з проханням виділити 500 мільйонів канадських доларів (близько 385 мільйонів доларів США) на військову допомогу Україні.",
		"https://www.ukrinform.ua/rubric-ato/3785411-urad-kanadi-prosit-u-parlamentu-385-miljoniv-na-vijskovu-dopomogu-ukraini.html"
	],
	[
		"2023-11-10",
		"The French company SEFA is ready to supply 8 SDZ (Zone Demining System) demining systems to Ukraine. SEFA and one of the Ukrainian manufacturers are negotiating on the joint production of spare parts for SDZ systems.",
		"Французька компанія SEFA готова поставити в Україну 8 систем розмінування SDZ (Zone Demining System). SEFA та один з українських виробників ведуть переговори про спільне виробництво запчастин для систем SDZ.",
		"https://mil.in.ua/en/news/french-sefa-sends-demining-systems-to-ukraine/"
	],
	[
		"2023-11-09",
		"Global Clearance Solutions (GCS) - a producer of demining equipment - has announced the opening of thier service and maintenance facility in Ukraine.",
		"Global Clearance Solutions (GCS) - виробник обладнання для розмінування - оголосив про відкриття сервісно-технічного центру в Україні.",
		"https://gcs.ch/news-and-stories/2023/11/9/to-support-our-clients-gcs-has-established-a-dedicated-service-amp-maintenance-workshop"
	],
	[
		"2023-11-09",
		"The Ukrainian military received Serbian M93P1 30mm grenades for AGS-17 automatic grenade launchers.",
		"Українські військові отримали сербські гранати М93П1 калібру 30 мм для автоматичних гранатометів АГС-17.",
		"https://mil.in.ua/en/news/serbian-made-30mm-grenades-delivered-to-ukrainian-military-for-ags-17-grenade-launchers/"
	],
	[
		"2023-11-08",
		"The new Slovak government refused to approve a military aid package for Ukraine. The €40.3 million ($43 million) package was prepared by the outgoing government and included four million bullets for rifles, 5,172 pieces of artillery shells, 140 air-defense missiles, eight mortars, and 1,200 mines, said the state-run TASR news agency.",
		"Новий уряд Словаччини відмовився затверджувати пакет військової допомоги Україні. Пакет у розмірі 40,3 мільйона євро був підготовлений урядом, що минає, і включав чотири мільйони куль для гвинтівок, 5172 одиниці артилерійських снарядів, 140 ракет ППО, вісім мінометів і 1200 мін, повідомляє державне інформаційне агентство TASR. .",
		"https://www.aa.com.tr/en/europe/new-slovak-government-refuses-to-approve-military-aid-package-for-ukraine/3047451"
	],
	[
		"2023-11-08",
		"Rheinmetall has received an order from the German government to supply Ukraine with around 100,000 rounds of 120mm mortar ammunition. The order, worth a figure in the lower-three-digit million-euro range, forms part of a recent €400 million military aid package for the Ukrainian armed forces. Delivery is due to begin shortly and extend over the next two years.",
		"Компанія Rheinmetall отримала від уряду Німеччини замовлення на поставку в Україну близько 100 тис. боєприпасів до мінометів калібру 120 мм. Замовлення є частиною нещодавнього пакету військової допомоги на суму 400 мільйонів євро для українських збройних сил. Постачання має розпочатися найближчим часом і триватиме протягом наступних двох років.",
		"https://www.aa.com.tr/en/europe/new-slovak-government-refuses-to-approve-military-aid-package-for-ukraine/3047451"
	],
	[
		"2023-11-08",
		"Ukrainian Minister of Strategic Industries Oleksandr Kamyshin reported on twitter that the Ukrainian government has voted for the increase in military spending for local defense in three areas: $1,5bn for procurement of mostly locally produced drones, $350mn for procurement of locally made artillery systems, and $1,2bn for expanding capabilities of Ukraine defense industry.",
		"Міністр стратегічної промисловості України Олександр Камишін повідомив у Twitter, що український уряд проголосував за збільшення військових витрат на місцеву оборону за трьома напрямками: $1,5 млрд на закупівлю переважно місцевих безпілотників, $350 млн на закупівлю місцевих артилерійських систем, і $1,2 млрд на розширення можливостей ОПК України.",
		"https://x.com/AKamyshin/status/1722246545997983806?s=20"
	],
	[
		"2023-11-08",
		"France's National Assembly approved re-topping the country's special fund for Ukraine with another €200 million. MPs tweaked the cash pot's rules to allow for co-financing by Ukrainian authorities, meaning the total amount of contracts signed can be higher than €200 million. The Senate needs to green light the money before it can be spent.",
		"Національні збори Франції схвалили поповнення спеціального фонду країни для України ще на 200 мільйонів євро. Депутати змінили правила, щоб дозволити українській владі співфінансування, тобто загальна сума підписаних контрактів може перевищувати 200 мільйонів євро. Сенат повинен дати дозвіл на ці гроші, перш ніж їх можна буде витратити.",
		"https://www.politico.eu/article/slovakia-blocks-latest-aid-package-to-ukraine/"
	]
]