[
	[
		"2023-12-16",
		"The Ministry of National Defense and the Lithuanian Armed Forces handed over a new batch of military assistance to the Ukrainian military. The Lithuanian Armed Forces transported millions of rounds and thousands of cartridges for short-range anti-tank grenade launchers to Ukraine. Additionally, the shipment included about a thousand foldable stretchers.",
		"Міністерство національної оборони та Збройні сили Литви передали українським військовим нову партію військової допомоги. Збройні сили Литви переправили в Україну мільйони патронів і тисячі патронів до протитанкових гранатометів малої дальності. Крім того, в партію входило близько тисячі складних носилок.",
		"https://kam.lt/lietuva-perdave-ukrainai-nauja-karines-paramos-krovini/"
	],
	[
		"2023-12-14",
		"The Estonian government cabinet has supported the proposal by Minister of Defense Hanno Pevkur to provide long-term military aid to Ukraine as well as an extensive military aid package to support its defense against Russian aggression. The military aid includes Javelin anti-tank missiles, vessels, and other much-needed equipment.",
		"Кабінет міністрів Естонії підтримав пропозицію міністра оборони Ханно Певкура про надання довгострокової військової допомоги Україні, а також великий пакет військової допомоги для підтримки її захисту від російської агресії. Військова допомога включає протитанкові ракети Javelin, судна та інше вкрай необхідне обладнання.",
		"https://news.err.ee/1609194358/estonia-sending-80-million-of-military-aid-to-ukraine-including-javelins"
	],
	[
		"2023-12-13",
		"Australia will increase the number of instructors to train Ukrainian soldiers. According to a new commitment from the Australian Ministry of Defense, the country will allocate $186 million to continue ‘’Operation Kudu’’.",
		"Австралія збільшить кількість інструкторів для навчання українських військових. Згідно з новим зобов’язанням Міністерства оборони Австралії, країна виділить 186 мільйонів доларів на продовження «Операції Куду».",
		"https://www.abc.net.au/news/2023-12-14/australia-under-pressure-to-reopen-kyiv-embassy/103224526"
	],
	[
		"2023-12-12",
		"The Department of Defense (DoD) announced the fifty-third tranche of equipment from DoD inventories for Ukraine. The package includes additional air defense capabilities, artillery ammunition, anti-tank weapons, and other equipment.",
		"Міністерство оборони оголосило про п'ятдесят третій транш обладнання зі запасів Міністерства оборони для України. Пакет включає додаткові засоби ППО, артилерійські боєприпаси, протитанкову зброю та інше обладнання.",
		"https://www.defense.gov/News/Releases/Release/Article/3615582/biden-administration-announces-new-security-assistance-for-ukraine/"
	],
	[
		"2023-12-11",
		"Britain has delivered two mine-hunting ships to Ukraine. The mine hunters, originally HMS Grimsby and HMS Shoreham, were renamed Chernihiv and Cherkasy in Glasgow in June, and will help Ukraine to maintain a critical route for merchant shipping travelling across the Black Sea.",
		"Британія передала Україні два мінно-пошукові кораблі. Мінні мисливці, HMS Grimsby і HMS Shoreham, були перейменовані в Чернігів і Черкаси, і допоможуть Україні підтримувати важливий маршрут для торгових суден, що подорожують через Чорне море.",
		"https://www.theguardian.com/uk-news/2023/dec/11/britain-delivers-two-mine-hunting-ships-to-ukraine"
	],
	[
		"2023-12-11",
		"Nearly half of voters in a new survey said the United States is spending too much on aid for Ukraine.",
		"Майже половина виборців у новому опитуванні заявили, що Сполучені Штати витрачають занадто багато на допомогу Україні.",
		"https://thehill.com/policy/international/4353436-us-spending-ukraine-aid-poll/"
	],
	[
		"2023-12-09",
		"German Chancellor Olaf Scholz pledged continued financial and military assistance to Ukraine as it tries to rid its soil of Russian invaders, saying decisions will be made that enable Germany to keep up its support.",
		"Канцлер Німеччини Олаф Шольц пообіцяв продовжувати фінансову та військову допомогу Україні, оскільки вона намагається позбавити свою землю від російських загарбників, заявивши, що будуть прийняті рішення, які дозволять Німеччині продовжувати свою підтримку.",
		"https://www.dw.com/en/germanys-scholz-talks-ukraine-budget-crisis-at-spd-conference/a-67676951"
	],
	[
		"2023-12-08",
		"Bulgaria’s National Assembly voted against the President’s veto on the agreement between Bulgaria’s Interior Ministry and Ukraine’s Defence Ministry on supplying BTR-1 to Ukraine.",
		"Народні збори Болгарії проголосували проти вето президента на угоду між МВС Болгарії та Міноборони України про постачання Україні БТР-1.",
		"https://mil.in.ua/en/news/bulgarian-mps-override-veto-approve-armored-carrier-transfer-to-ukraine/"
	],
	[
		"2023-12-08",
		"Bulgaria’s parliament on Friday approved the provision of additional military aid to Ukraine in its war with Russia. A majority of 147 lawmakers in the 240-seat chamber voted in favor of supplying Ukraine with portable anti-aircraft missile systems and surface-to-air missiles of various types intended to bolster Ukraine’s air defense capabilities",
		"Парламент Болгарії у п’ятницю схвалив надання додаткової військової допомоги Україні у війні з Росією. Більшість із 147 народних депутатів у 240-місній палаті проголосували за постачання Україні переносних зенітно-ракетних комплексів і зенітних ракет різних типів, призначених для посилення можливостей протиповітряної оборони України.",
		"https://www.foxnews.com/world/bulgaria-approves-more-military-aid-ukraine"
	],
	[
		"2023-12-07",
		"Germany has delivered a new military package to Ukraine. In a statement the German government said the new package included 10 Vector reconnaissance drones, 1,750 artillery shells, 70 grenade launchers, six patrol cars, and eight trucks, as well as 100,000 military first-aid kits.",
		"Німеччина доставила Україні новий військовий пакет. У заяві уряду Німеччини йдеться, що новий пакет включає 10 розвідувальних безпілотників Vector, 1750 артилерійських снарядів, 70 гранатометів, шість патрульних автомобілів і вісім вантажівок, а також 100 000 військових аптечок.",
		"https://www.bundesregierung.de/breg-en/news/military-support-ukraine-2054992"
	]
]