[
	[
		"2023-08-01",
		"Seven-in-ten American voters favour continued support of of military aid to Ukraine, including military equipment, ammunition, training and intelligence, according to an in-depth study by the University of Maryland.",
		"Згідно з поглибленим дослідженням Університету Меріленда, сім із десяти американських виборців виступають за продовження підтримки військової допомоги Україні, включаючи військову техніку, боєприпаси, навчання та розвідку.",
		"https://www.army-technology.com/features/us-confidence-in-its-military-slumps-below-its-approval-of-aid-to-ukraine/"
	],
	[
		"2023-07-28",
		"Germany handed Ukraine a new batch of military aid, which includes air defense systems, all-terrain vehicles, UAVs and ammunition.Six more Gepard self-propelled anti-aircraft guns and more than 15,000 rounds of ammunition were handed over to Ukraine.",
		"Німеччина передала Україні нову партію військової допомоги, яка включає системи ППО, всюдиходи, БПЛА та боєприпаси. Україні передали ще шість самохідних зенітних установок Gepard і понад 15 тисяч боєприпасів.",
		"https://mil.in.ua/en/news/ukraine-receives-6-more-gepard-anti-aircraft-guns-and-ammunition-for-them/"
	],
	[
		"2023-07-27",
		"U.S. Abrams tanks are likely to arrive on the Ukrainian battlefield in September, according to six people familiar with the planning.",
		"Американські танки Abrams, ймовірно, прибудуть на українське поле битви у вересні, за словами шести осіб, знайомих з планом.",
		"https://www.politico.com/news/2023/07/27/u-s-expects-to-begin-delivering-abrams-tanks-to-ukraine-in-september-00108635"
	],
	[
		"2023-07-27",
		"Senate Democrats banded together Wednesday night to oppose the creation of a new office to audit US military assistance for Ukraine as part of a provision in the annual defense spending bill.",
		"Демократи в Сенаті об’єдналися, щоб виступити проти створення нового офісу для аудиту військової допомоги США Україні в рамках положення в законопроекті про щорічні витрати на оборону.",
		"https://nypost.com/2023/07/27/senate-dems-oppose-oversight-office-of-us-aid-for-ukraine/"
	],
	[
		"2023-07-27",
		"Japan seeks to ease arms export rules in bid to be ‘good actor’ in Ukraine war.",
		"Японія прагне пом’якшити правила експорту зброї, щоб бути «хорошою учасником» війни в Україні",
		"https://www.scmp.com/week-asia/politics/article/3229013/japan-seeks-ease-arms-export-rules-bid-be-good-actor-ukraine-warr"
	],
	[
		"2023-07-26",
		"France delivered 640.5 million euros worth of arms to Ukraine in 2022, according to the report of the Ministry of the Armed Forces to Parliament on France's 2022 arms exports.",
		"У 2022 році Франція поставила Україні зброї на 640,5 млн євро",
		"https://www.latribune.fr/entreprises-finance/industrie/aeronautique-defense/la-france-a-livre-a-l-ukraine-pour-640-millions-d-euros-de-materiels-militaires-en-2022-970994.html"
	],
	[
		"2023-07-25",
		"The value of Polish military aid to Ukraine reached 3 billion euros according to data from the Operational Centre at the Polish Ministry of Defence.",
		"Вартість польської військової допомоги Україні досягла 3 млрд євро",
		"https://defence24.com/defence-policy/we-know-the-value-of-polish-military-aid-to-ukraine-exclusive"
	],
	[
		"2023-07-25",
		"Raytheon Technologies RTX (maker of the Patriot, AMRAAM, Sidewinder, and Javelin, Stinger) chief executive Greg Hayes said “Right now, we still have only seen $2 billion of orders associated specifically with Ukraine replenishment,” Hayes said: “We think there’s probably another $2.5 billion coming in the next 12 months, associated with just the Ukraine replenishment.”",
		"Виконавчий директор Raytheon Technologies RTX (виробник Patriot, AMRAAM, Sidewinder і Javelin, Stinger) Грег Хейс сказав: «На даний момент ми все ще бачимо лише замовлення на 2 мільярди доларів, пов’язані саме з поповненням в Україні», — сказав Хейс: «Ми думаємо, що ймовірно, ще 2,5 мільярда доларів надійдуть у наступні 12 місяців, пов’язані лише з поповненням в Україні».",
		"https://www.airandspaceforces.com/rtx-ukraine-replenishment-orders-2023/"
	],
	[
		"2023-07-25",
		"The Department of Defense announced the 43rd presidential drawdown of equipment valued at $400 mln. It includes:  \n1.           Additional munitions for Patriot air defense systems and National Advanced Surface-to-Air Missile Systems (NASAMS);\n2.           Stinger anti-aircraft systems;\n3.           Additional ammunition for High Mobility Artillery Rocket Systems (HIMARS);\n4.           155mm and 105mm artillery rounds;\n5.           120mm and 60mm mortar rounds;\n6.           32 Stryker Armored Personnel Carriers;\n7.           Tube-Launched, Optically-Tracked, Wire-Guided (TOW) missiles;\n8.           Javelin and other anti-armor systems and rockets;\n9.           Hornet Unmanned Aerial Systems;\n10.         Hydra-70 aircraft rockets;\n11.         Tactical air navigation systems;\n12.         Demolitions munitions for obstacle clearing;\n13.         Over 28 million rounds of small arms ammunition and grenades;\n14.         Night vision devices and thermal imagery systems; and\n15.         Spare parts, training munitions, and other field equipment.",
		"Міністерство оборони США оголосило про новий пакет допомоги по програмі PDA на 400 мільйонів доларів:\n\n1. Додаткові боєприпаси для систем протиповітряної оборони Patriot і NASAMS\n2. Зенітні комплекси Stinger\n3. Додаткові боєприпаси для HIMARS\n4. Артилерійські снаряди калібру 155 мм і 105 мм\n5. Міномети калібру 120 мм і 60 мм\n6. 32 бронетранспортери Stryker\n7. Ракети TOW\n8. Javelin та інші протитанкові системи та ракети\n9. Безпілотні авіаційні системи Hornet\n10. Авіаційні ракети Hydra-70\n11. Тактичні аеронавігаційні системи\n12. Підривні боєприпаси для подолання перешкод\n13. Понад 28 мільйонів патронів до стрілецької зброї та гранат\n14. Прилади нічного бачення та тепловізійні системи\n15. Запчастини, навчальні боєприпаси та інше польове обладнання",
		"https://www.defense.gov/News/Releases/Release/Article/3470064/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-07-23",
		"Royal Navy imparts mine neutralization training to Ukrainian troops",
		"Вiйськово-морські сили Королівства навчають українських військових зі знешкодження мін",
		"https://www.navyrecognition.com/index.php/naval-news/naval-news-archive/2023/july/13381-uk-royal-navy-imparts-mine-neutralization-training-to-ukrainian-troops.html?utm_content=cmp-true"
	],
	[
		"2023-07-22",
		"Rheinmetall will produce for Ukraine 300,000 rounds for Gepard self-propelled anti-aircraft guns., 40 000 will be delivered in 2023.",
		"Rheinmetall виготовить для України 300 тис. набоїв для САУ Gepard, 40 тис. буде поставлено у 2023 році.",
		"https://www.bild.de/bild-plus/politik/inland/politik-inland/ukraine-deutsche-ingenieure-loesen-entscheidendes-munitionsproblem-84778262.bild.html"
	],
	[
		"2023-07-22",
		"Minister of Defense of Poland wrote in his Twitter: \"The renovation hub in Gliwice has started operating! The first two Leopards have already arrived from Ukraine to the Bumar plant.\"",
		"Міністр оборони Польщі написав у своєму Twitter: «Запрацював реноваційний хаб у Глівіце! Перші два Leopard вже прибули з України на завод Bumar».",
		"https://twitter.com/mblaszczak/status/1682794978781675520?s=20"
	],
	[
		"2023-07-22",
		"Ukraine has received several dozen Wolfram mobile ground-based platforms for Brimstone 1/2 SSMs from the United Kingdom.",
		"Україна отримала від Великої Британії кілька десятків мобільних наземних платформ Wolfram для SSM Brimstone 1/2.",
		"https://twitter.com/oryxspioenkop/status/1682833055533154304?s=20"
	],
	[
		"2023-07-21",
		"The United States plans to announce as soon as Tuesday a new military aid package for Ukraine worth up to $400 million, primarily comprised of artillery, air defense missiles and ground vehicles.",
		"Сполучені Штати планують уже у вівторок оголосити про новий пакет військової допомоги для України на суму до 400 мільйонів доларів США, який в основному складається з артилерії, ракет ППО та наземної техніки.",
		"https://www.reuters.com/world/europe/us-give-ukraine-new-400-million-military-aid-package-2023-07-21/"
	],
	[
		"2023-07-20",
		"Germany’s Ministry of Defense announced the delivery of 10 Leopard 1A5 Main Battle Tanks [MBTs] to Ukraine. This move is part of Germany’s commitment to bolster Ukraine’s defenses, with plans to send a total of 100 Leopard 1A5 tanks. ",
		"Міністерство оборони Німеччини оголосило про поставку в Україну 10 основних бойових танків Leopard 1A5. Цей крок є частиною зобов’язань Німеччини зміцнити обороноздатність України, загалом планується відправити 100 танків Leopard 1A5.",
		"https://bulgarianmilitary.com/2023/07/22/first-of-100-leopard-1-tanks-have-already-been-delivered-to-ukraine/"
	],
	[
		"2023-07-20",
		"European Union foreign ministers discussed a proposal by EU foreign policy chief Josep Borrell to spend up to €20 billion ($22.4 billion) on weapons, ammunition and other military aid for Ukraine over four years. According to EU officials and diplomats, Josep Borrell proposed adding an annual contribution of up to €5 billion for Ukraine into an EU-managed fund called the European Peace Facility to support Ukraine as it fights a Russian invasion. The fund has already disbursed over €5 billion in support to Ukraine since February of last year. If approved, the additional funding would span from 2024 to 2027, ensuring a more stable and sustainable supply of military aid to Ukraine.",
		"Міністри закордонних справ Європейського Союзу обговорили пропозицію верховного представника ЄС із закордонних справ Жозепа Борреля витратити до 20 мільярдів євро на зброю, боєприпаси та іншу військову допомогу Україні протягом чотирьох років. За словами офіційних осіб і дипломатів ЄС, Жозеп Боррель запропонував додати щорічний внесок для України в розмірі до 5 мільярдів євро до керованого ЄС фонду під назвою Європейський фонд миру для підтримки України, яка бореться з російським вторгненням. З лютого минулого року фонд уже виділив понад 5 мільярдів євро на підтримку України. У разі схвалення додаткове фінансування охопить період з 2024 по 2027 рік, забезпечуючи більш стабільне постачання військової допомоги Україні.",
		"https://www.dw.com/en/eu-foreign-ministers-discuss-ukraine-military-aid-proposal/a-66292393"
	],
	[
		"2023-07-20",
		"The Ukrainian army has conducted training exercises with the latest generation of locally-made 8x8 Infantry Fighting Vehicle the BTR-4MV1. ",
		"Українська армія провела навчання з БТР-4МВ1 останнього покоління місцевого виробництва з колісною формулою 8x8.",
		"https://www.armyrecognition.com/ukraine_-_russia_conflict_war_2022/ukrainian_soldiers_conduct_field_tests_with_new_btr-4mv1_8x8_ifv_infantry_fighting_vehicle.html"
	],
	[
		"2023-07-19",
		"The Pentagon announced a new $1.3 billion package of long-term military aid to Ukraine: \n\n- 150,000 152mm artillery shells\n- 300 tactical vehicles to tow and haul equipment\n- 60 tactical vehicles to recover equipment\n- 2,000 TOW missiles\n- 4 NASAMS anti-air systems\n- 50 heavy fuel tankers",
		"Пентагон оголосив про новий пакет довгострокової військової допомоги Україні на $1,3 млрд:\n\n- 150 000 артилерійських снарядів калібру 152 мм\n- 300 тактичних автомобілів для буксирування та перевезення техніки\n- 60 тактичних автомобілів для відновлення техніки\n- 2000 ракет TOW\n- 4 протиповітряні системи NASAMS\n- 50 паливозаправників",
		"https://media.defense.gov/2023/Jul/19/2003263170/-1/-1/1/UKRAINE-FACT-SHEET.PDF"
	],
	[
		"2023-07-18",
		"The Forges de Tarbes plant has received a contract for the supply of 60,000 hulls intended for the production of 155mm shells to Ukraine, which will be delivered in 2024.",
		"Завод Forges de Tarbes отримав контракт на поставку в Україну 60 тис. корпусів, призначених для виробництва 155-мм снарядів, які будуть поставлені в 2024 році.",
		"https://objectifaquitaine.latribune.fr/business/industrie/2023-07-18/l-ukraine-commande-120-000-grands-corps-creux-d-obus-de-155-mm-par-an-a-europlasma-970029.html"
	],
	[
		"2023-07-17",
		"The US will allow European countries to train Ukrainians on F-16 fighter jets.",
		"США дозволять європейським країнам навчати українців на винищувачах F-16.",
		"https://edition.cnn.com/2023/07/16/politics/us-ukraine-f16-jake-sullivan-cnntv/index.html"
	],
	[
		"2023-07-15",
		"South Korean President Yoon Suk-yeol said Saturday his country will provide a bigger batch of military supplies and humanitarian aid to Ukraine.",
		"Президент Південної Кореї Юн Сук Йоль заявив, що в суботу його країна надасть більшу партію військового обладнання та гуманітарної допомоги Україні.",
		"https://www.japantimes.co.jp/news/2023/07/15/world/politics-diplomacy-world/yoon-ukraine-visit/"
	],
	[
		"2023-07-14",
		"Washington will repurchase decommissioned HAWK air defense missiles it sold to Taiwan and deliver them to Ukraine as part of a military aid package",
		"Вашингтон викупить списані зенітні ракети HAWK, які продав Тайваню, і поставить їх Україні в рамках пакету військової допомоги",
		"https://kyivindependent.com/media-us-to-repurchase-taiwans-hawk-missiles-for-ukraine-aid/"
	],
	[
		"2023-07-14",
		"Germany will have supplied Ukraine with around €17 billion in military assistance by 2027. A government document published on Wednesday said the investment included €2 billion in 2022, some €5.4 billion this year and another €10.5 billion by 2027.",
		"Німеччина надасть Україні близько 17 мільярдів євро військової допомоги до 2027 року. В урядовому документі, опублікованому в середу, говориться, що інвестиції включають 2 мільярди євро в 2022 році, приблизно 5,4 мільярда євро цього року та ще 10,5 мільярда євро до 2027 року.",
		"https://www.thelocal.de/20230714/germany-pledges-major-long-term-military-aid-to-ukraine"
	],
	[
		"2023-07-14",
		"Germany approved for Ukraine a €700 million ($769 million) military aid package that included air defense equipment, infantry fighting vehicles, main battle tanks and artillery ammunition.",
		"Німеччина схвалила пакет військової допомоги Україні на суму 700 мільйонів євро, який включає засоби протиповітряної оборони, бойові машини піхоти, основні бойові танки та артилерійські боєприпаси.",
		"https://www.reuters.com/world/europe/berlin-finalises-700-mln-euro-military-aid-package-ukraine-2023-07-11/"
	],
	[
		"2023-07-13",
		"The largest one-time military aid package –  which includes 100 armoured vehicles from the Bulgarian police stockpile, mostly infantry carrier vehicles – was sent to Ukraine.",
		"Найбільший разовий пакет військової допомоги, який включає 100 одиниць бронетехніки зі складу болгарської поліції, в основному транспортні машини піхоти, відправлено в Україну.",
		"https://www.euractiv.com/section/politics/news/bulgaria-sends-largest-military-aid-package-to-ukraine/"
	],
	[
		"2023-07-13",
		"France’s parliament on Thursday approved a multi-billion-euro boost to military spending through the rest of this decade, spurred by Russia’s war in Ukraine and fast-growing global threats. This represents a 40% increase compared to the $320 billion budget for 2019-2025. The new military plan includes doubling the number of military reservists and reinforcing cyberdefense, as well as increasing weapons production capacity both to help Ukraine and to keep the French military adequately supplied.",
		"Парламент Франції в четвер схвалив збільшення військових витрат на кілька мільярдів євро до кінця цього десятиліття, що було спричинене війною Росії в Україні та швидко зростаючими глобальними загрозами. Це на 40% більше порівняно з бюджетом у 320 мільярдів доларів на 2019-2025 роки. Новий військовий план передбачає подвоєння кількості військових резервістів і посилення кіберзахисту, а також збільшення потужностей з виробництва зброї як для допомоги Україні, так і для належного забезпечення французької армії.",
		"https://apnews.com/article/france-military-budget-ukraine-war-defense-spending-4f63e50c61af404f2beedde1120fe43c"
	],
	[
		"2023-07-13",
		"Biden told reporters after the NATO conference that he is considering sending Ukraine long-range Army Tactical Missile Systems, or ATACMS.",
		"Після конференції НАТО Байден заявив журналістам, що розглядає можливість відправки Україні тактичних ракетних систем великої дальності (ATACMS).",
		"https://time.com/6294683/congress-ukraine-aid-biden-funding/"
	],
	[
		"2023-07-13",
		"After the NATO summit Australia has decided to provide further 30 Bushmaster vehicles. The Ministry of Defence announced a further step in its support for Ukraine - the deployment of an RAAF E-7A Wedgetail aircraft to protect the flow of assistance.",
		"Після саміту НАТО Австралія вирішила надати ще 30 машин Bushmaster. Міністерство оборони оголосило про наступний крок у своїй підтримці України – розгортання літака RAAF E-7A Wedgetail для захисту потоку допомоги.",
		"https://www.maitlandmercury.com.au/story/8267988/australia-boosts-bushmaster-military-aid-to-ukraine/"
	],
	[
		"2023-07-12",
		"Germany has decided to quit from a deal with Poland to repair Leopard 2 tanks from Ukraine due to high costs.",
		"Німеччина вирішила вийти з угоди з Польщею щодо ремонту українських танків Leopard 2 через високу вартість.",
		"https://www.devdiscourse.com/article/law-order/2520310-germany-drops-out-of-planned-tank-repair-hub-in-poland---handelsblatt"
	],
	[
		"2023-07-12",
		"Norway donates 1000 Black Hornet nano drones to Ukraine",
		"Норвегія дарує Україні 1000 нанодронів Black Hornet.",
		"https://twitter.com/Forsvarsdep/status/1679023439632277504?s=20"
	],
	[
		"2023-07-12",
		"Ukraine will receive 2 more NASAMS air defense systems and spare parts from Norway.",
		"Україна отримає від Норвегії ще 2 системи ППО NASAMS та запчастини до них.",
		"https://twitter.com/Forsvarsdep/status/1679092147444760576?s=20"
	],
	[
		"2023-07-11",
		"The EU’s diplomatic service has drafted a plan that recommends the bloc make a full slate of “security commitments to Ukraine” for years to come as it fends off Russia’s onslaught. The suggestions from the European External Action Service run the gamut, including everything from ensuring a “sustained” flow of weapons to Kyiv, to continuing military education and training, to sharing intelligence and helping connect Ukrainian and EU defense companies.",
		"Дипломатична служба ЄС розробила проект плану, який рекомендує блоку взяти на себе повний перелік «зобов’язань щодо безпеки перед Україною» на роки вперед, оскільки вона відбиватиметься від нападу Росії. Пропозиції від Європейської служби зовнішніх дій охоплюють широкий спектр пропозицій, включаючи все, починаючи від забезпечення «постійного» надходження зброї до Києва, до безперервної військової освіти та навчання, до обміну розвідданими та допомоги в з’єднанні оборонних компаній України та ЄС.",
		"https://www.politico.eu/article/eu-draws-up-plan-for-sustained-military-aid-to-ukraine/"
	],
	[
		"2023-07-11",
		"The UK government will provide Ukraine with more than 70 combat and logistic vehicles, thousands of rounds of ammunition for Challenger 2 tanks, and a GBP 50 million ($64.7 million) support package for equipment repair.",
		"Уряд Великої Британії надасть Україні понад 70 бойових і матеріально-технічних машин, тисячі боєприпасів для танків Challenger 2, а також пакет підтримки в розмірі 50 мільйонів фунтів стерлінгів (64,7 мільйона доларів) на ремонт обладнання.",
		"https://www.reuters.com/world/europe/uk-provide-65-mln-support-package-ukraine-2023-07-11/"
	],
	[
		"2023-07-11",
		"Norway's government said Tuesday it was pledging an additional 2.5 billion kroner ($240 million) of military aid to Ukraine, bringing the total to 10 billion for the year. ",
		"Уряд Норвегії заявив у вівторок, що обіцяє надати додаткові 2,5 мільярда крон (240 мільйонів доларів) військової допомоги Україні, довівши загальну суму до 10 мільярдів за рік.",
		"https://www.thelocal.no/20230711/norway-increases-military-aid-to-ukraine"
	],
	[
		"2023-07-10",
		"The German arms maker Rheinmetall will deploy production facilities for the production of armored vehicles in Ukraine within the following 12 weeks.",
		"Німецький виробник зброї Rheinmetall протягом наступних 12 тижнів розгорне в Україні потужності з виробництва бронетехніки.",
		"https://edition.cnn.com/2023/07/10/business/rheinmetall-german-tank-factory-ukraine/index.html"
	],
	[
		"2023-07-09",
		"Poland has supplied Ukraine with about 12 Mi-24 attack helicopters without announcement.",
		"Польща без оголошення поставила Україні близько 12 ударних вертольотів Мі-24.",
		"https://www.wsj.com/articles/ukraine-war-counteroffensive-frontlines-russia-add3e4e4"
	],
	[
		"2023-07-07",
		"Only around half of heavy weapons committed to Ukraine have been delivered, experts say: 'The gap between promised and delivered military aid is wide'. The Kiel Institute said some European countries like the Czech Republic, Slovenia, Poland, and Slovakia had outperformed others, delivering \"upwards of 80 percent of their promised heavy weapons.\"",
		"Лише близько половини важкого озброєння, обіцяного Україні, було поставлено: «Розрив між обіцяною та наданою військовою допомогою великий». Кільський інститут заявив, що деякі європейські країни, такі як Чехія, Словенія, Польща та Словаччина, перевершили інші, поставивши «понад 80 відсотків своїх обіцяних важких озброєнь».",
		"https://www.businessinsider.com/only-half-of-heavy-weapons-promised-to-ukraine-delivered-experts-2023-7"
	],
	[
		"2023-07-07",
		"The Defense Department announced an additional security assistance package of up to $800 million aimed to support Ukraine: \n\n- 300 Stingers\n- 36 artillery systems M777\n- 17 recovery tactical vehicles\n- 32 Bradleys\n- 32 Strykers\n- UAS Penguin\n- air-to-air AIM-7 missilles\n- TOW missiles\n- small arms munition \n\nThe package also contains dual-purpose improved conventional munitions, or DPICM, which the Pentagon is providing for the first time to Ukraine",
		"Міністерство оборони США оголосило про додатковий пакет безпекової допомоги на суму до 800 мільйонів доларів, спрямований на підтримку України: \n\n- 300 Стінгерів\n- 36 артилерійських систем M777\n- 17 евакуаційно-тактичних машин\n- 32 Бредлі\n- 32 Страйкери\n- UAS Penguin\n- ракети повітря-повітря AIM-7\n- ракети TOW\n- боєприпаси до стрілецької зброї\n\nПакет також містить вдосконалені звичайні боєприпаси подвійного призначення або DPICM, які Пентагон вперше надає Україні",
		"https://www.defense.gov/News/News-Stories/Article/Article/3451905/dod-announces-800m-security-assistance-package-for-ukraine/"
	],
	[
		"2023-07-07",
		"Slovakia will supply Ukraine with 16 Zuzanna-2 howitzers.",
		"Словаччина поставить Україні 16 гаубиць Zuzanna-2.",
		"https://en.interfax.com.ua/news/general/921535.html"
	],
	[
		"2023-07-07",
		"Ukraine expects to receive Turkish-made Fırtına self-propelled howitzers.",
		"Україна розраховує отримати самохідні гаубиці Fırtına турецького виробництва.",
		"https://www.overtdefense.com/2023/07/07/ukraine-aims-to-procure-t-155-firtina-howitzers-from-turkey/"
	],
	[
		"2023-07-07",
		"Czhech Republic will provide Ukraine with attack helicopters, possibly Mi-24, large-caliber ammunition and will provide training of Ukrainian pilots for F-16s.",
		"Чехія надасть Україні ударні гелікоптери, можливо, Мі-24, великокаліберні боєприпаси та забезпечить навчання українських пілотів на F-16.",
		"https://www.youtube.com/live/-JpwYk3BIjU?feature=share"
	]
]