[
	[
		"2025-10-26",
		"Italy is preparing a new military aid package for Ukraine that will include ammunition and SAMP/T air defense missiles. The package — Rome's 12th since the start of russia's full-scale invasion — could be approved and delivered by the end of the year",
		"Італія готує новий пакет військової допомоги для України, який включатиме боєприпаси та ракети протиповітряної оборони SAMP/T. Пакет — 12-й з початку повномасштабного вторгнення Росії — може бути затверджений і доставлений до кінця року.",
		"https://en.defence-ua.com/news/italy_preparing_12th_military_aid_package_for_ukraine_focus_on_ammunition_and_sampt_missiles-16266.html"
	],
	[
		"2025-10-24",
		"British Prime Minister Starmer announced that the country would transfer 5,000 new multipurpose missiles to the Ukrainian military.",
		"Прем'єр-міністр Великої Британії Стармер оголосив, що країна передасть українській армії 5000 нових багатоцільових ракет.",
		"https://news.novyny.live/en/uk-to-send-5000-new-missiles-to-ukraine-starmer-confirms-289732.html"
	],
	[
		"2025-10-24",
		"France has announced another package of military support for Ukraine, which includes the transfer of additional Mirage 2000 fighters and Aster missiles, intended to strengthen the Ukrainian air defense system.",
		"Франція оголосила про черговий пакет військової допомоги Україні, який включає передачу додаткових винищувачів Mirage 2000 і ракет Aster, призначених для посилення української системи протиповітряної оборони.",
		"https://prm.ua/en/mirage-and-more-macron-announced-a-new-aid-package-for-ukraine/"
	],
	[
		"2025-10-24",
		"Canadian Defence Minister David McGuinty told the House of Commons defence committee this week that his department had cancelled the contract with Armatec Survivability in Dorchester, Ont., near London, to refurbish 25 light armoured vehicles, but said he couldn’t explain the reason behind the decision.",
		"Міністр оборони Канади Девід МакГінті повідомив комітету з питань оборони Палати громад цього тижня, що його відомство розірвало контракт з компанією Armatec Survivability у Дорчестері, Онтаріо, поблизу Лондона, на ремонт 25 легких броньованих транспортних засобів, але зазначив, що не може пояснити причини такого рішення.",
		"https://globalnews.ca/news/11491309/ukraine-canada-armoured-vehicle-contract-cancelled-explanation/"
	],
	[
		"2025-10-24",
		"Slovak PM : We Will not allocate single cent to military support for Ukraine.",
		"Прем'єр-міністр Словаччини: Ми не виділимо жодного цента на військову підтримку України.",
		"https://www.saba.ye/en/news3576057.htm"
	],
	[
		"2025-10-24",
		"Ukraine’s Foreign Minister Andriy Sibiga held a meeting with Norway’s Minister of Defense Tore O. Sandvik, where they discussed Ukraine’s urgent and long-term needs, as well as further steps to develop defense cooperation between the two countries.",
		"Міністр закордонних справ України Андрій Сібіга провів зустріч з міністром оборони Норвегії Торе О. Сандвіком, під час якої вони обговорили нагальні та довгострокові потреби України, а також подальші кроки з розвитку оборонного співробітництва між двома країнами.",
		"https://mezha.net/eng/bukvy/ukraine-and-norway-strengthen-defense-cooperation-in-2025/"
	],
	[
		"2025-10-23",
		"As part of the 2026 spending bill, France intends to order additional Aster surface-to-air missiles and SCALP-EG cruise missiles. It is worth noting that France, Italy and the United Kingdom have already placed a substantial order for 1,118 Aster missiles. The French order includes Aster 30 missiles intended for Ukraine.",
		"В рамках законопроекту про видатки на 2026 рік Франція має намір замовити додаткові ракети класу «земля-повітря» Aster та крилаті ракети SCALP-EG. Варто зазначити, що Франція, Італія та Велика Британія вже розмістили значне замовлення на 1118 ракет Aster. Французьке замовлення включає 30 ракет Aster, призначених для України.",
		"https://x.com/aidefranceukr/status/1981333706741592339"
	],
	[
		"2025-10-23",
		"Ukraine has received full confirmation of US support for its air defense. US President Donald Trump has given the green light for the transfer of Patriot air defense systems to Kyiv, according to Andrii Yermak, head of the Office of the President of Ukraine.",
		"Україна отримала повне підтвердження підтримки США у сфері протиповітряної оборони. Президент США Дональд Трамп дав зелене світло на передачу Києву систем протиповітряної оборони Patriot, повідомив глава Офісу Президента України Андрій Єрмак.",
		"https://newsukraine.rbc.ua/news/trump-greenlights-patriot-deliveries-to-ukraine-1761216080.html"
	],
	[
		"2025-10-22",
		"Czechia urges to send Ukraine ammunition and air defense systems before winter.",
		"Чехія закликає надіслати Україні боєприпаси та системи протиповітряної оборони до настання зими.",
		"https://newsukraine.rbc.ua/news/czechia-urges-to-send-ukraine-ammunition-1761140908.html"
	],
	[
		"2025-10-21",
		"Italian Defense Minister Guido Crosetto reportedly told a meeting of defense ministers from the North Atlantic Treaty Organization last week that Rome was warming up to the idea of taking part in the purchase of weapons for Ukraine from the US under the (Prioritized Ukraine Requirements List, or PURL, initiative.",
		"Міністр оборони Італії Гідо Кросетто, як повідомляється, заявив на зустрічі міністрів оборони країн-членів НАТО минулого тижня, що Рим все більше схиляється до ідеї взяти участь у закупівлі зброї для України у США в рамках ініціативи «Пріоритетний перелік потреб України» (PURL).",
		"https://www.kyivpost.com/post/62588"
	],
	[
		"2025-10-20",
		"John Cockerill Defense (JCD) is set to modernize 113 vehicles for Ukraine, converting them into ambulance versions.",
		"Компанія John Cockerill Defense (JCD) планує модернізувати 113 автомобілів для України, переобладнавши їх у машини швидкої допомоги.",
		"https://united24media.com/latest-news/belgiums-john-cockerill-company-to-convert-113-military-vehicles-into-ambulances-for-ukraine-12633"
	],
	[
		"2025-10-17",
		"Finland will deliver its 30th materiel assistance package to Ukraine. The package valued at EUR 52 million consists mostly of new orders from Finnish companies.",
		"Фінляндія надасть Україні 30-й пакет матеріальної допомоги. Пакет вартістю 52 млн євро складається переважно з нових замовлень від фінських компаній.",
		"https://www.defmin.fi/en/topical/press_releases_and_news/minister_hakkanen_finland_sends_more_defence_materiel_assistance_to_ukraine.15303.news#b0addef3"
	],
	[
		"2025-10-16",
		"Germany on Wednesday pledged more than USD 2 billion in military aid for Ukraine.",
		"У середу Німеччина пообіцяла надати Україні військову допомогу на суму понад 2 мільярди доларів США.",
		"https://www.msn.com/en-in/news/world/germany-pledges-big-military-aid-package-to-ukraine-as-kyiv-puts-2026-defense-needs-at-120-bn/ar-AA1OwUWF"
	],
	[
		"2025-10-16",
		"Japan has shipped another batch of military vehicles to Ukraine, adding 30 more units as part of its ongoing support program for the country’s defense effortsю",
		"Японія відправила до України чергову партію військових транспортних засобів, додавши ще 30 одиниць у рамках своєї програми підтримки оборонних зусиль країни.",
		"https://thedefensepost.com/2025/10/16/japan-military-vehicles-ukraine/"
	],
	[
		"2025-10-16",
		"Australia has concluded its deployment of a Royal Australian Air Force E-7A Wedgetail aircraft to support NATO efforts delivering humanitarian and military aid to Ukraine. ",
		"Австралія завершила розгортання літака E-7A Wedgetail Королівських повітряних сил Австралії для підтримки зусиль НАТО з надання гуманітарної та військової допомоги Україні.",
		"https://defence-industry.eu/australia-ends-e-7a-wedgetail-nato-mission-supporting-aid-delivery-to-ukraine-under-operation-kudu/"
	],
	[
		"2025-10-16",
		"Poland has signed an agreement with eight Nordic and Baltic partners to establish a base center, Camp Jomsborg, at the Demba-Lip Land Forces Training Center. The facility will host drone operations training for military personnel from NATO countries and Ukraine.",
		"Польща підписала угоду з вісьмома партнерами з країн Північної Європи та Балтії про створення базового центру Camp Jomsborg у Навчальному центрі сухопутних військ Демба-Ліп. У цьому центрі військовослужбовці з країн НАТО та України проходитимуть навчання з експлуатації безпілотних літальних апаратів.",
		"https://rubryka.com/en/2025/10/16/polshha-pidpysala-ugodu-z-vismoma-krayinamy-skandynaviyi-j-baltiyi-pro-rozbudovu-navchalnogo-tsentru-dlya-ukrayinskyh-vijskovyh/"
	],
	[
		"2025-10-16",
		"Trump proposes new Ukraine military support fund financed by 500% tariff on China.",
		"Трамп пропонує створити новий фонд військової підтримки України, який фінансуватиметься за рахунок 500-відсоткового мита на китайські товари.",
		"https://united24media.com/latest-news/trump-proposes-ukraine-victory-fund-financed-by-500-tariff-on-chinese-imports-12544"
	],
	[
		"2025-10-16",
		"Information about Ukraine receiving new Patriot air defense systems will be disclosed only after partner countries announce the transfer.",
		"Інформація про отримання Україною нових систем протиповітряної оборони Patriot буде оприлюднена лише після того, як країни-партнери оголосять про передачу.",
		"https://english.nv.ua/nation/ukraine-will-announce-new-patriot-air-defense-systems-after-partners-confirm-transfer-ihnat-50553170.html"
	],
	[
		"2025-10-16",
		"Sweden is ready to strengthen its military aid to Ukraine, starting with radar reconnaissance and early warning aircraft, and later considering the transfer of Gripen fighter jets, according to Defense Minister Pål Jonson.",
		"Швеція готова посилити військову допомогу Україні, почавши з літаків радіолокаційної розвідки та раннього попередження, а згодом розглянувши можливість передачі винищувачів Gripen, за словами міністра оборони Пала Йонсона.",
		"https://newsukraine.rbc.ua/news/sweden-boosts-ukraine-support-with-first-1760583896.html"
	],
	[
		"2025-10-10",
		"Hundreds of missiles delivered to Ukraine months ahead of schedule.",
		"Сотні ракет доставлено в Україну на кілька місяців раніше запланованого терміну.",
		"https://www.gov.uk/government/news/hundreds-of-missiles-delivered-to-ukraine-months-ahead-of-schedule-as-uk-leads-kyiv-trade-delegation"
	],
	[
		"2025-10-10",
		"US Senate backs $925 bn defense package with $500 mn Ukraine aid push.",
		"Сенат США підтримав оборонний пакет на суму 925 млрд доларів із виділенням 500 млн доларів на допомогу Україні.",
		"https://euromaidanpress.com/2025/10/10/us-senate-backs-925-bn-defense-package-with-500-mn-ukraine-aid-push/"
	],
	[
		"2025-10-10",
		"Poland has become the largest supplier of tanks to Ukraine, providing more armored vehicles than any other nation since the start of Russia’s full-scale invasion.",
		"Польща стала найбільшим постачальником танків до України, надавши більше броньованих машин, ніж будь-яка інша країна з початку повномасштабного вторгнення Росії.",
		"https://defence-blog.com/poland-becomes-ukraines-top-tank-donor/"
	],
	[
		"2025-10-08",
		"Germany has quietly ordered more than 1,000 Mercedes-Benz Zetros military trucks for Ukraine to strengthen the country’s logistics and transport network.",
		"Німеччина тихо замовила понад 1000 військових вантажівок Mercedes-Benz Zetros для України, щоб посилити логістичну та транспортну мережу країни.",
		"https://thedefensepost.com/2025/10/08/germany-military-trucks-ukraine/"
	]
]