[
	[
		"2023-10-13",
		"A new survey conducted by the Chicago Council on Global Affairs shows that nearly two-thirds of those polled (63 percent) support sending additional arms and military supplies to Ukraine, and 61 percent support providing economic assistance.",
		"Нове опитування, проведене Чиказькою радою з глобальних справ, показує, що майже дві третини опитаних (63 відсотки) підтримують надсилання додаткового озброєння та військових поставок Україні, а 61 відсоток підтримують надання економічної допомоги.",
		"https://www.politico.eu/article/despite-washington-chaos-americans-still-want-to-support-ukraine/"
	],
	[
		"2023-10-13",
		"The Netherlands will supply to Ukraine extra Patriot missiles for air defense and patrol boats to provide safe grain export.",
		"Нідерланди поставлять Україні додаткові ракети Patriot для ППО та патрульні катери для забезпечення безпечного експорту зерна.",
		"https://x.com/MinPres/status/1712848320694006132?s=20"
	],
	[
		"2023-10-11",
		"The Department of Defense has announced the 48th presidential drawdown authority military aid package for Ukraine valued at $200 mln. It includes air defense capabilities, anti-tank weapons, and other equipment.",
		"Міністерство оборони оголосило про 48-й пакет військової допомоги Україні за розпорядженням Президента України на суму 200 мільйонів доларів. Це засоби протиповітряної оборони, протитанкова зброя та інше обладнання.",
		"https://www.defense.gov/News/Releases/Release/Article/3553644/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-10-11",
		"A new package of military support for Ukraine, worth more than £100m is  announced by the Defence Secretary of the UK. It will include air defense systems MSI-DS Terrahawk Paladin. ",
		"Міністр оборони Великої Британії оголосив про новий пакет військової підтримки для України вартістю понад 100 мільйонів фунтів стерлінгів. До його складу увійдуть системи ППО MSI-DS Terrahawk Paladin.",
		"https://www.gov.uk/government/news/major-new-package-of-support-for-ukraines-counter-offensive-announced-by-grant-shapps"
	],
	[
		"2023-10-10",
		"Germany will provide Ukraine with a new €1 billion ($1.1 billion) military aid package, Defense Minister Boris Pistorius announced on Tuesday.",
		"Німеччина надасть Україні новий пакет військової допомоги на 1 мільярд євро (1,1 мільярда доларів), повідомив у вівторок міністр оборони Борис Пісторіус.",
		"https://www.aa.com.tr/en/europe/germany-announces-11b-military-aid-package-for-ukraine/3014609"
	],
	[
		"2023-10-10",
		"US senators from both parties intend to pass an annual aid package for Ukraine worth between US$50 billion and US$100 billion in the coming weeks.",
		"Американські сенатори від обох партій мають намір ухвалити щорічний пакет допомоги Україні на суму від 50 до 100 мільярдів доларів США найближчими тижнями.",
		"https://news.yahoo.com/us-senators-seek-pass-annual-225241445.html"
	],
	[
		"2023-10-06",
		"President of Slovakia Zuzana Čaputová moved to prevent the technocratic interim government from sending a shipment of weapons to Ukraine.",
		"Президент Словаччини Зузана Чапутова вжила заходів, щоб перешкодити технократичному тимчасовому уряду відправити партію зброї в Україну.",
		"https://www.euractiv.com/section/politics/news/slovak-president-halts-military-aid-to-ukraine-amid-coalition-talks/"
	],
	[
		"2023-10-06",
		"Sweden will send Ukraine a new military support package worth 2.2 billion crowns ($199 million) - consisting mainly of artillery ammunition - and is looking into sending fighter jets, Defence Minister Pal Jonson said.",
		"Швеція надішле Україні новий пакет військової підтримки вартістю 2,2 мільярда крон (199 мільйонів доларів США), який складається переважно з артилерійських боєприпасів, і розглядає можливість відправки винищувачів, заявив міністр оборони Пал Йонсон.",
		"https://www.reuters.com/world/europe/sweden-give-ukraine-new-200-million-military-aid-package-2023-10-06/"
	],
	[
		"2023-10-04",
		"Rheinmetall has again been awarded a contract to supply automated reconnaissance systems to Ukraine. The double-digit million order was placed by the German government.",
		"Компанія Rheinmetall знову уклала контракт на постачання автоматизованих розвідувальних систем в Україну. Двозначне мільйонне замовлення розмістив уряд Німеччини.",
		"https://x.com/RheinmetallAG/status/1709601496600347076?s=20"
	],
	[
		"2023-10-03",
		"Although the U.S. has the funding to continue to support Ukraine's war efforts in the short term, Pentagon officials underscored today that more funds will be needed to continue to assist Ukraine in the long term.",
		"Хоча США мають фінансування, щоб продовжувати підтримувати військові зусилля України в короткостроковій перспективі, офіційні особи Пентагону підкреслили сьогодні, що для продовження допомоги Україні в довгостроковій перспективі буде потрібно більше коштів.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3547168/continued-support-to-ukraine-replenishing-military-stocks-priorities-for-depart/"
	],
	[
		"2023-10-02",
		"the EU had proposed a “bilateral envelope” worth €5bn for Ukraine’s armed forces. EU countries would train 40,000 soldiers, provide “special training” for fighter pilots and deepen ties between EU and Ukrainian defence companies.",
		"ЄС запропонував «двосторонній пакет» на 5 мільярдів євро для збройних сил України. Країни ЄС навчать 40 тисяч солдатів, забезпечать «спеціальну підготовку» для пілотів винищувачів і поглиблюють зв’язки між оборонними компаніями ЄС та України.",
		"https://www.theguardian.com/world/2023/oct/02/eu-foreign-ministers-convene-kyiv-ukraine-russia-war"
	],
	[
		"2023-10-02",
		"An extraordinary meeting of EU foreign affairs ministers in Kyiv failed to unblock a €500-million package of military assistance for Ukraine. Hungary has kept a firm veto on the aid since May and has not budged despite the repeated pleas by Josep Borrell, the bloc's foreign policy chief, who has tried to mediate in the bilateral dispute in a bid to maintain a united front.",
		"Позачергова зустріч міністрів закордонних справ ЄС у Києві не змогла розблокувати пакет військової допомоги Україні на 500 мільйонів євро. Угорщина зберігає тверде вето на допомогу з травня і не зрушує з місця, незважаючи на неодноразові прохання Жозепа Борреля, керівника зовнішньої політики блоку, який намагався виступити посередником у двосторонній суперечці, намагаючись зберегти єдиний фронт.",
		"https://www.euronews.com/my-europe/2023/10/02/impasse-continues-over-hungarian-veto-on-eu-military-aid-for-ukraine"
	],
	[
		"2023-10-02",
		"Mexican President Andres Manuel Lopez Obrador on Monday panned U.S. military aid to Ukraine, suggesting it was \"irrational,\" and stepped up criticism of the war effort as he urged Washington to devote more resources to helping Latin American countries.",
		"Президент Мексики Андрес Мануель Лопес Обрадор у понеділок розкритикував військову допомогу США Україні, назвавши її «нераціональною», і посилив критику військових дій, закликавши Вашингтон виділити більше ресурсів на допомогу країнам Латинської Америки.",
		"https://www.reuters.com/world/americas/mexico-president-slams-us-spending-ukraine-irrational-2023-10-02/"
	],
	[
		"2023-10-02",
		"Denmark supports the creation of the Ukraine military support fund in the amount of 20 billion euros ($21 billion) for the next four years within the framework of the European Peace Facility, citing Danish Foreign Minister Lars Løkke Rasmussen.",
		"Данія підтримує створення фонду військової підтримки України в розмірі 20 млрд євро на найближчі чотири роки в рамках Європейського фонду миру",
		"https://news.yahoo.com/denmark-backs-creation-21-billion-124306103.html"
	],
	[
		"2023-10-02",
		"Britain has run out of defence equipment to donate to Ukraine and other countries should step in and shoulder more of the burden. The comments come after Ben Wallace revealed that he asked Rishi Sunak to spend £2.3 billion more on support for Ukraine before he resigned as defence secretary last month. Mr Wallace warned that the UK had been overtaken by Germany as the biggest European military donor to Ukraine as he called for the 50 per cent increase on funding that the UK has committed so far. “We will continue to source equipment to provide for Ukraine, but what they need now is things like air defence assets and artillery ammunition and we’ve run dry on all that.”",
		"У Британії закінчилося оборонне обладнання для пожертвування Україні, і інші країни повинні втрутитися та взяти на себе більший тягар. Ці коментарі з’явилися після того, як Бен Воллес заявив, що він попросив Ріші Сунака витратити ще 2,3 мільярда фунтів стерлінгів на підтримку України, перш ніж піти у відставку з посади міністра оборони минулого місяця. Пан Воллес попередив, що Велика Британія була випереджена Німеччиною як найбільший європейський військовий донор для України, оскільки він закликав до 50-відсоткового збільшення фінансування, яке Велика Британія зобов’язалася до цього часу. «Ми продовжуватимемо забезпечувати Україну обладнанням, але те, що їм зараз потрібно, — це засоби протиповітряної оборони та артилерійські боєприпаси, і ми все це вичерпали».",
		"https://www.telegraph.co.uk/world-news/2023/10/02/britain-run-out-of-arms-send-to-ukraine-says-military-chief/"
	],
	[
		"2023-10-01",
		"A populist left-wing party SMER won elections in Slovakia. Its leader Robert Fico has promised to halt all military help to Ukraine.",
		"На виборах у Словаччині перемогла популістська ліва партія SMER. Її лідер Роберт Фіцо пообіцяв припинити всю військову допомогу Україні.",
		"https://www.nytimes.com/2023/09/30/world/europe/slovakia-election-ukraine-fico.html"
	],
	[
		"2023-09-30",
		"Swiss Foreign Minister Ignazio Cassis said his country plans to finance a quarter of the mine clearance operations needed in Ukraine. Switzerland plans to provide $100m of the $400m Kyiv has said it needs to remove the mines from its territory.",
		"Міністр закордонних справ Швейцарії Ігнаціо Кассіс заявив, що його країна планує профінансувати чверть необхідних для України операцій з розмінування. Швейцарія планує надати 100 мільйонів доларів",
		"https://www.aljazeera.com/news/2023/9/30/russia-ukraine-war-list-of-key-events-day-584"
	],
	[
		"2023-09-30",
		"President of Ukraine Volodymyr Zelenskyy met with representatives of defense companies from the United States, the United Kingdom, Germany, France, Türkiye, Sweden and the Czech Republic. The interlocutors discussed the prospects for partnership and joint arms production, in particular, taking into account Ukraine's war experience.",
		"Президент України Володимир Зеленський зустрівся з представниками оборонних компаній США, Великої Британії, Німеччини, Франції, Туреччини, Швеції та Чехії. Співрозмовники обговорили перспективи партнерства та спільного виробництва озброєнь, зокрема з урахуванням досвіду війни України.",
		"https://www.president.gov.ua/en/news/zaraz-slushnij-chas-dlya-stvorennya-v-ukrayini-vijskovogo-ha-85977"
	],
	[
		"2023-09-30",
		"Metinvest had handed over Sirko Reconnaissance UAVs, DJI Mavic 3T drones and FPV drones to the Ukrainian military. The aid was transferred as part of the Steel Front initiative. It is reported that 250 FPV drones, 5 DJI Mavic 3T drones and 3 Sirko drones were transferred.",
		"Метінвест передав українським військовим БПЛА Sirko Reconnaissance, дрони DJI Mavic 3T і FPV. Допомога була передана в рамках ініціативи «Сталевий фронт». Повідомляється, що передано 250 дронів FPV, 5 дронів DJI Mavic 3T і 3 дрони Sirko.",
		"https://mil.in.ua/en/news/metinvest-hands-over-a-batch-of-drones-worth-uah-4-million-to-the-ukrainian-military/"
	],
	[
		"2023-09-30",
		"The Czech Republic will transfer to Ukraine a license to produce CZ BREN 2 assault rifles.",
		"Чехія передасть Україні ліцензію на виробництво автоматів CZ BREN 2.",
		"https://mil.in.ua/en/news/czech-cz-bren-2-assault-rifles-to-be-produced-in-ukraine/"
	],
	[
		"2023-09-29",
		"Ukrainian and French defense companies signed agreements during the visit of French Defense Minister Sébastien Lecornu to Kyiv. The Minister of the French Armed Forces was accompanied by representatives of about 20 French companies specializing in the production of military equipment, such as armored vehicles, artillery, drones, cybersecurity and mine clearing equipment. They signed about twenty contracts, letters of intent, or memorandums of understanding with Ukrainian defense companies.",
		"Українські та французькі оборонні підприємства підписали угоди під час візиту міністра оборони Франції Себастьєна Лекорню до Києва. Міністра збройних сил Франції супроводжували представники близько 20 французьких компаній, що спеціалізуються на виробництві військової техніки, такої як бронетехніка, артилерія, безпілотники, обладнання для кібербезпеки та розмінування. Вони підписали близько двадцяти контрактів, протоколів про наміри чи меморандумів про взаєморозуміння з українськими оборонними підприємствами.",
		"https://www.mil.gov.ua/news/2023/09/28/bilshe-zbroi-proekti-z-vijskovo-tehnichnogo-spivrobitnicztva-ta-pidgotovka-voiniv-zsu-rustem-umerov-i-sebasten-lekornyu-obgovorili-podalshu-oboronnu-spivpraczyu/"
	],
	[
		"2023-09-28",
		"Rheinmetall has received authorization to establish a production in Ukraine. As a first step, cooperation will focus on the maintenance and repair of vehicles transferred to Ukraine under the German government’s multilateral Ringtausch equipment exchange program.",
		"Компанія Rheinmetall отримала дозвіл на відкриття виробництва в Україні. В якості першого кроку співпраця буде зосереджена на технічному обслуговуванні та ремонті транспортних засобів, переданих в Україну в рамках багатосторонньої програми обміну обладнанням Ringtausch уряду Німеччини.",
		"https://www.rheinmetall.com/en/media/news-watch/news/2023/9/2023-09-28-german-federal-cartel-office-gives-go-ahead-for-jv-rheinmetall-ukraine-defence-industry"
	],
	[
		"2023-09-28",
		"NATO Secretary General Jens Stoltenberg announced framework contracts for the production of ammunition, both for Ukraine and to replenish the stockpiles of member states. “There is no defense without industry. I can now confirm that NATO has framework contracts for the production of major ammunition worth €2.4 billion. Of these, €1 billion are already signed contracts. It regards 155 mm artillery ammunition, anti-tank weapons, and ammunition for main battle tanks,” Stoltenberg said.",
		"Генеральний секретар НАТО Єнс Столтенберг анонсував контракти на виробництво боєприпасів як для України, так і для поповнення запасів країн-членів. «Немає оборони без промисловості. Тепер я можу підтвердити, що НАТО має рамкові контракти на виробництво основних боєприпасів на суму 2,4 мільярда євро. З них €1 млрд – це вже підписані контракти. Це стосується артилерійських боєприпасів калібру 155 мм, протитанкової зброї та боєприпасів для основних бойових танків», – сказав Столтенберг.",
		"https://mil.in.ua/en/news/nato-signs-e2-4-billion-framework-contracts-for-ammunition/"
	],
	[
		"2023-09-27",
		"The Bulgarian Parliament approved the transfer of S-300 missiles to Ukraine.",
		"Парламент Болгарії схвалив передачу Україні ракет С-300.",
		"https://sofiaglobe.com/2023/09/27/bulgarias-parliament-votes-to-supply-unserviceable-s-300-missiles-to-ukraine/"
	],
	[
		"2023-09-27",
		"The Ministry of National Defence and the Lithuanian Armed Forces handed over radiolocation sets to the Ukrainian Navy. The equipment supports maritime surveillance and development of maritime awareness capabilities. It has been provided at the request of the Ukrainian Navy.",
		"Литва передала ВМС України радіолокаційні комплекси",
		"https://kam.lt/en/latest-lithuanias-assistance-package-to-ukraine-radiolocation-equipment-sets-for-the-ukrainian-navy/"
	],
	[
		"2023-09-27",
		"In Switzerland lawmakers have developed several possible mechanisms that would allow the re-export of weapons to Ukraine.",
		"У Швейцарії законодавці розробили кілька можливих механізмів, які дозволять реекспорт зброї в Україну.",
		"https://mil.in.ua/en/news/switzerland-proposes-mechanisms-for-re-exporting-weapons-to-ukraine/"
	],
	[
		"2023-09-26",
		"Germany and Estonia will participate in a joint framework to contract ammunition for Ukraine.",
		"Німеччина та Естонія візьмуть участь у спільному контрактуванні боєприпасів для України.",
		"https://x.com/BMVg_Bundeswehr/status/1706685724324426007?s=20"
	],
	[
		"2023-09-26",
		"The European branch of the American corporation General Dynamics, the Czechoslovak Group holding company, and Ukrainian Armor are considering the possibility of licensed production of ASCOD armored fighting vehicles",
		"Європейська філія американської корпорації General Dynamics, холдинг Czechoslovak Group і Українська бронетехніка розглядають можливість ліцензійного виробництва бойових броньованих машин ASCOD",
		"https://mil.in.ua/en/news/ukrainian-armor-is-considering-the-possibility-of-producing-ascod-armored-fighting-vehicles-in-ukraine/"
	],
	[
		"2023-09-23",
		"Justin Trudeau, Prime minister of Canada: \"This afternoon, I announced new military support for Ukraine – we’ll provide them with 50 made-in-Canada armoured vehicles. I also confirmed that we’ll contribute pilot and maintenance instructors for F-16 fighter aircraft, and support for Leopard 2 tank maintenance.\"",
		"Джастін Трюдо, прем’єр-міністр Канади: «Сьогодні вдень я оголосив про нову військову підтримку України – ми надамо їм 50 канадських броньованих машин. Я також підтвердив, що ми надамо інструкторів для пілотів та з технічного обслуговування винищувачів F-16 та підтримку технічного обслуговування танків Leopard 2».",
		"https://x.com/JustinTrudeau/status/1705362591965479128?s=20"
	],
	[
		"2023-09-22",
		"Biden informed Zelenskyy that Washington would send a number of  ATACMS long-range missiles to Kyiv, citing information from four unnamed US officials.",
		"За інформацією чотирьох неназваних офіційних осіб США Вашингтон надішле до Києва кілька ракет великої дальності ATACMS",
		"https://www.cbsnews.com/news/biden-tells-zelenskyy-u-s-will-provide-ukraine-with-atacms-long-range-missiles/"
	],
	[
		"2023-09-22",
		"United States President Joe Biden has announced that the first US-made Abrams tanks will be delivered to Ukraine next week.",
		"Президент США Джо Байден заявив, що перші американські танки Abrams будуть доставлені в Україну наступного тижня.",
		"https://www.aljazeera.com/news/2023/9/22/what-we-know-about-us-abrams-tanks-arriving-in-ukraine-next-week"
	],
	[
		"2023-09-21",
		"Poland will no longer supply weapons to Ukraine, Poland’s Prime Minister Mateusz Morawiecki was reported as saying, amid growing tension between Warsaw and Kyiv in a dispute over grain exports.",
		"Польща більше не постачатиме зброю Україні, повідомив прем’єр-міністр Польщі Матеуш Моравецький на тлі зростання напруженості між Варшавою та Києвом у суперечці щодо експорту зерна.",
		"https://www.aljazeera.com/news/2023/9/21/poland-to-halt-supply-of-weapons-to-ukraine-as-grain-dispute-grows"
	],
	[
		"2023-09-21",
		"Germany is boosting Ukraine's robot fleet with the promise of 50 new USVs (uncrewed surface vessels).",
		"Німеччина збільшує флот українських роботів, обіцяючи 50 нових надводних суден без екіпажу",
		"https://www.forbes.com/sites/davidhambling/2023/09/21/germany-to-supply-ukraine-with-drone-boats--but-where-will-it-get-them/"
	],
	[
		"2023-09-21",
		"Ukraine has received 10 Swedish variants of Leopard 2A5 tanks Stridsvagn 122, together with Ukrainian crews trained in Sweden.",
		"Україна отримала 10 шведських танків Stridsvagn 122",
		"https://www.forsvarsmakten.se/en/news/2023/09/swedish-main-battle-tank-stridsvagn-122-on-site-in-ukraine/"
	],
	[
		"2023-09-21",
		"The Danish government is looking to increase ammunition production and already has its eyes set on purchasing back land with an old weapons factory in a bid to help Ukraine and boost NATO’s military production.",
		"Уряд Данії прагне збільшити виробництво боєприпасів і вже має намір викупити землю зі старим збройовим заводом",
		"https://www.euractiv.com/section/politics/news/denmark-to-encourage-nato-ammunition-production/"
	],
	[
		"2023-09-21",
		"The Department of Defense is sending an additional security assistance package to meet Ukraine's critical security and defense needs. It includes air defence Avenger systems, artillery shells and anti-armor rockets.",
		"США надсилає новий пакет військової допомоги Україні на 325 мільйонів доларів. До нього входять системи протиповітряної оборони «Авенджер», артилерійські снаряди та протитанкові ракети.",
		"https://www.defense.gov/News/Releases/Release/Article/3534283/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-09-20",
		"Minister of Defense of Spain Margarita Robles announced a new package of security and humanitarian aid to Ukraine. It will include APC, rigid hull inflatable boats, anti-aircraft missiles and missile launchers and military trucks.",
		"Міністр оборони Іспанії Маргарита Роблес анонсувала новий пакет безпекової та гуманітарної допомоги Україні. До нього увійдуть БТР, надувні човни з жорстким корпусом, зенітно-ракетні комплекси та пускові установки ракет, військові вантажівки.",
		"https://www.ukrinform.net/rubric-ato/3763834-spain-announces-new-package-of-security-and-humanitarian-aid-to-ukraine.html"
	],
	[
		"2023-09-20",
		"Albania hands over 22 MaxxPro armored vehicles to Ukraine",
		"Албанія передала Україні 22 бронемашини MaxxPro",
		"https://closetheskyoverukraine.com/latest-news/albania-hands-over-22-maxx-pro-armored-vehicles-to-ukraine"
	],
	[
		"2023-09-19",
		"US military aid and training for Ukrainian forces could be disrupted in the event of a US government shutdown.",
		"Представник Пентагону попередив у вівторок, що військова допомога США та навчання українських військових можуть бути зірвані в разі припинення роботи уряду США.",
		"https://edition.cnn.com/2023/09/19/politics/pentagon-shutdown-ukraine-warning/index.html"
	],
	[
		"2023-09-19",
		"Ukraine and France are discussing transferring of French fighter jets Mirage 2000 to Ukraine.",
		"Україна і Франція обговорюють передачу Україні французьких винищувачів Mirage 2000.",
		"https://www.intelligenceonline.com/international-dealmaking/2023/09/19/ukraine-inches-closer-to-obtaining-french-mirage,110054630-eve"
	],
	[
		"2023-09-17",
		"Canada announced it will supply Ukraine with $24.5 mln for air defense.",
		"Канада оголосила, що надасть Україні 24,5 мільйонів доларів на протиповітряну оборону.",
		"https://www.reuters.com/world/americas/canada-give-c33-mln-help-buy-air-defenses-ukraine-2023-09-17/"
	]
]