[
	[
		"2024-07-27",
		"The EU announced on Friday that it had made available the transfer of the first 1.5 billion ($1.6 billion) payout of interest earned on seized Russian assets to Kiev to help it buy weapons.",
		"У п'ятницю ЄС оголосив, що виділив перші 1,5 мільярда доларів ($1,6 мільярда) з відсотків, зароблених на заарештованих російських активах, Києву, щоб допомогти йому закупити зброю.",
		"https://www.bignewsnetwork.com/news/274471000/eu-sends-first-16-billion-from-seized-russian-money-to-kiev"
	],
	[
		"2024-07-27",
		"Russia continues to deepen bilateral relations with Iran and North Korea in exchange for the provision of lethal aid to the Russian military for use in Ukraine.",
		"Росія продовжує поглиблювати двосторонні відносини з Іраном і Північною Кореєю в обмін на надання летальної допомоги російським військовим для використання в Україні.",
		"https://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-july-27-2024"
	],
	[
		"2024-07-27",
		"The UK has confirmed the provision of over 12,000 anti-tank weapons to Ukraine since the onset of the conflict with Russia, according to a recent parliamentary exchange.",
		"Великобританія підтвердила надання Україні понад 12 000 одиниць протитанкового озброєння з початку конфлікту з Росією, згідно з нещодавнім парламентським обміном думками.",
		"https://ukdefencejournal.org.uk/uk-has-supplied-over-12000-anti-tank-missiles-to-ukraine/"
	],
	[
		"2024-07-25",
		"Warsaw is now providing its 45th package of military aid to Ukraine, which includes a significant amount of ammunition.",
		"Зараз Варшава надає 45-й пакет військової допомоги Україні, який включає значну кількість боєприпасів.",
		"https://www.ukrinform.net/rubric-defense/3888753-poland-sending-45th-package-of-defense-aid-to-ukraine-ambassador-zvarych.html"
	],
	[
		"2024-07-25",
		"The Pentagon has found $2 billion worth of additional errors in its calculations for ammunition, missiles and other equipment sent to Ukraine, increasing the improperly valued material to a total of $8.2 billion, a U.S. government report revealed on Thursday.",
		"Пентагон виявив додаткові помилки в розрахунках боєприпасів, ракет та іншого обладнання, відправлених в Україну, на суму 2 мільярди доларів, що збільшило загальну суму неправильно оцінених матеріалів до 8,2 мільярда доларів, йдеться у звіті уряду США, оприлюдненому в четвер.",
		"https://reuters.com/world/us/pentagon-finds-another-2-billion-accounting-errors-ukraine-aid-2024-07-25/"
	],
	[
		"2024-07-25",
		"UK Defense Secretary John Healey: 'The UK will \"step up\" with extra ammunition, guns, boats, and battlefield equipment needed by the Ukrainian Armed Forces on the front lines.' Healey confirmed the UK government's plan to commit £3 billion ($3.9 billion) in military aid to Ukraine this year and each subsequent year. London will assist allies in increasing their support for Ukraine \"to ensure that Ukraine prevails.\"",
		"Міністр оборони Великої Британії Джон Хілі: «Велика Британія надасть додаткові боєприпаси, гармати, катери та бойову техніку, необхідні Збройним силам України на передовій». Хілі підтвердив план уряду Великої Британії виділити 3 мільярди фунтів стерлінгів (3,9 мільярда доларів) на військову допомогу Україні цього року і кожного наступного року. Лондон допомагатиме союзникам у збільшенні їхньої підтримки України, «щоб забезпечити перемогу України».",
		"https://www.msn.com/en-us/news/world/uk-defense-secretary-pledges-faster-military-aid-to-ukraine/ar-BB1qBd96?ocid=BingNewsVerp&apiversion=v2&noservercache=1&domshim=1&renderwebcomponents=1&wcseo=1&batchservertelemetry=1&noservertelemetry=1"
	],
	[
		"2024-07-25",
		"Spain will strengthen Ukraine’s air defense with a battery of Hawk air defense systems.",
		"Іспанія посилить протиповітряну оборону України батареєю зенітно-ракетних комплексів Hawk.",
		"https://mil.in.ua/en/news/spain-to-reinforce-ukraine-s-air-defense-with-hawk-air-defense-systems-in-september/"
	],
	[
		"2024-07-25",
		"The Netherlands and Denmark purchased 14 Leopard 2A4 tanks for Ukraine's Armed Forces, and they will arrive in Ukraine by the end of the summer.",
		"Нідерланди та Данія закупили для Збройних сил України 14 танків Leopard 2A4, які прибудуть в Україну до кінця літа.",
		"https://www.pravda.com.ua/eng/news/2024/07/25/7467344/"
	],
	[
		"2024-07-23",
		"Slovakia's Defense Minister Robert Kalinak plans to increase the production of artillery shells from 125,000 this year to 200,000 next year. However, although the Slovak government officially refuses to arm Ukraine, Slovak ammunition still finds its way there.",
		"Міністр оборони Словаччини Роберт Калінак планує збільшити виробництво артилерійських снарядів зі 125 000 цього року до 200 000 наступного. Однак, хоча словацький уряд офіційно відмовляється озброювати Україну, словацькі боєприпаси все одно потрапляють туди.",
		"https://unn.ua/en/news/slovakia-arms-ukraine-against-its-will-bloomberg"
	],
	[
		"2024-07-23",
		"Hungary continues to block the next tranche of the European Peace Fund intended for military assistance to Ukraine.",
		"Угорщина продовжує блокувати наступний транш Європейського фонду миру, призначений для військової допомоги Україні.",
		"https://www.msn.com/en-us/news/world/hungary-blocks-eu-fund-for-ukrainian-weapons-again/ar-BB1qrnOq"
	],
	[
		"2024-07-23",
		"Following an EU Foreign Affairs ministerial meeting in Brussels on Monday, foreign policy chief Josep Borrell announced that the first installment of 1.4 billion euros ($1.5 billion) in military aid to Ukraine, funded by the profits from frozen Russian assets, will be disbursed in early August.",
		"Після зустрічі міністрів закордонних справ ЄС у Брюсселі в понеділок, глава зовнішньополітичного відомства Жозеп Боррель оголосив, що перший транш у розмірі 1,4 мільярда євро (1,5 мільярда доларів) військової допомоги Україні, що фінансується за рахунок прибутків від заморожених російських активів, буде виплачений на початку серпня.",
		"https://en.apa.az/europe/eu-to-release-14bln-euros-in-military-aid-to-kiev-from-russian-assets-443310"
	],
	[
		"2024-07-22",
		"Bulgaria is working on a new arms package for Ukraine, said the country’s caretaker Defense Minister Atanas Zapryanov. Proposed military aid for Ukraine, comprising surplus ammunition and equipment from the Bulgarian army, is ready for review and will very soon be submitted for the cabinet’s approval.",
		"Болгарія працює над новим пакетом озброєнь для України, заявив тимчасовий виконувач обов'язків міністра оборони країни Атанас Запрянов. Пропонована військова допомога Україні, що включає в себе надлишки боєприпасів і обладнання болгарської армії, готова до розгляду і найближчим часом буде передана на затвердження кабінету міністрів.",
		"https://www.aa.com.tr/en/russia-ukraine-war/bulgaria-works-on-new-arms-package-for-ukraine/3282581"
	],
	[
		"2024-07-22",
		"A new package of military aid to Ukraine has been annoumced by Latvian Minister of Defence: \"A package of more than 500 drones begins its journey to Ukraine.\"",
		"Міністр оборони Латвії оголосив про новий пакет військової допомоги Україні: «Пакет з більш ніж 500 безпілотників починає свою подорож до України».",
		"https://x.com/AndrisSpruds/status/1815358957080158547"
	],
	[
		"2024-07-20",
		"Slovakia's Prime Minister Robert Fico has made it clear that his country will not be a 'hostage' in the ongoing tensions between Ukraine and Russia. This declaration was made during a phone call with Ukrainian Prime Minister Denys Shmyhal following Kyiv's decision to place Russian group Lukoil on its sanctions list, leading to halted oil deliveries.",
		"Прем'єр-міністр Словаччини Роберт Фіцо дав зрозуміти, що його країна не буде «заручником» у напруженій ситуації між Україною та Росією. Ця заява була зроблена під час телефонної розмови з прем'єр-міністром України Денисом Шмигалем після рішення Києва внести російську групу «Лукойл» до списку санкцій, що призвело до припинення поставок нафти.",
		"https://www.devdiscourse.com/article/headlines/3024449-slovakia-asserts-independence-amid-ukraine-russia-tensions"
	],
	[
		"2024-07-20",
		"Britain, a leading Western country in providing military support to Ukraine, has asserted that it will not assist Ukraine in attacking targets within Russian territory.",
		"Великобританія, провідна західна країна у наданні військової підтримки Україні, заявила, що не допомагатиме Україні атакувати цілі на території Росії.",
		"https://vovworld.vn/en-US/news/britain-says-it-will-not-aid-ukraine-in-attacking-targets-in-russia-1312283.vov"
	],
	[
		"2024-07-19",
		"The UK Defence and Business Secretaries met with President Zelenskyy and industry leaders in London on 18 July to discuss deeper cooperation and the need to boost industrial production for Ukraine. The government confirmed £3bn a year to help Ukraine and a new package of ammunition, anti-armour missiles and artillery guns. The MOD agreed to regenerate the UK’s ability to produce forgings for gun barrels, working in partnership with Sheffield Forgemasters, supporting the repair and overhaul of Ukrainian vehicles; this is the first step towards UK sovereign barrel production which has been developing for 20 years. ",
		"Міністри оборони та бізнесу Великої Британії зустрілися з президентом Зеленським та лідерами промисловості в Лондоні 18 липня, щоб обговорити поглиблення співпраці та необхідність стимулювання промислового виробництва в Україні. Уряд підтвердив виділення 3 млрд фунтів стерлінгів на рік на допомогу Україні та новий пакет боєприпасів, протитанкових ракет та артилерійських гармат. Міністерство оборони погодилося відновити можливості Великої Британії з виробництва поковок для гарматних стволів, працюючи у партнерстві з компанією Sheffield Forgemasters, підтримуючи ремонт та капітальний ремонт української техніки; це перший крок на шляху до власного виробництва стволів у Великій Британії, яке розвивалося протягом 20 років. ",
		"https://www.gov.uk/government/news/uk-government-and-defence-industry-stepping-up-support-for-ukraine"
	],
	[
		"2024-07-19",
		"Ukraine and the United Kingdom sign a loan agreement worth 2 billion pounds. « Under the terms of the framework agreement, the loan will be used for large-scale pro-defense projects in Ukraine, which will reduce the burden on the State budget and allow in the short term to obtain the necessary weapons to protect our state, first of all — in the field of air defense », — said the Minister of Defense of Ukraine Rustem Umerov. ",
		"Україна та Велика Британія підписали кредитну угоду на 2 млрд фунтів стерлінгів. «За умовами рамкової угоди кредит буде використаний на масштабні проєкти з розвитку обороноздатності України, що знизить навантаження на Державний бюджет та дозволить в короткостроковій перспективі отримати необхідне озброєння для захисту нашої держави, перш за все — у сфері протиповітряної оборони», — зазначив міністр оборони України Рустем Умєров. ",
		"https://www.mil.gov.ua/news/2024/07/19/ukraina-ta-velikabritaniya-pidpisali-kreditnu-ugodu-na-2-mlrd-funtiv-sterlingiv/"
	],
	[
		"2024-07-18",
		"Ukraine signed security agreements with the Czech Republic and Slovenia during Volodymyr Zelensky’s visit to the UK.",
		"Україна підписала угоди про безпеку з Чехією та Словенією під час візиту Володимира Зеленського до Великої Британії.",
		"https://mil.in.ua/en/news/ukraine-signs-security-agreements-with-the-czech-republic-and-slovenia/"
	],
	[
		"2024-07-18",
		"France will train 2,100 Ukrainian recruits and arm them with Caesar howitzers, armored vehicles, and other systems.",
		"Франція підготує 2100 українських новобранців та озброїть їх гаубицями «Цезар», бронемашинами та іншими системами.",
		"https://mil.in.ua/en/news/france-to-train-and-arm-ukrainian-brigade-by-the-end-of-the-year/"
	],
	[
		"2024-07-17",
		"Germany plans to halve its military aid to Ukraine next year, despite concerns that U.S. support for Kyiv could potentially diminish. German aid to Ukraine will be cut to 4 billion euros ($4.35 billion) in 2025 from around 8 billion euros in 2024, according to a draft of the 2025 budget seen by Reuters.",
		"Німеччина планує вдвічі скоротити військову допомогу Україні наступного року, незважаючи на побоювання, що підтримка Києва з боку США може потенційно зменшитися. Німецька допомога Україні буде скорочена до 4 мільярдів євро (4,35 мільярда доларів) у 2025 році з близько 8 мільярдів євро у 2024 році, згідно з проектом бюджету на 2025 рік, з яким ознайомилося агентство Reuters.",
		"https://www.reuters.com/world/europe/germany-halve-military-aid-ukraine-despite-possible-trump-white-house-2024-07-17/"
	],
	[
		"2024-07-17",
		"A Russian individual has plead guilty and was sentenced for 3 years in prison in the United States for smuggling dual-purpose micro-led screens to Russian arm manufacturers.",
		"Росіянин визнав себе винним і був засуджений до 3 років ув'язнення в США за контрабанду мікроекранів подвійного призначення для російських виробників озброєнь.",
		"https://www.justice.gov/usao-sdny/pr/russian-international-money-launderer-sentenced-three-years-prison-illicitly-procuring"
	],
	[
		"2024-07-13",
		"Away from Washington, Ukrainian President Volodymyr Zelensky sought to broaden support for U.S. military aid speaking to state governors.",
		"Далеко від Вашингтона президент України Володимир Зеленський намагався розширити підтримку військової допомоги США, виступаючи перед губернаторами штатів.",
		"https://www.latimes.com/world-nation/story/2024-07-13/after-embrace-at-nato-summit-zelensky-takes-his-case-for-us-military-aid-to-governors"
	],
	[
		"2024-07-13",
		"Australia announced its largest ever military aid package for Ukraine, committing $250 million to bolster Ukraune defense.",
		"Австралія оголосила про надання найбільшого в історії пакету військової допомоги Україні, виділивши 250 мільйонів доларів на зміцнення обороноздатності України.",
		"https://ilkha.com/english/world/australia-pledges-record-military-aid-to-ukraine-at-nato-summit-404492"
	],
	[
		"2024-07-13",
		"At this week's summit in Washington, NATO members agreed to provide at least €40 billion a year in military aid to Ukraine to repel Russian aggression. Estonia however, has pledged three times the amount agreed upon to continue supporting Ukraine.",
		"На саміті у Вашингтоні цього тижня члени НАТО домовилися надавати Україні щонайменше 40 мільярдів євро на рік у вигляді військової допомоги для відбиття російської агресії. Естонія, однак, пообіцяла втричі більшу суму, щоб продовжувати підтримувати Україну.",
		"https://news.err.ee/1609396207/estonia-contributes-three-times-more-than-agreed-in-nato-to-support-ukraine"
	],
	[
		"2024-07-13",
		"Argentinian Defence Minister Luis Alfonso Petri said neutrality is no longer a real option in the current situation. Therefore, the Argentine government, which previously seemed not to interfere in the situation in Europe, is changing its stance and announcing its readiness to transfer valuable equipment to Ukraine. The list includes Mi-171E transport helicopters, which were once purchased from the Russians, as well as ammunition for light weapons and 155 mm artillery.",
		"Міністр оборони Аргентини Луїс Альфонсо Петрі заявив, що нейтралітет більше не є реальним варіантом у нинішній ситуації. Тому аргентинський уряд, який раніше, здавалося, не втручався в ситуацію в Європі, змінює свою позицію і заявляє про готовність передати Україні цінну техніку. У списку - транспортні вертольоти Мі-171Е, які свого часу були придбані у росіян, а також боєприпаси для легкого озброєння і 155-мм артилерії.",
		"https://www.msn.com/en-gb/news/world/argentina-shifts-stance-may-send-military-aid-to-ukraine/ar-BB1pS2VP"
	],
	[
		"2024-07-12",
		"NATO is helping Ukraine to fight—but not to win. The Washington summit was heavy on promises but light on plans.",
		"НАТО допомагає Україні боротися, але не перемагати. Вашингтонський саміт був багатий на обіцянки, але бідний на плани.",
		"https://foreignpolicy.com/2024/07/12/nato-summit-ukraine-russia-military-war/"
	],
	[
		"2024-07-12",
		"The Biden Administration has announced the 61st presidential drawdown authority package, which has an estimated value of $225 million. This package includes one Patriot battery, munitions for rocket systems, and artillery and antitank weapons.",
		"Адміністрація Байдена оголосила про 61-й пакет президентських повноважень щодо скорочення озброєнь, який оцінюється у 225 мільйонів доларів. Цей пакет включає одну батарею \"Патріотів\", боєприпаси для ракетних систем, а також артилерійське і протитанкове озброєння.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3837709/us-announces-latest-security-package-for-ukraine/"
	],
	[
		"2024-07-12",
		"Canada has announced the allocation of CAD 389 million (more than US$280 million) for training Ukrainian pilots on F-16 fighters.",
		"Канада оголосила про виділення 389 мільйонів канадських доларів (понад 280 мільйонів доларів США) на навчання українських пілотів на винищувачах F-16.",
		"https://www.pravda.com.ua/eng/news/2024/07/12/7465305/"
	],
	[
		"2024-07-11",
		"Portugal will allocate €220 million in military aid to Ukraine in 2025.",
		"Португалія виділить 220 мільйонів євро військової допомоги Україні у 2025 році.",
		"https://mil.in.ua/en/news/portugal-to-allocate-e220-million-in-military-aid-to-ukraine-in-2025/"
	],
	[
		"2024-07-11",
		"Lithuania has handed Ukraine ammunition, antidrons and folding cribes",
		"Литва передала Україні боєприпаси, протиракети та розкладні ліжечка",
		"https://kam.lt/lietuva-ukrainai-perdave-soviniu-antidronu-ir-sulankstomu-lovyciu/"
	],
	[
		"2024-07-08",
		"UK Defense Secretary John Healey announced a new military aid package for Ukraine. The package will include “more artillery guns, a quarter of a million ammunition rounds and nearly 100 precision Brimstone missiles,” according to a government statement.",
		"Міністр оборони Великої Британії Джон Хілі оголосив про новий пакет військової допомоги Україні. Пакет включатиме \"більше артилерійських гармат, чверть мільйона боєприпасів і майже 100 високоточних ракет \"Брімстоун\"\", - йдеться у заяві уряду.",
		"https://www.aa.com.tr/en/europe/uk-announces-new-military-aid-package-for-ukraine/3268904"
	],
	[
		"2024-07-07",
		"London's support for Kiev during the conflict with Moscow will remain at the same level under his leadership, the new Prime Minister of Britain Keir Starmer has told Vladimir Zelensky.",
		"Підтримка Лондоном Києва під час конфлікту з Москвою залишиться на тому ж рівні і під його керівництвом, заявив Володимиру Зеленському новий прем'єр-міністр Великої Британії Кейр Стармер.",
		"https://www.bignewsnetwork.com/news/274445701/new-british-pm-assures-ukraine-of-unshakable-support"
	],
	[
		"2024-07-06",
		"Mistral short-range air defence systems and missiles provided by Estonia have been delivered to Ukraine.",
		"В Україну доставлені зенітно-ракетні комплекси малої дальності \"Містраль\" та ракети, надані Естонією.",
		"https://x.com/MoD_Estonia/status/1809517536356024405"
	],
	[
		"2024-07-06",
		"Hungarian Prime Minister Viktor Orban continues to posture himself as a potential mediator to end the war in Ukraine despite Russian President Vladimir Putin's rejection of mediation or serious negotiations. Orban is likely aiming to shift Western focus towards possible peace negotiations as part of his overarching effort to undermine European support for Ukraine.",
		"Прем'єр-міністр Угорщини Віктор Орбан продовжує позиціонувати себе як потенційного посередника для припинення війни в Україні, незважаючи на те, що президент Росії Володимир Путін відкидає посередництво або серйозні переговори. Орбан, ймовірно, прагне переключити увагу Заходу на можливі мирні переговори як частину своїх загальних зусиль, спрямованих на підрив європейської підтримки України",
		"https://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-july-6-2024"
	],
	[
		"2024-07-06",
		"New defence secretary John Healey announced a fresh British military aid package for Ukraine. Britain will supply a quarter of a million large, 50 calibre rounds of ammunition, 10 of its AS-90 artillery guns, which have a theoretical range of up to 25km, and 90 Brimstone ground-attack, anti-tank missiles from its own stocks.",
		"Новий міністр оборони Джон Хілі оголосив про новий пакет британської військової допомоги Україні. Британія надасть чверть мільйона великих боєприпасів 50-го калібру, 10 своїх артилерійських гармат AS-90, які мають теоретичну дальність стрільби до 25 км, а також 90 протитанкових ракет Brimstone зі своїх запасів.",
		"https://www.theguardian.com/politics/live/2024/jul/07/keir-starmer-labour-uk-general-election-scotland-wales-northern-ireland-visit-latest-news?page=with:block-668abb3c8f08a83a9aece4f1"
	],
	[
		"2024-07-05",
		"Marine Le Pen vowed a prime minister from her party would prevent Kyiv using French-supplied long-range weapons to strike inside Russia and would stymie French President Emmanuel Macron’s suggestion he might put French boots on Ukrainian soil.",
		"Марін Ле Пен, лідер французької ультраправої партії \"Національне об'єднання\" (RN), пообіцяла, що прем'єр-міністр від її партії не дозволить Києву використовувати французьку зброю дальньої дії для нанесення ударів по Росії і не допустить припущення президента Франції Еммануеля Макрона про те, що він може поставити французькі чоботи на українську землю.",
		"https://edition.cnn.com/2024/07/05/europe/france-le-pen-ukraine-mbappe-intl-cmd/index.html"
	],
	[
		"2024-07-05",
		"The Ministry of Defense of Latvia informs that the supply of the next drone package to the Ukrainian Armed Forces will be gradually carried out in July as part of the drone coalition. More than 2,500 different types and performance combat drones worth € 4 million will be delivered to Ukraine. The first shipment of the apious package – 300 drones will be delivered in the coming days.",
		"Міністерство оборони Латвії повідомляє, що поставка чергового пакету безпілотників Збройним силам України буде поступово здійснюватися в липні в рамках безпілотної коаліції. В Україну буде поставлено понад 2500 бойових безпілотників різних типів і характеристик на загальну суму 4 мільйони євро. Перша партія з цього пакету - 300 безпілотників - буде доставлена найближчими днями.",
		"https://www.mod.gov.lv/lv/zinas/aizsardzibas-ministrija-ukrainai-piegadas-nakamo-dronu-pakotni-vairak-neka-2500-dronus-4"
	],
	[
		"2024-06-30",
		"Ukrainian President Volodymyr Zelensky has renewed his appeal for more long-range weapons and air defences.",
		"Президент України Володимир Зеленський поновив свій заклик про надання більшої кількості озброєнь дальньої дії та засобів протиповітряної оборони",
		"https://www.bbc.com/news/articles/c7281yly9n4o"
	]
]