[
	[
		"2025-01-24",
		"Canada's $440 million Ukraine aid package was approved by Parliament.",
		"Парламент схвалив пакет допомоги Україні на суму 440 мільйонів доларів",
		"https://www.thecanadianpressnews.ca/fact_checking/canadas-440-million-ukraine-aid-package-was-approved-by-parliament-despite-claims-to-the-contrary/article_c1a96118-96a5-5f7f-884e-0f34b5c11d9a.html"
	],
	[
		"2025-01-23",
		"Ukraine and Sweden agreed to sign a bilateral agreement on cooperation between companies in the defense industry.",
		"Україна та Швеція домовилися підписати двосторонню угоду щодо співпраці компаній в сфері ОПК.\n",
		"https://mod.gov.ua/news/ukrayina-ta-shvecziya-domovilisya-pidpisati-dvostoronnyu-ugodu-shhodo-spivpraczi-kompanij-v-sferi-opk"
	],
	[
		"2025-01-20",
		"Lithuania announced that the country is sending a new military aid package to Ukraine complete with drones and other weapons.",
		"Литва оголосила, що надсилає Україні новий пакет військової допомоги, який включає безпілотники та інше озброєння.",
		"https://www.msn.com/en-us/politics/government/nato-ally-sends-new-aid-package-to-ukraine/ar-AA1xAaLs"
	],
	[
		"2025-01-17",
		"Ukraine will receive 15 Gravehawk ground-based air defense system from the UK.",
		"Україна отримає від Великої Британії 15 наземних комплексів протиповітряної оборони Gravehawk.",
		"https://thedefensepost.com/2025/01/17/uk-air-defense-ukraine/"
	],
	[
		"2025-01-17",
		"The UK government has announced an unprecedented £4.5 billion military aid package for Ukraine. This includes a £3 billion commitment for lethal aid in 2025. Additionally, £1.5 billion from a £2.26 billion G7 loan, to be repaid using profits from immobilised Russian sovereign assets, will fund procurement projects critical to Ukraine’s defence efforts.",
		"Уряд Великої Британії оголосив про безпрецедентний пакет військової допомоги Україні у розмірі 4,5 млрд фунтів стерлінгів. Це включає 3 мільярди фунтів стерлінгів на летальну допомогу у 2025 році. Крім того, 1,5 мільярда фунтів стерлінгів з кредиту G7 у розмірі 2,26 мільярда фунтів стерлінгів, який буде погашено за рахунок прибутків від іммобілізованих російських суверенних активів, підуть на фінансування проектів закупівель, критично важливих для оборонних зусиль України.",
		"https://ukdefencejournal.org.uk/uk-unveils-massive-military-aid-package-for-ukraine-in-2025/"
	],
	[
		"2025-01-12",
		"Annalena Baerbock, German Foreign Minister and co-leader of the Greens, insists that Berlin should provide Ukraine with more military aid than currently planned in the budget.",
		"Анналена Бербок, міністр закордонних справ Німеччини та співголова партії Зелених, наполягає на тому, що Берлін повинен надати Україні більше військової допомоги, ніж зараз заплановано в бюджеті.",
		"https://www.pravda.com.ua/eng/news/2025/01/12/7493144/"
	],
	[
		"2025-01-12",
		"Germany will deploy two Patriot air defense systems in Poland to protect the logistics center of international military assistance to Ukraine.",
		"Німеччина розмістить у Польщі два комплекси ППО Patriot для захисту логістичного центру міжнародної військової допомоги Україні.",
		"https://mil.in.ua/en/news/germany-to-deploy-patriot-air-defense-systems-in-poland-to-protect-aid-center-for-ukraine/"
	],
	[
		"2025-01-12",
		"Ukraine will receive 30,000 new surveillance and attack drones as part of a multinational initiative jointly led by Latvia and the United Kingdom.",
		"Україна отримає 30 000 нових розвідувальних і ударних безпілотників в рамках багатонаціональної ініціативи, яку спільно очолюють Латвія і Велика Британія.",
		"https://www.aviacionline.com/international-support-grows-ukraine-to-receive-advanced-drones-and-defense-funds"
	],
	[
		"2025-01-11",
		"US President Joe Biden’s administration has not managed to use nearly US$4 billion of the aid package for Ukraine approved by Congress in April.",
		"Адміністрація президента США Джо Байдена не змогла використати майже 4 мільярди доларів США з пакету допомоги Україні, схваленого Конгресом у квітні.",
		"https://www.pravda.com.ua/eng/news/2025/01/11/7493005/"
	],
	[
		"2025-01-09",
		"Norway has allocated 2 billion euros  ($2.1 billion) for military aid to Ukraine in 2025.",
		"Норвегія виділила 2 мільярди євро ($2,1 мільярда) на військову допомогу Україні у 2025 році.",
		"https://kyivindependent.com/norway-allocates-over-2-billion-in-military-aid-for-ukraine-in-2025-umerov-says/"
	],
	[
		"2025-01-09",
		"The Department of Defense (DoD) announced additional Presidential Drawdown Authority (PDA) package, which has an estimated value of $500 million, which includes: missiles for air defense; air-to-ground munitions; and equipment to support Ukraine's use of F-16s.",
		"Міністерство оборони (МО) оголосило про додатковий пакет президентських повноважень зі скорочення озброєнь (PDA), який оцінюється в 500 млн доларів і включає: ракети для протиповітряної оборони; боєприпаси класу «повітря-земля»; а також обладнання для підтримки використання Україною F-16.",
		"https://www.defense.gov/News/Releases/Release/Article/4025039/biden-administration-announces-additional-security-assistance-for-ukraine/"
	]
]