[
	[
		"2025-03-08",
		"Germany is nearing an agreement to unlock €3 billion ($3.3 billion) of military aid for Ukraine, alongside a broader set of measures to revamp the country’s defense and infrastructure. The authorization is likely to come in the weeks ahead as Germany seeks to change constitutional borrowing rules to boost its military spending. The additional funding would almost double aid this year to €7 billion.",
		"Німеччина наближається до угоди про розблокування військової допомоги Україні у розмірі 3 млрд євро (3,3 млрд доларів), а також ширшого набору заходів з модернізації оборони та інфраструктури країни. Дозвіл, ймовірно, буде надано найближчими тижнями, оскільки Німеччина прагне змінити конституційні правила запозичень, щоб збільшити свої військові витрати. Додаткове фінансування майже подвоїть допомогу цього року до 7 мільярдів євро.",
		"https://www.bloomberg.com/news/articles/2025-03-08/germany-closes-in-on-bolstering-ukraine-support-by-3-billion"
	],
	[
		"2025-03-07",
		"Republican lawmakers are starting to urge President Trump to reverse his decisions to pause U.S. military and intelligence assistance to Ukraine, warning that a prolonged stoppage of U.S. help for the war effort would have a seriously detrimental effect.",
		"Республіканські законодавці починають закликати президента Трампа скасувати свої рішення про призупинення американської військової та розвідувальної допомоги Україні, попереджаючи, що тривале припинення американської допомоги для військових зусиль матиме серйозний негативний ефект.",
		"https://thehill.com/homenews/senate/5181289-trump-ukraine-military-aid-intelligence-pause-republicans/"
	],
	[
		"2025-03-07",
		"The Trump administration has suspended U.S. satellite imagery support for Ukraine, the National Geospatial Intelligence Agency confirmed.",
		"Адміністрація Трампа призупинила підтримку супутникових знімків США для України, підтвердило Національне агентство геопросторової розвідки.",
		"https://spacenews.com/us-halts-satellite-imagery-support-to-ukraine-in-major-policy-shift/"
	],
	[
		"2025-03-07",
		"Several EU members have pledged to provide up to 15 billion euros ($16.3 billion) in additional aid for Ukraine.",
		"Кілька країн-членів ЄС пообіцяли надати Україні до 15 мільярдів євро (16,3 мільярда доларів) додаткової допомоги.",
		"https://kyivindependent.com/eu-members-pledge-16-billion-in-additional-support-for-ukraine-costa-says/"
	],
	[
		"2025-03-07",
		"The first £752 million ($970 million) tranche of loan sent to Ukraine for military equipment.",
		"Перший транш кредиту у розмірі 752 млн фунтів стерлінгів ($970 млн) спрямований Україні на військове обладнання.",
		"https://www.gov.uk/government/news/first-752-million-tranche-of-loan-sent-to-ukraine-for-military-equipment"
	],
	[
		"2025-03-06",
		"Norway will more than double its financial pledge to Ukraine this year while also hiking its own defence spending. The government and opposition leaders agreed on Thursday to raise this year's Ukraine funding to 85 billion Norwegian crowns ($7.83 billion).",
		"Цього року Норвегія більш ніж удвічі збільшить свої фінансові зобов'язання перед Україною, а також збільшить власні витрати на оборону. Лідери уряду та опозиції домовилися в четвер збільшити цьогорічне фінансування України до 85 мільярдів норвезьких крон (7,83 мільярда доларів США).",
		"https://www.reuters.com/world/europe/norway-should-significantly-raise-its-aid-ukraine-pm-says-2025-03-06/"
	],
	[
		"2025-03-06",
		"France's defence minister said intelligence it provided to Ukraine was unaffected by the U.S. suspension of intelligence sharing with Ukraine.",
		"Міністр оборони Франції заявив, що розвідувальні дані, які вона надавала Україні, не постраждали від призупинення обміну розвідувальною інформацією з Україною з боку США.",
		"https://www.reuters.com/world/europe/france-offering-intelligence-ukraine-amid-washington-suspension-2025-03-06/"
	],
	[
		"2025-03-06",
		"Britain will continue to supply intelligence to Ukraine.",
		"Британія і надалі постачатиме розвіддані Україні.",
		"https://www.theguardian.com/world/2025/mar/06/uk-to-continue-to-supply-intelligence-to-ukraine-after-us-cutoff"
	],
	[
		"2025-03-06",
		"Advanced attack drones for Ukraine are paid by the UK government in a $38 million contract with the UK manufacturer Anduril.",
		"Сучасні ударні безпілотники для України оплачуються урядом Великої Британії в рамках контракту на суму 38 мільйонів доларів з британським виробником Anduril.",
		"https://www.gov.uk/government/news/advanced-attack-drones-for-ukraine-in-new-deal-struck-by-uk-government-and-anduril-uk"
	],
	[
		"2025-03-05",
		"The ministry of defense of France has developed a plan of phasing-out old equipment. Under this plan France will decommission the equipment which is out-of-date or near to its service life and will transfer it immediately to Ukraine.",
		"Міністерство оборони Франції розробило план поетапної відмови від старого обладнання. Згідно з цим планом, Франція виводитиме з експлуатації застарілу або таку, що наближається до завершення терміну експлуатації, техніку і негайно передаватиме її Україні.",
		"https://armyrecognition.com/news/army-news/2025/breaking-news-france-to-continue-military-aid-to-ukraine-with-phase-out-of-army-combat-vehicles-and-missiles"
	],
	[
		"2025-03-02",
		"Lithuania continues to invest in Ukraine's defense industry and plans to purchase weapons for the Ukrainian Armed Forces for at least 20 million euros.",
		"Литва продовжує інвестувати в оборонну промисловість України і планує закупити озброєння для Збройних сил України щонайменше на 20 мільйонів євро.",
		"https://www.msn.com/en-gb/news/world/lithuania-pledges-20-million-euros-for-ukraine-s-military-aid/ar-AA1A4En5?apiversion=v2&noservercache=1&domshim=1&renderwebcomponents=1&wcseo=1&batchservertelemetry=1&noservertelemetry=1"
	],
	[
		"2025-03-02",
		"The Government of Ireland doubled its military aid package to Ukraine to €100million.",
		"Уряд Ірландії подвоїв пакет військової допомоги Україні до 100 мільйонів євро.",
		"https://extra.ie/2025/03/02/news/ireland-doubles-ukraine-aid"
	],
	[
		"2025-03-02",
		"Poland has pledged its 46th military aid package for Ukraine, amounting to 200 million euros ($210 million).",
		"Польща пообіцяла надати Україні 46-й пакет військової допомоги на суму 200 мільйонів євро (210 мільйонів доларів).",
		"https://evrimagaci.org/tpg/poland-pledges-210-million-military-aid-for-ukraine-245600"
	],
	[
		"2025-03-01",
		"Slovakia on Saturday announced that it will stop military and financial aid to Ukraine.",
		"Словаччина в суботу оголосила, що припиняє військову та фінансову допомогу Україні.",
		"https://www.aa.com.tr/en/europe/slovakia-says-it-will-stop-financial-military-aid-to-ukraine/3497326"
	],
	[
		"2025-03-01",
		"Norway is considering tapping its sovereign wealth fund to dramatically increase its support for Ukraine amid signs that US military backing is waning.",
		"Норвегія розглядає можливість використання свого суверенного фонду добробуту для різкого збільшення підтримки України на тлі ознак зменшення військової підтримки з боку США.",
		"https://www.euractiv.com/section/politics/news/norway-rethinks-e1-7-trillion-sovereign-fund-to-boost-support-for-ukraine/"
	],
	[
		"2025-03-01",
		"French Minister of Defense Sébastien Lecornu announced the decision of France to lift all restrictions on the supply of military weapons and equipment to Ukraine.",
		"Міністр оборони Франції Себастьєн Лекорну оголосив про рішення Франції зняти всі обмеження на постачання військової зброї та обладнання в Україну.",
		"https://evrimagaci.org/tpg/france-lifts-military-aid-restrictions-to-ukraine-242468"
	],
	[
		"2025-02-24",
		"Canada has announced a new military aid package for Ukraine, which includes 25 Light Armored Vehicles (LAV III) and four F-16 flight simulators.",
		"Канада оголосила про новий пакет військової допомоги Україні, який включає 25 легких броньованих машин (LAV III) і чотири авіаційні тренажери F-16.",
		"https://defence-blog.com/canada-sends-f-16-simulators-25-lavs-to-ukraine/"
	],
	[
		"2025-02-24",
		"Spain will provide Ukraine with a new military aid package worth 1 billion euros ($1.05 billion) this year",
		"Цього року Іспанія надасть Україні новий пакет військової допомоги на суму 1 мільярд євро (1,05 мільярда доларів)",
		"https://www.reuters.com/world/europe/spanish-pm-announces-new-1-billion-euro-aid-package-ukraine-2025-02-24/"
	],
	[
		"2025-02-23",
		"Estonia is sending 10,000 artillery shells and 750,000 food packages for Ukrainian soldiers.",
		"Естонія відправляє 10 000 артилерійських снарядів та 750 000 продуктових наборів для українських солдатів",
		"https://global.espreso.tv/world-about-ukraine-estonia-announces-new-military-aid-package-for-ukraine-whats-included"
	],
	[
		"2025-02-22",
		"France and Italy are slowing down the adoption of the EU's €20 billion military aid package for Ukraine due to budget constraints. The package includes 1.5 million rounds of ammunition and air defense support, but the time for approval is limited.",
		"Франція та Італія сповільнюють ухвалення пакету військової допомоги ЄС для України на суму 20 мільярдів євро через бюджетні обмеження. Пакет включає 1,5 мільйона боєприпасів і підтримку протиповітряної оборони, але час на його ухвалення обмежений.",
		"https://unn.ua/en/news/france-italy-block-euro20-billion-eu-military-aid-package-for-ukraine-spiegel"
	],
	[
		"2025-02-22",
		"Italian defense analyst has reported that multiple B1 Centauro wheeled tank destroyers are being sent to Ukraine. While the exact number remains undisclosed, this development suggests a potential expansion of Western military aid to Kyiv.",
		"Італійський оборонний аналітик повідомив, що в Україну відправляють кілька колісних танкових есмінців B1 Centauro. Хоча точна кількість залишається нерозкритою, ця подія свідчить про потенційне розширення західної військової допомоги Києву.",
		"https://defence-blog.com/italy-reportedly-sending-b1-centauros-to-ukraine/"
	],
	[
		"2025-02-16",
		"Trump administration officially proposes rare earth mineral deal with Ukraine in exchange for military aid.",
		"Адміністрація Трампа офіційно запропонувала Україні угоду про постачання рідкоземельних мінералів в обмін на військову допомогу.",
		"https://www.dimsumdaily.hk/trump-administration-officially-proposes-rare-earth-mineral-deal-with-ukraine-in-exchange-for-military-aid/"
	],
	[
		"2025-02-15",
		"Norway is joining the international drone coalition for Ukraine.",
		"Норвегія приєднується до міжнародної коаліції безпілотників для України.",
		"https://x.com/Forsvarsdep/status/1890693771500589219"
	],
	[
		"2025-02-14",
		"The United Kingdom has begun supplying Ukraine with the Gravehawk, a newly developed air defense system designed to integrate Soviet-era missiles into a modern, ground-based platform.",
		"Велика Британія почала постачати Україні «Грейвхок» - нову систему протиповітряної оборони, розроблену для інтеграції ракет радянських часів у сучасну наземну платформу.",
		"https://www.newsweek.com/gravehawk-shipping-container-air-defense-uk-ukraine-2031396"
	],
	[
		"2025-02-13",
		"The British Ministry of Defense announced a new £150 million military aid package for Ukraine which includes drones, T-72 main battle tanks (MBTs), and air defense systems.",
		"Міністерство оборони Великої Британії оголосило про новий пакет військової допомоги Україні на суму 150 мільйонів фунтів стерлінгів, який включає безпілотники, основні бойові танки (ОБТ) Т-72 та системи протиповітряної оборони.",
		"https://www.armyrecognition.com/news/army-news/2025/flash-news-uk-announces-new-military-aid-to-ukraine-including-t-72-tanks"
	],
	[
		"2025-02-13",
		"The Dutch Ministry of Defense is sending YPR armored infantry vehicles to Ukraine. The package will consist of 25 vehicles in a medical transport configuration.",
		"Міністерство оборони Нідерландів відправляє в Україну броньовані піхотні машини YPR. Пакет складатиметься з 25 машин у конфігурації медичного транспорту.",
		"https://thedefensepost.com/2025/02/13/ukraine-ypr-netherlands/"
	],
	[
		"2025-02-13",
		"The Norwegian government has decided to spend another NOK 1.2 billion ($108 mln.) on air defense measures for Ukraine.",
		"Уряд Норвегії вирішив витратити ще 1,2 млрд норвезьких крон ($108 млн) на заходи протиповітряної оборони для України.",
		"https://interfax.com.ua/news/general/1047599.html"
	],
	[
		"2025-02-13",
		"The U.K. has now given Ukraine 500,000 rounds of artillery ammunition, valued at more than £1 billion (€1.2 billion), the British Ministry of Defence announced.",
		"Велика Британія передала Україні 500 000 артилерійських боєприпасів на суму понад 1 мільярд фунтів стерлінгів (1,2 мільярда євро), повідомило Міністерство оборони Великої Британії",
		"https://tvpworld.com/85032806/uk-artillery-ammunition-deliveries-to-ukraine-reach-500000-rounds"
	],
	[
		"2025-02-13",
		"Germany has announced the delivery of 6,000 modern AI-powered HX-2 kamikaze drones to Ukraine. ",
		"Німеччина оголосила про постачання Україні 6 000 сучасних дронів-камікадзе HX-2 на базі штучного інтелекту. ",
		"https://unn.ua/en/news/kamikaze-drones-with-ai-germany-announces-new-military-aid-to-ukraine"
	]
]