[
	[
		"2025-10-10",
		"Hundreds of missiles delivered to Ukraine months ahead of schedule.",
		"Сотні ракет доставлено в Україну на кілька місяців раніше запланованого терміну.",
		"https://www.gov.uk/government/news/hundreds-of-missiles-delivered-to-ukraine-months-ahead-of-schedule-as-uk-leads-kyiv-trade-delegation"
	],
	[
		"2025-10-10",
		"US Senate backs $925 bn defense package with $500 mn Ukraine aid push.",
		"Сенат США підтримав оборонний пакет на суму 925 млрд доларів із виділенням 500 млн доларів на допомогу Україні.",
		"https://euromaidanpress.com/2025/10/10/us-senate-backs-925-bn-defense-package-with-500-mn-ukraine-aid-push/"
	],
	[
		"2025-10-10",
		"Poland has become the largest supplier of tanks to Ukraine, providing more armored vehicles than any other nation since the start of Russia’s full-scale invasion.",
		"Польща стала найбільшим постачальником танків до України, надавши більше броньованих машин, ніж будь-яка інша країна з початку повномасштабного вторгнення Росії.",
		"https://defence-blog.com/poland-becomes-ukraines-top-tank-donor/"
	],
	[
		"2025-10-08",
		"Germany has quietly ordered more than 1,000 Mercedes-Benz Zetros military trucks for Ukraine to strengthen the country’s logistics and transport network.",
		"Німеччина тихо замовила понад 1000 військових вантажівок Mercedes-Benz Zetros для України, щоб посилити логістичну та транспортну мережу країни.",
		"https://thedefensepost.com/2025/10/08/germany-military-trucks-ukraine/"
	],
	[
		"2025-10-03",
		"Greece is under increasing pressure from NATO and EU allies to provide substantial military aid to Ukraine, particularly through the sale of some of its Mirage 2000-5 fighter jets.",
		"Греція відчуває все більший тиск з боку НАТО та союзників по ЄС з метою надання істотної військової допомоги Україні, зокрема шляхом продажу частини своїх винищувачів Mirage 2000-5.",
		"https://united24media.com/latest-news/nato-and-us-urge-greece-to-sell-mirage-2000-jets-to-ukraine-for-military-aid-12177"
	],
	[
		"2025-10-02",
		"Canada will not transfer to Ukraine weapons that are prohibited under its local laws and were collected as part of the national buyback program. The reason is that most of these weapons are unsuitable for combat use.",
		"Канада не передаватиме Україні зброю, яка заборонена її місцевим законодавством і була зібрана в рамках національної програми викупу. Причина полягає в тому, що більшість цієї зброї непридатна для бойового використання.",
		"https://newsukraine.rbc.ua/news/canada-will-not-supply-firearms-to-ukraine-1759413487.html"
	],
	[
		"2025-10-02",
		"A Ukrainian delegation held technical talks in the United States with US military teams this week to advance a planned agreement to buy and co-produce Ukrainian-made drones.",
		"Цього тижня українська делегація провела технічні переговори у США з американськими військовими, щоб просунути заплановану угоду про купівлю та спільне виробництво безпілотників українського виробництва.",
		"https://united24media.com/latest-news/ukraines-drone-tech-heads-to-the-pentagon-historic-five-year-defense-export-deal-nears-12146"
	],
	[
		"2025-09-29",
		"Germany is preparing to transfer two more modern Patriot air defense systems to Ukraine. Their delivery is scheduled to take place by the end of 2025.",
		"Німеччина готується передати Україні ще дві сучасні системи протиповітряної оборони Patriot. Їхня поставка запланована на кінець 2025 року.",
		"https://newsukraine.rbc.ua/news/germany-to-deliver-2-more-patriot-air-defense-1759148616.html"
	],
	[
		"2025-09-27",
		"Zelensky confirms Israel sent Patriot missile battery to Ukraine, says more coming in fall.",
		"Зеленський підтверджує, що Ізраїль надіслав Україні батарею ракет Patriot, і каже, що восени надійдуть ще",
		"https://www.ynetnews.com/article/syontwbnel"
	],
	[
		"2025-09-27",
		"​U.S. orders M110 SASS sniper rifles for Ukraine. An estimated completion date for the contract is January 30, 2027.",
		"США замовляють снайперські гвинтівки M110 SASS для України. Орієнтовна дата виконання контракту — 30 січня 2027 року.",
		"https://en.defence-ua.com/weapon_and_tech/us_orders_m110_sass_sniper_rifles_for_ukraine_those_included_in_aid_package_back_in_2024-15954.html"
	],
	[
		"2025-09-26",
		"Denmark is providing Ukraine with a new military aid package valued at DKK1.6 billion ($468 million).",
		"Данія надає Україні новий пакет військової допомоги на суму 1,6 млрд датських крон (468 млн доларів).",
		"https://english.nv.ua/nation/468-million-in-new-danish-military-aid-to-ukraine-50548329.html"
	],
	[
		"2025-09-25",
		"Germany is planning to include military aid to Ukraine in next year’s budget and advocates for Europe increasing its support for Ukraine.",
		"Німеччина планує включити військову допомогу Україні до бюджету наступного року і виступає за збільшення підтримки України з боку Європи.",
		"https://ubn.news/germany-is-planning-to-include-military-aid-to-ukraine-in-next-years-budget-and-advocates-for-europe-increasing-its-support-for-kyiv/"
	],
	[
		"2025-09-24",
		"Canada is allocating UAH 92 million (USD 2,2 million) to Ukraine to strengthen cybersecurity as part of a new aid package under the Tallinn Mechanism.",
		"Канада виділяє Україні 92 мільйони гривень (2,2 мільйона доларів США) на посилення кібербезпеки в рамках нового пакету допомоги за Талліннським механізмом.",
		"https://newsukraine.rbc.ua/news/canada-sends-another-aid-package-to-ukraine-1758713361.html"
	],
	[
		"2025-09-23",
		"The US Air Force has signed a nearly $26 million contract with Lockheed Martin to support the transfer of F-16 fighter jets to Ukraine.",
		"Військово-повітряні сили США підписали контракт з компанією Lockheed Martin на суму майже 26 мільйонів доларів для підтримки передачі винищувачів F-16 Україні.",
		"https://united24media.com/latest-news/us-secures-26-million-deal-with-lockheed-martin-to-support-f-16-jets-for-ukraine-11883"
	]
]