[
	[
		"2024-12-28",
		"Greece will provide Ukraine with 24 RIM-7 Sea Sparrow anti-aircraft missiles. This transfer is part of Greece’s broader military aid to Ukraine, which includes artillery shells, weaponry and ammunition. ",
		"Греція надасть Україні 24 зенітні ракети RIM-7 Sea Sparrow.",
		"https://www.ekathimerini.com/politics/foreign-policy/1257256/greece-to-send-sea-sparrows-to-ukraine/"
	],
	[
		"2024-12-28",
		"The Netherlands is planning to provide an additional 6 billion euros (some $6.24 billion) in military aid to Ukraine, Dutch Ambassador to Ukraine Alle Dorhout has said.",
		"Нідерланди планують надати Україні додатково 6 мільярдів євро (близько 6,24 мільярдів доларів) військової допомоги, заявив посол Нідерландів в Україні Алле Дорхаут.",
		"https://www.thestatesman.com/world/netherlands-plans-to-provide-6-billion-euros-in-additional-military-aid-to-ukraine-1503380454.html"
	],
	[
		"2024-12-27",
		"Germany allocated a new military aid package to Ukraine, including IRIS-T air defense systems, Patriot systems, Leopard 1A5 tanks, and Gepard self-propelled anti-aircraft guns.",
		"Німеччина виділила Україні новий пакет військової допомоги, що включає системи протиповітряної оборони IRIS-T, системи Patriot, танки Leopard 1A5 та самохідні зенітні установки Gepard.",
		"https://english.nv.ua/nation/ukraine-bolsters-forces-with-58-leopard-tanks-from-germany-50477360.html"
	],
	[
		"2024-12-24",
		"The Italian government has approved the continuation of military aid to Ukraine. Italian government adopted the relevant law on December 23.",
		"Уряд Італії схвалив продовження військової допомоги Україні. Відповідний закон італійський уряд ухвалив 23 грудня.",
		"https://ukranews.com/en/news/1054719-italian-government-approves-continuation-of-military-aid-to-ukraine"
	],
	[
		"2024-12-22",
		"German Rheinmetall will supply Ukraine with 155mm artillery shells. The deliveries are planned in the first half of 2025.",
		"Німецька компанія Rheinmetall поставить Україні 155-мм артилерійські снаряди. Поставки заплановані на першу половину 2025 року.",
		"https://www.linkedin.com/posts/dpa-mod-ukraine_the-defense-procurement-agency-of-ukraines-activity-7275792040590729217-SYVX"
	],
	[
		"2024-12-19",
		"The Danish Government informed the Foreign Policy Committee on the 23rd donation package to Ukraine which includes 2.1 billion DKK to strengthen Ukraine’s air defence and the capacity for fighter aircrafts. Furthermore, funding will be spent on additional infantry fighting vehicles.",
		"Уряд Данії поінформував Комітет з питань зовнішньої політики про 23-й пакет допомоги Україні, який включає 2,1 мільярда данських крон на посилення протиповітряної оборони України та розвиток потенціалу винищувальної авіації. Крім того, кошти будуть витрачені на додаткові бойові машини піхоти.",
		"https://www.fmn.dk/en/news/2024/new-donation-package-to-strengthen-ukraines-air-defence/"
	],
	[
		"2024-12-19",
		"The Danish government has prepared the 23rd package of military aid to Ukraine worth DKK 2.1 billion (€281.5 million).",
		"Уряд Данії підготував 23-й пакет військової допомоги Україні на суму 2,1 млрд данських крон (281,5 млн євро).",
		"https://mil.in.ua/en/news/denmark-and-sweden-prepare-cv90-ifvs-for-ukraine/"
	],
	[
		"2024-12-13",
		"The Lithuanian Ministry of National Defense confirmed the delivery of specialized trailers designed for transporting tracked armored vehicles and a new batch of ammunition for Ukrainian forces.",
		"Міністерство національної оборони Литви підтвердило поставку спеціалізованих причепів, призначених для транспортування гусеничної бронетехніки та нової партії боєприпасів для українських військових.",
		"https://armyrecognition.com/focus-analysis-conflicts/army/conflicts-in-the-world/ukraine-russia-conflict/lithuania-strengthens-its-military-support-to-ukraine-with-new-trailers-and-ammunition"
	],
	[
		"2024-12-13",
		"The Czech Republic is raising funds for a Sikorsky UH-60 Black Hawk combat helicopter for the Ukrainian intelligence. Two-thirds of the required $3 million has already been raised.",
		"Чеська Республіка збирає кошти на бойовий вертоліт Сікорського UH-60 Black Hawk для української розвідки. Вже зібрано дві третини з необхідних 3 мільйонів доларів.",
		"https://newsukraine.rbc.ua/news/buy-black-hawk-for-ukraine-czech-republic-1734091429.html"
	],
	[
		"2024-12-13",
		"The Norvegian government has set aside funds to support the training of Ukrainian pilots and ground crews in 2025. At the end of the year, F-16 training will be held in Denmark. From the new year, the Armed Forces will instead contribute instructors to the training of Ukrainian F-16 pilots in Portugal.",
		"Уряд Норвегії виділив кошти на підтримку підготовки українських пілотів та наземних екіпажів у 2025 році. Наприкінці року навчання пілотів F-16 відбудуться в Данії. З нового року ЗСУ натомість надаватимуть інструкторів для підготовки українських пілотів F-16 у Португалії.",
		"https://www.regjeringen.no/no/aktuelt/norge-vil-trene-ukrainsk-f-16-personell-i-portugal/id3079115/"
	],
	[
		"2024-12-12",
		"The Department of Defense (DoD) announced a new Presidential Drawdown Authority (PDA) package. This announcement is the seventy-second tranche of equipment to be provided from DoD inventories. This  PDA package, which has an estimated value of $500 million, includes air defense capabilities; munitions for rocket systems and artillery; and anti-tank weapons.",
		"Міністерство оборони (МО) США оголосило про новий пакет допомоги в рамках президентської ініціативи щодо скорочення озброєнь (Presidential Drawdown Authority, PDA). Це оголошення є сімдесят другим траншем обладнання, яке буде надано зі складів Міністерства оборони США. Цей пакет, оціночна вартість якого становить 500 мільйонів доларів, включає засоби протиповітряної оборони, боєприпаси для ракетних систем і артилерії, а також протитанкову зброю.",
		"https://www.defense.gov/News/Releases/Release/Article/3999956/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2024-12-07",
		"The Department of Defense (DoD) announced a new security assistance package for Ukraine. This package commits an additional $988 million in support through the Ukraine Security Assistance Initiative (USAI) that will provide Ukraine with munitions for rocket systems and Unmanned Aerial Systems. This package also includes support for maintenance and repair programs.",
		"Міністерство оборони США оголосило про новий пакет безпекової допомоги для України. Цей пакет передбачає виділення додаткових 988 мільйонів доларів США в рамках Ініціативи з надання допомоги Україні у сфері безпеки (USAI), що забезпечить Україну боєприпасами для ракетних систем і безпілотних літальних апаратів. Цей пакет також включає підтримку програм технічного обслуговування і ремонту.",
		"https://www.defense.gov/News/Releases/Release/Article/3989537/biden-administration-announces-new-security-assistance-package-for-ukraine/"
	],
	[
		"2024-12-05",
		"Finland has approved its 26th package of defense assistance for Ukraine. The package has an estimated value of EUR 25 million.",
		"Фінляндія затвердила 26-й пакет оборонної допомоги Україні. Орієнтовна вартість пакету становить 25 мільйонів євро.",
		"https://www.defmin.fi/en/topical/press_releases_and_news/finland_to_deliver_more_defence_materiel_to_ukraine.14694.news#878065dc"
	],
	[
		"2024-12-05",
		"The Netherlands is allocating EUR 22 million in aid to Ukraine. The funds will be used, among other things, to strengthen the air defense system, says Dutch Foreign Minister Caspar Veldkamp.",
		"Нідерланди виділяють 22 мільйони євро допомоги Україні. Кошти підуть, зокрема, на посилення системи протиповітряної оборони, повідомив міністр закордонних справ Нідерландів Каспар Вельдкамп.",
		"https://newsukraine.rbc.ua/news/netherlands-allocates-22-million-in-aid-to-1733404660.html"
	],
	[
		"2024-12-05",
		"The Netherlands won’t be able to spend €750 million (US$790 million) of military aid planned for Ukraine this year because of the tight global market for defense equipment, Dutch Defense Minister Ruben Brekelmans said.",
		"Нідерланди не зможуть витратити 750 мільйонів євро (790 мільйонів доларів США) військової допомоги, запланованої для України на цей рік, через обмеженість світового ринку оборонного обладнання, заявив міністр оборони Нідерландів Рубен Брекельманс.",
		"https://www.defensenews.com/global/europe/2024/12/05/dutch-say-tight-defense-market-leaves-750m-of-ukraine-aid-unspent/"
	],
	[
		"2024-12-05",
		"Bulgaria's Ministry of Defense has confirmed that the government has approved the provision of additional military assistance to Ukraine, as part of its ongoing support. Details of the specific military aid being provided remain classified.",
		"Міністерство оборони Болгарії підтвердило, що уряд схвалив надання додаткової військової допомоги Україні в рамках постійної підтримки. Деталі конкретної військової допомоги, що надається, залишаються засекреченими.",
		"https://www.novinite.com/articles/229738/Bulgaria+Approves+New+Military+Aid+to+Ukraine%2C+Receives+Financial+Compensation"
	],
	[
		"2024-12-02",
		"The 71st Presidential Drawdown Authority (PDA) package from the United States, which has an estimated value of $725 million, will provide Ukraine additional capabilities, including: air defense capabilities; munitions for rocket systems and artillery; and anti-tank weapons.",
		"71-й пакет президентських повноважень щодо скорочення озброєнь (PDA) від США, який оцінюється у 725 мільйонів доларів, надасть Україні додаткові можливості, зокрема: засоби протиповітряної оборони, боєприпаси для ракетних систем та артилерії, а також протитанкове озброєння.",
		"https://www.defense.gov/News/Releases/Release/Article/3982157/biden-administration-announces-additional-security-assistance-for-ukraine/"
	]
]