[
	[
		"2024-08-11",
		"The European Union has stated that Ukraine's recent incursion into Russia's Kursk region is considered a \"legitimate military action of self-defense.\" A spokesperson for Josep Borrell, the EU's foreign policy and security chief, emphasized that Ukraine has the right to defend itself, including striking enemy forces within Russian territory.",
		"Європейський Союз заявив, що нещодавнє вторгнення України в Курську область Росії вважається \"законною військовою акцією самооборони\". Речник Жозепа Борреля, керівника зовнішньої політики і безпеки ЄС, підкреслив, що Україна має право захищати себе, в тому числі завдаючи ударів по ворожих силах на території Росії.",
		"https://www.novinite.com/articles/227626/EU+Backs+Ukraine%E2%80%99s+Strikes+in+Russia+as+%27Self-Defense%27"
	],
	[
		"2024-08-09",
		"The Department of Defense (DoD) announced additional security assistance for Ukraine. This is the sixty-third tranche of equipment to be provided from DoD inventories for Ukraine since August 2021. The package, which has an estimated value of $125 million, includes:  air defense capabilities; multi-mission radars to detect and counter enemy artillery; and anti-tank weapons.",
		"Міністерство оборони США оголосило про надання Україні додаткової безпекової допомоги. Це вже шістдесят третій транш обладнання, яке буде надано Україні з запасів Міністерства оборони США з серпня 2021 року. Пакет, орієнтовна вартість якого становить 125 мільйонів доларів, включає: засоби протиповітряної оборони; багатофункціональні радари для виявлення та протидії ворожій артилерії; протитанкове озброєння.",
		"https://www.defense.gov/News/Releases/Release/Article/3868082/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2024-08-09",
		"In August, Lithuania will hand over combat machinery, counter-drone systems, transport and logistical means and part of the older armaments to Ukraine.",
		"У серпні Литва передасть Україні бойову техніку, системи протидії безпілотникам, транспортні та логістичні засоби, а також частину старого озброєння.",
		"https://kam.lt/lietuva-ukrainai-perduos-solidu-paramos-paketa/"
	],
	[
		"2024-08-07",
		"The Bulgarian government has allowed the Bulgarian military to train Ukrainian soldiers on the territory of NATO member states.",
		"Уряд Болгарії дозволив болгарським військовим тренувати українських солдатів на території країн-членів НАТО.",
		"https://bnr.bg/en/post/102030300/bulgarian-military-to-train-ukrainian-soldiers"
	],
	[
		"2024-08-04",
		"Ukraine has received its first batch of F-16 fighter jets as part of international support to bolster its defense capabilities.",
		"Україна отримала першу партію винищувачів F-16 в рамках міжнародної підтримки для зміцнення своєї обороноздатності.",
		"https://defence-blog.com/first-batch-of-f-16-fighter-jets-arrives-in-ukraine/"
	],
	[
		"2024-08-02",
		"Ukrainian soldiers of the 82nd Air Assault Brigade have received Cougar MRAP (Mine-Resistant Ambush Protected) armored vehicles.",
		"Українські бійці 82-ї десантно-штурмової бригади отримали броньовані автомобілі Cougar MRAP.",
		"https://euromaidanpress.com/2024/08/02/ukrainian-defenders-receive-american-made-cougar-mrap-armored-vehicles/"
	],
	[
		"2024-08-02",
		"Defense Secretary Lloyd Austin said Tuesday that the U.S. will soon announce an additional $2.3 billion in security assistance for Ukraine, to include anti-tank weapons, interceptors and munitions for Patriot and other air defense systems.",
		"Міністр оборони США Ллойд Остін заявив у вівторок, що США незабаром оголосять про надання Україні додаткової допомоги у сфері безпеки на суму 2,3 мільярда доларів, яка включатиме протитанкову зброю, перехоплювачі та боєприпаси для систем ППО Patriot та інших систем протиповітряної оборони.",
		"https://ca.news.yahoo.com/defense-secretary-austin-says-us-144048726.html"
	],
	[
		"2024-08-02",
		"Almost 100 days have now passed since the Congress passed $61 billion in emergency funding for Ukraine, a measure that included a condition that required the Biden Administration to present to the legislative body a detailed strategy for continued U.S. support. It is now August and there is still no sign on the part of the Biden Administration of any intention to submit such a strategy to Congress. ",
		"Минуло майже 100 днів відтоді, як Конгрес ухвалив рішення про виділення Україні 61 мільярда доларів у рамках надзвичайного фінансування, яке включало умову, що вимагала від адміністрації Байдена представити законодавчому органу детальну стратегію подальшої підтримки з боку Сполучених Штатів. Зараз серпень, а з боку адміністрації Байдена досі немає жодних ознак того, що вона має намір представити таку стратегію на розгляд Конгресу. ",
		"https://responsiblestatecraft.org/biden-ukraine-strategy/"
	],
	[
		"2024-08-01",
		"The Department of Defense (DoD) announced that more weapons have been approved to send to Ukrainian defense forces, authorizing two packages worth a total of $1.7 billion. An additional $200 million from the Presidential Drawdown Authority (PDA) and $1.5 billion from the Ukraine Security Assistance Initiative (USAI) will contribute air missile systems, munitions, electronic warfare equipment, and explosives and munitions to continue Ukraine’s defense against Russia.",
		"Міністерство оборони (МО) США оголосило, що було схвалено надання додаткового озброєння українським силам оборони, затвердивши два пакети на загальну суму 1,7 мільярда доларів. Додаткові 200 мільйонів доларів від Президентського органу з питань скорочення озброєнь (PDA) та 1,5 мільярда доларів від Ініціативи сприяння безпеці України (USAI) будуть спрямовані на постачання зенітних ракетних систем, боєприпасів, засобів радіоелектронної боротьби, а також вибухових речовин та боєприпасів для продовження оборони України від Росії.",
		"https://www.presidentialprayerteam.org/2024/08/01/defense-department-announces-20th-drawdown-for-ukraine-aid/"
	],
	[
		"2024-07-27",
		"The EU announced on Friday that it had made available the transfer of the first 1.5 billion ($1.6 billion) payout of interest earned on seized Russian assets to Kiev to help it buy weapons.",
		"У п'ятницю ЄС оголосив, що виділив перші 1,5 мільярда доларів ($1,6 мільярда) з відсотків, зароблених на заарештованих російських активах, Києву, щоб допомогти йому закупити зброю.",
		"https://www.bignewsnetwork.com/news/274471000/eu-sends-first-16-billion-from-seized-russian-money-to-kiev"
	],
	[
		"2024-07-27",
		"Russia continues to deepen bilateral relations with Iran and North Korea in exchange for the provision of lethal aid to the Russian military for use in Ukraine.",
		"Росія продовжує поглиблювати двосторонні відносини з Іраном і Північною Кореєю в обмін на надання летальної допомоги російським військовим для використання в Україні.",
		"https://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-july-27-2024"
	],
	[
		"2024-07-27",
		"The UK has confirmed the provision of over 12,000 anti-tank weapons to Ukraine since the onset of the conflict with Russia, according to a recent parliamentary exchange.",
		"Великобританія підтвердила надання Україні понад 12 000 одиниць протитанкового озброєння з початку конфлікту з Росією, згідно з нещодавнім парламентським обміном думками.",
		"https://ukdefencejournal.org.uk/uk-has-supplied-over-12000-anti-tank-missiles-to-ukraine/"
	],
	[
		"2024-07-25",
		"Warsaw is now providing its 45th package of military aid to Ukraine, which includes a significant amount of ammunition.",
		"Зараз Варшава надає 45-й пакет військової допомоги Україні, який включає значну кількість боєприпасів.",
		"https://www.ukrinform.net/rubric-defense/3888753-poland-sending-45th-package-of-defense-aid-to-ukraine-ambassador-zvarych.html"
	],
	[
		"2024-07-25",
		"The Pentagon has found $2 billion worth of additional errors in its calculations for ammunition, missiles and other equipment sent to Ukraine, increasing the improperly valued material to a total of $8.2 billion, a U.S. government report revealed on Thursday.",
		"Пентагон виявив додаткові помилки в розрахунках боєприпасів, ракет та іншого обладнання, відправлених в Україну, на суму 2 мільярди доларів, що збільшило загальну суму неправильно оцінених матеріалів до 8,2 мільярда доларів, йдеться у звіті уряду США, оприлюдненому в четвер.",
		"https://reuters.com/world/us/pentagon-finds-another-2-billion-accounting-errors-ukraine-aid-2024-07-25/"
	],
	[
		"2024-07-25",
		"UK Defense Secretary John Healey: 'The UK will \"step up\" with extra ammunition, guns, boats, and battlefield equipment needed by the Ukrainian Armed Forces on the front lines.' Healey confirmed the UK government's plan to commit £3 billion ($3.9 billion) in military aid to Ukraine this year and each subsequent year. London will assist allies in increasing their support for Ukraine \"to ensure that Ukraine prevails.\"",
		"Міністр оборони Великої Британії Джон Хілі: «Велика Британія надасть додаткові боєприпаси, гармати, катери та бойову техніку, необхідні Збройним силам України на передовій». Хілі підтвердив план уряду Великої Британії виділити 3 мільярди фунтів стерлінгів (3,9 мільярда доларів) на військову допомогу Україні цього року і кожного наступного року. Лондон допомагатиме союзникам у збільшенні їхньої підтримки України, «щоб забезпечити перемогу України».",
		"https://www.msn.com/en-us/news/world/uk-defense-secretary-pledges-faster-military-aid-to-ukraine/ar-BB1qBd96?ocid=BingNewsVerp&apiversion=v2&noservercache=1&domshim=1&renderwebcomponents=1&wcseo=1&batchservertelemetry=1&noservertelemetry=1"
	],
	[
		"2024-07-25",
		"Spain will strengthen Ukraine’s air defense with a battery of Hawk air defense systems.",
		"Іспанія посилить протиповітряну оборону України батареєю зенітно-ракетних комплексів Hawk.",
		"https://mil.in.ua/en/news/spain-to-reinforce-ukraine-s-air-defense-with-hawk-air-defense-systems-in-september/"
	],
	[
		"2024-07-25",
		"The Netherlands and Denmark purchased 14 Leopard 2A4 tanks for Ukraine's Armed Forces, and they will arrive in Ukraine by the end of the summer.",
		"Нідерланди та Данія закупили для Збройних сил України 14 танків Leopard 2A4, які прибудуть в Україну до кінця літа.",
		"https://www.pravda.com.ua/eng/news/2024/07/25/7467344/"
	],
	[
		"2024-07-23",
		"Slovakia's Defense Minister Robert Kalinak plans to increase the production of artillery shells from 125,000 this year to 200,000 next year. However, although the Slovak government officially refuses to arm Ukraine, Slovak ammunition still finds its way there.",
		"Міністр оборони Словаччини Роберт Калінак планує збільшити виробництво артилерійських снарядів зі 125 000 цього року до 200 000 наступного. Однак, хоча словацький уряд офіційно відмовляється озброювати Україну, словацькі боєприпаси все одно потрапляють туди.",
		"https://unn.ua/en/news/slovakia-arms-ukraine-against-its-will-bloomberg"
	],
	[
		"2024-07-23",
		"Hungary continues to block the next tranche of the European Peace Fund intended for military assistance to Ukraine.",
		"Угорщина продовжує блокувати наступний транш Європейського фонду миру, призначений для військової допомоги Україні.",
		"https://www.msn.com/en-us/news/world/hungary-blocks-eu-fund-for-ukrainian-weapons-again/ar-BB1qrnOq"
	],
	[
		"2024-07-23",
		"Following an EU Foreign Affairs ministerial meeting in Brussels on Monday, foreign policy chief Josep Borrell announced that the first installment of 1.4 billion euros ($1.5 billion) in military aid to Ukraine, funded by the profits from frozen Russian assets, will be disbursed in early August.",
		"Після зустрічі міністрів закордонних справ ЄС у Брюсселі в понеділок, глава зовнішньополітичного відомства Жозеп Боррель оголосив, що перший транш у розмірі 1,4 мільярда євро (1,5 мільярда доларів) військової допомоги Україні, що фінансується за рахунок прибутків від заморожених російських активів, буде виплачений на початку серпня.",
		"https://en.apa.az/europe/eu-to-release-14bln-euros-in-military-aid-to-kiev-from-russian-assets-443310"
	],
	[
		"2024-07-22",
		"Bulgaria is working on a new arms package for Ukraine, said the country’s caretaker Defense Minister Atanas Zapryanov. Proposed military aid for Ukraine, comprising surplus ammunition and equipment from the Bulgarian army, is ready for review and will very soon be submitted for the cabinet’s approval.",
		"Болгарія працює над новим пакетом озброєнь для України, заявив тимчасовий виконувач обов'язків міністра оборони країни Атанас Запрянов. Пропонована військова допомога Україні, що включає в себе надлишки боєприпасів і обладнання болгарської армії, готова до розгляду і найближчим часом буде передана на затвердження кабінету міністрів.",
		"https://www.aa.com.tr/en/russia-ukraine-war/bulgaria-works-on-new-arms-package-for-ukraine/3282581"
	],
	[
		"2024-07-22",
		"A new package of military aid to Ukraine has been annoumced by Latvian Minister of Defence: \"A package of more than 500 drones begins its journey to Ukraine.\"",
		"Міністр оборони Латвії оголосив про новий пакет військової допомоги Україні: «Пакет з більш ніж 500 безпілотників починає свою подорож до України».",
		"https://x.com/AndrisSpruds/status/1815358957080158547"
	],
	[
		"2024-07-20",
		"Slovakia's Prime Minister Robert Fico has made it clear that his country will not be a 'hostage' in the ongoing tensions between Ukraine and Russia. This declaration was made during a phone call with Ukrainian Prime Minister Denys Shmyhal following Kyiv's decision to place Russian group Lukoil on its sanctions list, leading to halted oil deliveries.",
		"Прем'єр-міністр Словаччини Роберт Фіцо дав зрозуміти, що його країна не буде «заручником» у напруженій ситуації між Україною та Росією. Ця заява була зроблена під час телефонної розмови з прем'єр-міністром України Денисом Шмигалем після рішення Києва внести російську групу «Лукойл» до списку санкцій, що призвело до припинення поставок нафти.",
		"https://www.devdiscourse.com/article/headlines/3024449-slovakia-asserts-independence-amid-ukraine-russia-tensions"
	],
	[
		"2024-07-20",
		"Britain, a leading Western country in providing military support to Ukraine, has asserted that it will not assist Ukraine in attacking targets within Russian territory.",
		"Великобританія, провідна західна країна у наданні військової підтримки Україні, заявила, що не допомагатиме Україні атакувати цілі на території Росії.",
		"https://vovworld.vn/en-US/news/britain-says-it-will-not-aid-ukraine-in-attacking-targets-in-russia-1312283.vov"
	],
	[
		"2024-07-19",
		"The UK Defence and Business Secretaries met with President Zelenskyy and industry leaders in London on 18 July to discuss deeper cooperation and the need to boost industrial production for Ukraine. The government confirmed £3bn a year to help Ukraine and a new package of ammunition, anti-armour missiles and artillery guns. The MOD agreed to regenerate the UK’s ability to produce forgings for gun barrels, working in partnership with Sheffield Forgemasters, supporting the repair and overhaul of Ukrainian vehicles; this is the first step towards UK sovereign barrel production which has been developing for 20 years. ",
		"Міністри оборони та бізнесу Великої Британії зустрілися з президентом Зеленським та лідерами промисловості в Лондоні 18 липня, щоб обговорити поглиблення співпраці та необхідність стимулювання промислового виробництва в Україні. Уряд підтвердив виділення 3 млрд фунтів стерлінгів на рік на допомогу Україні та новий пакет боєприпасів, протитанкових ракет та артилерійських гармат. Міністерство оборони погодилося відновити можливості Великої Британії з виробництва поковок для гарматних стволів, працюючи у партнерстві з компанією Sheffield Forgemasters, підтримуючи ремонт та капітальний ремонт української техніки; це перший крок на шляху до власного виробництва стволів у Великій Британії, яке розвивалося протягом 20 років. ",
		"https://www.gov.uk/government/news/uk-government-and-defence-industry-stepping-up-support-for-ukraine"
	],
	[
		"2024-07-19",
		"Ukraine and the United Kingdom sign a loan agreement worth 2 billion pounds. « Under the terms of the framework agreement, the loan will be used for large-scale pro-defense projects in Ukraine, which will reduce the burden on the State budget and allow in the short term to obtain the necessary weapons to protect our state, first of all — in the field of air defense », — said the Minister of Defense of Ukraine Rustem Umerov. ",
		"Україна та Велика Британія підписали кредитну угоду на 2 млрд фунтів стерлінгів. «За умовами рамкової угоди кредит буде використаний на масштабні проєкти з розвитку обороноздатності України, що знизить навантаження на Державний бюджет та дозволить в короткостроковій перспективі отримати необхідне озброєння для захисту нашої держави, перш за все — у сфері протиповітряної оборони», — зазначив міністр оборони України Рустем Умєров. ",
		"https://www.mil.gov.ua/news/2024/07/19/ukraina-ta-velikabritaniya-pidpisali-kreditnu-ugodu-na-2-mlrd-funtiv-sterlingiv/"
	],
	[
		"2024-07-18",
		"Ukraine signed security agreements with the Czech Republic and Slovenia during Volodymyr Zelensky’s visit to the UK.",
		"Україна підписала угоди про безпеку з Чехією та Словенією під час візиту Володимира Зеленського до Великої Британії.",
		"https://mil.in.ua/en/news/ukraine-signs-security-agreements-with-the-czech-republic-and-slovenia/"
	],
	[
		"2024-07-18",
		"France will train 2,100 Ukrainian recruits and arm them with Caesar howitzers, armored vehicles, and other systems.",
		"Франція підготує 2100 українських новобранців та озброїть їх гаубицями «Цезар», бронемашинами та іншими системами.",
		"https://mil.in.ua/en/news/france-to-train-and-arm-ukrainian-brigade-by-the-end-of-the-year/"
	],
	[
		"2024-07-17",
		"Germany plans to halve its military aid to Ukraine next year, despite concerns that U.S. support for Kyiv could potentially diminish. German aid to Ukraine will be cut to 4 billion euros ($4.35 billion) in 2025 from around 8 billion euros in 2024, according to a draft of the 2025 budget seen by Reuters.",
		"Німеччина планує вдвічі скоротити військову допомогу Україні наступного року, незважаючи на побоювання, що підтримка Києва з боку США може потенційно зменшитися. Німецька допомога Україні буде скорочена до 4 мільярдів євро (4,35 мільярда доларів) у 2025 році з близько 8 мільярдів євро у 2024 році, згідно з проектом бюджету на 2025 рік, з яким ознайомилося агентство Reuters.",
		"https://www.reuters.com/world/europe/germany-halve-military-aid-ukraine-despite-possible-trump-white-house-2024-07-17/"
	],
	[
		"2024-07-17",
		"A Russian individual has plead guilty and was sentenced for 3 years in prison in the United States for smuggling dual-purpose micro-led screens to Russian arm manufacturers.",
		"Росіянин визнав себе винним і був засуджений до 3 років ув'язнення в США за контрабанду мікроекранів подвійного призначення для російських виробників озброєнь.",
		"https://www.justice.gov/usao-sdny/pr/russian-international-money-launderer-sentenced-three-years-prison-illicitly-procuring"
	]
]