[
	[
		"2023-07-22",
		"Minister of Defense of Poland wrote in his Twitter: \"The renovation hub in Gliwice has started operating! The first two Leopards have already arrived from Ukraine to the Bumar plant.\"",
		"Міністр оборони Польщі написав у своєму Twitter: «Запрацював реноваційний хаб у Глівіце! Перші два Leopard вже прибули з України на завод Bumar».",
		"https://twitter.com/mblaszczak/status/1682794978781675520?s=20"
	],
	[
		"2023-07-22",
		"Rheinmetall will produce for Ukraine 300,000 rounds for Gepard self-propelled anti-aircraft guns., 40 000 will be delivered in 2023.",
		"Rheinmetall виготовить для України 300 тис. набоїв для САУ Gepard, 40 тис. буде поставлено у 2023 році.",
		"https://www.bild.de/bild-plus/politik/inland/politik-inland/ukraine-deutsche-ingenieure-loesen-entscheidendes-munitionsproblem-84778262.bild.html"
	],
	[
		"2023-07-22",
		"Ukraine has received several dozen Wolfram mobile ground-based platforms for Brimstone 1/2 SSMs from the United Kingdom.",
		"Ukraine has received several dozen Wolfram mobile ground-based platforms for Brimstone 1/2 SSMs from the United Kingdom.",
		"https://twitter.com/oryxspioenkop/status/1682833055533154304?s=20"
	],
	[
		"2023-07-21",
		"The United States plans to announce as soon as Tuesday a new military aid package for Ukraine worth up to $400 million, primarily comprised of artillery, air defense missiles and ground vehicles.",
		"Сполучені Штати планують уже у вівторок оголосити про новий пакет військової допомоги для України на суму до 400 мільйонів доларів США, який в основному складається з артилерії, ракет ППО та наземної техніки.",
		"https://www.reuters.com/world/europe/us-give-ukraine-new-400-million-military-aid-package-2023-07-21/"
	],
	[
		"2023-07-20",
		"European Union foreign ministers discussed a proposal by EU foreign policy chief Josep Borrell to spend up to €20 billion ($22.4 billion) on weapons, ammunition and other military aid for Ukraine over four years. According to EU officials and diplomats, Josep Borrell proposed adding an annual contribution of up to €5 billion for Ukraine into an EU-managed fund called the European Peace Facility to support Ukraine as it fights a Russian invasion. The fund has already disbursed over €5 billion in support to Ukraine since February of last year. If approved, the additional funding would span from 2024 to 2027, ensuring a more stable and sustainable supply of military aid to Ukraine.",
		"Міністри закордонних справ Європейського Союзу обговорили пропозицію верховного представника ЄС із закордонних справ Жозепа Борреля витратити до 20 мільярдів євро на зброю, боєприпаси та іншу військову допомогу Україні протягом чотирьох років. За словами офіційних осіб і дипломатів ЄС, Жозеп Боррель запропонував додати щорічний внесок для України в розмірі до 5 мільярдів євро до керованого ЄС фонду під назвою Європейський фонд миру для підтримки України, яка бореться з російським вторгненням. З лютого минулого року фонд уже виділив понад 5 мільярдів євро на підтримку України. У разі схвалення додаткове фінансування охопить період з 2024 по 2027 рік, забезпечуючи більш стабільне та стабільне постачання військової допомоги Україні.",
		"https://www.dw.com/en/eu-foreign-ministers-discuss-ukraine-military-aid-proposal/a-66292393"
	],
	[
		"2023-07-20",
		"Germany’s Ministry of Defense announced the delivery of 10 Leopard 1A5 Main Battle Tanks [MBTs] to Ukraine. This move is part of Germany’s commitment to bolster Ukraine’s defenses, with plans to send a total of 100 Leopard 1A5 tanks. ",
		"Міністерство оборони Німеччини оголосило про поставку в Україну 10 основних бойових танків Leopard 1A5. Цей крок є частиною зобов’язань Німеччини зміцнити обороноздатність України, загалом планується відправити 100 танків Leopard 1A5.",
		"https://bulgarianmilitary.com/2023/07/22/first-of-100-leopard-1-tanks-have-already-been-delivered-to-ukraine/"
	],
	[
		"2023-07-19",
		"The Pentagon announced a new $1.3 billion package of long-term military aid to Ukraine: \n\n- 150,000 152mm artillery shells\n- 300 tactical vehicles to tow and haul equipment\n- 60 tactical vehicles to recover equipment\n- 2,000 TOW missiles\n- 4 NASAMS anti-air systems\n- 50 heavy fuel tankers",
		"Пентагон оголосив про новий пакет довгострокової військової допомоги Україні на $1,3 млрд:\n\n- 150 000 артилерійських снарядів калібру 152 мм\n- 300 тактичних автомобілів для буксирування та перевезення техніки\n- 60 тактичних автомобілів для відновлення техніки\n- 2000 ракет TOW\n- 4 протиповітряні системи NASAMS\n- 50 паливозаправників",
		"https://media.defense.gov/2023/Jul/19/2003263170/-1/-1/1/UKRAINE-FACT-SHEET.PDF"
	],
	[
		"2023-07-18",
		"the UK Ministry of Defence published The Defence Command Paper Refresh (DCP23), which sets out a plan to deliver a credible warfighting force and to act as a global heavyweight both now and in the future. Among other things it includes a £2.5 billion investment in ammunition production and stockpiles and a creation of Global Response Force that enables the British Armed Forces to ‘get there first’.",
		"Міністерство оборони Великої Британії опублікувало документ «Оновлення командування оборони» (DCP23), у якому викладено план створити надійну бойову силу та діяти як глобальна суперважка вага як зараз, так і в майбутньому. Серед іншого, це включає інвестиції в розмірі 2,5 мільярда фунтів стерлінгів у виробництво та запаси боєприпасів, а також створення Глобальних сил реагування, які дозволять британським збройним силам «дійти туди першими».",
		"https://www.gov.uk/government/news/refreshed-defence-command-paper-sets-out-future-for-armed-forces"
	],
	[
		"2023-07-18",
		"The Forges de Tarbes plant has received a contract for the supply of 60,000 hulls intended for the production of 155mm shells to Ukraine, which will be delivered in 2024.",
		"Завод Forges de Tarbes отримав контракт на поставку в Україну 60 тис. корпусів, призначених для виробництва 155-мм снарядів, які будуть поставлені в 2024 році.",
		"https://objectifaquitaine.latribune.fr/business/industrie/2023-07-18/l-ukraine-commande-120-000-grands-corps-creux-d-obus-de-155-mm-par-an-a-europlasma-970029.html"
	],
	[
		"2023-07-17",
		"The US will allow European countries to train Ukrainians on F-16 fighter jets.",
		"США дозволять європейським країнам навчати українців на винищувачах F-16.",
		"https://edition.cnn.com/2023/07/16/politics/us-ukraine-f16-jake-sullivan-cnntv/index.html"
	],
	[
		"2023-07-15",
		"South Korean President Yoon Suk-yeol said Saturday his country will provide a bigger batch of military supplies and humanitarian aid to Ukraine.",
		"Президент Південної Кореї Юн Сук Йоль заявив, що в суботу його країна надасть більшу партію військового обладнання та гуманітарної допомоги Україні.",
		"https://www.japantimes.co.jp/news/2023/07/15/world/politics-diplomacy-world/yoon-ukraine-visit/"
	],
	[
		"2023-07-14",
		"Washington will repurchase decommissioned HAWK air defense missiles it sold to Taiwan and deliver them to Ukraine as part of a military aid package",
		"Вашингтон викупить списані зенітні ракети HAWK, які продав Тайваню, і поставить їх Україні в рамках пакету військової допомоги",
		"https://kyivindependent.com/media-us-to-repurchase-taiwans-hawk-missiles-for-ukraine-aid/"
	],
	[
		"2023-07-14",
		"Germany will have supplied Ukraine with around €17 billion in military assistance by 2027. A government document published on Wednesday said the investment included €2 billion in 2022, some €5.4 billion this year and another €10.5 billion by 2027.",
		"Німеччина надасть Україні близько 17 мільярдів євро військової допомоги до 2027 року. В урядовому документі, опублікованому в середу, говориться, що інвестиції включають 2 мільярди євро в 2022 році, приблизно 5,4 мільярда євро цього року та ще 10,5 мільярда євро до 2027 року.",
		"https://www.thelocal.de/20230714/germany-pledges-major-long-term-military-aid-to-ukraine"
	],
	[
		"2023-07-14",
		"Germany approved for Ukraine a €700 million ($769 million) military aid package that included air defense equipment, infantry fighting vehicles, main battle tanks and artillery ammunition.",
		"Німеччина схвалила пакет військової допомоги Україні на суму 700 мільйонів євро, який включає засоби протиповітряної оборони, бойові машини піхоти, основні бойові танки та артилерійські боєприпаси.",
		"https://www.reuters.com/world/europe/berlin-finalises-700-mln-euro-military-aid-package-ukraine-2023-07-11/"
	],
	[
		"2023-07-13",
		"The largest one-time military aid package –  which includes 100 armoured vehicles from the Bulgarian police stockpile, mostly infantry carrier vehicles – was sent to Ukraine.",
		"Найбільший разовий пакет військової допомоги, який включає 100 одиниць бронетехніки зі складу болгарської поліції, в основному транспортні машини піхоти, відправлено в Україну.",
		"https://www.euractiv.com/section/politics/news/bulgaria-sends-largest-military-aid-package-to-ukraine/"
	],
	[
		"2023-07-13",
		"After the NATO summit Australia has decided to provide further 30 Bushmaster vehicles. The Ministry of Defence announced a further step in its support for Ukraine - the deployment of an RAAF E-7A Wedgetail aircraft to protect the flow of assistance.",
		"Після саміту НАТО Австралія вирішила надати ще 30 машин Bushmaster. Міністерство оборони оголосило про наступний крок у своїй підтримці України – розгортання літака RAAF E-7A Wedgetail для захисту потоку допомоги.",
		"https://www.maitlandmercury.com.au/story/8267988/australia-boosts-bushmaster-military-aid-to-ukraine/"
	],
	[
		"2023-07-13",
		"Biden told reporters after the NATO conference that he is considering sending Ukraine long-range Army Tactical Missile Systems, or ATACMS.",
		"Після конференції НАТО Байден заявив журналістам, що розглядає можливість відправки Україні тактичних ракетних систем великої дальності (ATACMS).",
		"https://time.com/6294683/congress-ukraine-aid-biden-funding/"
	],
	[
		"2023-07-13",
		"France’s parliament on Thursday approved a multi-billion-euro boost to military spending through the rest of this decade, spurred by Russia’s war in Ukraine and fast-growing global threats. This represents a 40% increase compared to the $320 billion budget for 2019-2025. The new military plan includes doubling the number of military reservists and reinforcing cyberdefense, as well as increasing weapons production capacity both to help Ukraine and to keep the French military adequately supplied.",
		"Парламент Франції в четвер схвалив збільшення військових витрат на кілька мільярдів євро до кінця цього десятиліття, що було спричинене війною Росії в Україні та швидко зростаючими глобальними загрозами. Це на 40% більше порівняно з бюджетом у 320 мільярдів доларів на 2019-2025 роки. Новий військовий план передбачає подвоєння кількості військових резервістів і посилення кіберзахисту, а також збільшення потужностей з виробництва зброї як для допомоги Україні, так і для належного забезпечення французької армії.",
		"https://apnews.com/article/france-military-budget-ukraine-war-defense-spending-4f63e50c61af404f2beedde1120fe43c"
	],
	[
		"2023-07-12",
		"Germany has decided to quit from a deal with Poland to repair Leopard 2 tanks from Ukraine due to high costs.",
		"Німеччина вирішила вийти з угоди з Польщею щодо ремонту українських танків Leopard 2 через високу вартість.",
		"https://www.devdiscourse.com/article/law-order/2520310-germany-drops-out-of-planned-tank-repair-hub-in-poland---handelsblatt"
	],
	[
		"2023-07-12",
		"Ukraine will receive 2 more NASAMS air defense systems and spare parts from Norway.",
		"Україна отримає від Норвегії ще 2 системи ППО NASAMS та запчастини до них.",
		"https://twitter.com/Forsvarsdep/status/1679092147444760576?s=20"
	],
	[
		"2023-07-12",
		"Norway donates 1000 Black Hornet nano drones to Ukraine",
		"Норвегія дарує Україні 1000 нанодронів Black Hornet.",
		"https://twitter.com/Forsvarsdep/status/1679023439632277504?s=20"
	],
	[
		"2023-07-11",
		"The EU’s diplomatic service has drafted a plan that recommends the bloc make a full slate of “security commitments to Ukraine” for years to come as it fends off Russia’s onslaught. The suggestions from the European External Action Service run the gamut, including everything from ensuring a “sustained” flow of weapons to Kyiv, to continuing military education and training, to sharing intelligence and helping connect Ukrainian and EU defense companies.",
		"Дипломатична служба ЄС розробила проект плану, який рекомендує блоку взяти на себе повний перелік «зобов’язань щодо безпеки перед Україною» на роки вперед, оскільки вона відбиватиметься від нападу Росії. Пропозиції від Європейської служби зовнішніх дій охоплюють широкий спектр пропозицій, включаючи все, починаючи від забезпечення «постійного» надходження зброї до Києва, до безперервної військової освіти та навчання, до обміну розвідданими та допомоги в з’єднанні оборонних компаній України та ЄС.",
		"https://www.politico.eu/article/eu-draws-up-plan-for-sustained-military-aid-to-ukraine/"
	],
	[
		"2023-07-11",
		"Norway's government said Tuesday it was pledging an additional 2.5 billion kroner ($240 million) of military aid to Ukraine, bringing the total to 10 billion for the year. ",
		"Уряд Норвегії заявив у вівторок, що обіцяє надати додаткові 2,5 мільярда крон (240 мільйонів доларів) військової допомоги Україні, довівши загальну суму до 10 мільярдів за рік.",
		"https://www.thelocal.no/20230711/norway-increases-military-aid-to-ukraine"
	],
	[
		"2023-07-11",
		"The UK government will provide Ukraine with more than 70 combat and logistic vehicles, thousands of rounds of ammunition for Challenger 2 tanks, and a GBP 50 million ($64.7 million) support package for equipment repair.",
		"Уряд Великої Британії надасть Україні понад 70 бойових і матеріально-технічних машин, тисячі боєприпасів для танків Challenger 2, а також пакет підтримки в розмірі 50 мільйонів фунтів стерлінгів (64,7 мільйона доларів) на ремонт обладнання.",
		"https://www.reuters.com/world/europe/uk-provide-65-mln-support-package-ukraine-2023-07-11/"
	],
	[
		"2023-07-10",
		"The German arms maker Rheinmetall will deploy production facilities for the production of armored vehicles in Ukraine within the following 12 weeks.",
		"Німецький виробник зброї Rheinmetall протягом наступних 12 тижнів розгорне в Україні потужності з виробництва бронетехніки.",
		"https://edition.cnn.com/2023/07/10/business/rheinmetall-german-tank-factory-ukraine/index.html"
	],
	[
		"2023-07-09",
		"Poland has supplied Ukraine with about 12 Mi-24 attack helicopters without announcement.",
		"Польща без оголошення поставила Україні близько 12 ударних вертольотів Мі-24.",
		"https://www.wsj.com/articles/ukraine-war-counteroffensive-frontlines-russia-add3e4e4"
	],
	[
		"2023-07-07",
		"Slovakia will supply Ukraine with 16 Zuzanna-2 howitzers.",
		"Словаччина поставить Україні 16 гаубиць Zuzanna-2.",
		"https://en.interfax.com.ua/news/general/921535.html"
	],
	[
		"2023-07-07",
		"The Defense Department announced an additional security assistance package of up to $800 million aimed to support Ukraine: \n\n- 300 Stingers\n- 36 artillery systems M777\n- 17 recovery tactical vehicles\n- 32 Bradleys\n- 32 Strykers\n- UAS Penguin\n- air-to-air AIM-7 missilles\n- TOW missiles\n- small arms munition \n\nThe package also contains dual-purpose improved conventional munitions, or DPICM, which the Pentagon is providing for the first time to Ukraine",
		"Міністерство оборони США оголосило про додатковий пакет безпекової допомоги на суму до 800 мільйонів доларів, спрямований на підтримку України: \n\n- 300 Стінгерів\n- 36 артилерійських систем M777\n- 17 евакуаційно-тактичних машин\n- 32 Бредлі\n- 32 Страйкери\n- UAS Penguin\n- ракети повітря-повітря AIM-7\n- ракети TOW\n- боєприпаси до стрілецької зброї\n\nПакет також містить вдосконалені звичайні боєприпаси подвійного призначення або DPICM, які Пентагон вперше надає Україні",
		"https://www.defense.gov/News/News-Stories/Article/Article/3451905/dod-announces-800m-security-assistance-package-for-ukraine/"
	],
	[
		"2023-07-07",
		"Only around half of heavy weapons committed to Ukraine have been delivered, experts say: 'The gap between promised and delivered military aid is wide'. The Kiel Institute said some European countries like the Czech Republic, Slovenia, Poland, and Slovakia had outperformed others, delivering \"upwards of 80 percent of their promised heavy weapons.\"",
		"Лише близько половини важкого озброєння, обіцяного Україні, було поставлено: «Розрив між обіцяною та наданою військовою допомогою великий». Кільський інститут заявив, що деякі європейські країни, такі як Чехія, Словенія, Польща та Словаччина, перевершили інші, поставивши «понад 80 відсотків своїх обіцяних важких озброєнь».",
		"https://www.businessinsider.com/only-half-of-heavy-weapons-promised-to-ukraine-delivered-experts-2023-7"
	],
	[
		"2023-07-07",
		"Czhech Republic will provide Ukraine with attack helicopters, possibly Mi-24, large-caliber ammunition and will provide training of Ukrainian pilots for F-16s.",
		"Чехія надасть Україні ударні гелікоптери, можливо, Мі-24, великокаліберні боєприпаси та забезпечить навчання українських пілотів на F-16.",
		"https://www.youtube.com/live/-JpwYk3BIjU?feature=share"
	],
	[
		"2023-07-07",
		"Ukraine expects to receive Turkish-made Fırtına self-propelled howitzers.",
		"Україна розраховує отримати самохідні гаубиці Fırtına турецького виробництва.",
		"https://www.overtdefense.com/2023/07/07/ukraine-aims-to-procure-t-155-firtina-howitzers-from-turkey/"
	],
	[
		"2023-07-05",
		"Poland’s foreign and UK defence ministers hold talks on further support for Ukraine and bilateral military cooperation. ",
		"Міністри оборони Польщі та Великої Британії ведуть переговори щодо подальшої підтримки України та двостороннього військового співробітництва.",
		"https://www.polskieradio.pl/395/9766/artykul/3202366,update-polish-uk-fms-defence-ministers-to-discuss-support-for-ukraine-military-ties"
	],
	[
		"2023-07-04",
		"Bulgarian military aid will be increased this year, Defence Minister Todor Tagarev said on state television BNT, adding that the country will send weapons after they finish analysing the needs of the Ukrainian army and how much the Bulgarian armed forces are capable of giving.",
		"Військова допомога Болгарії цього року буде збільшена, заявив міністр оборони Тодор Тагарєв в ефірі державного телебачення BNT, додавши, що країна надішле зброю після того, як завершиться аналіз потреб української армії та того, скільки болгарські збройні сили здатні надати.",
		"https://www.euractiv.com/section/politics/news/bulgaria-to-increase-its-military-aid-to-ukraine-this-year/"
	],
	[
		"2023-07-03",
		"Slovakia and Ukraine have entered into a cooperative agreement to jointly develop a new wheeled self-propelled howitzer.",
		"Словаччина та Україна уклали угоду про співпрацю щодо спільної розробки нової колісної самохідної гаубиці.",
		"https://www.armyrecognition.com/defense_news_july_2023_global_security_army_industry/slovakia_and_ukraine_collaborate_on_new_155mm_wheeled_self-propelled_howitzer.html"
	],
	[
		"2023-06-30",
		"The Biden administration is actively considering sending cluster munitions to Ukraine.",
		"Адміністрація Байдена активно розглядає можливість відправлення касетних боєприпасів в Україну.",
		"https://www.politico.com/news/2023/06/29/cluster-munitions-for-ukraine-under-active-consideration-by-u-s-00104346"
	],
	[
		"2023-06-30",
		"Sweden's military support to Ukraine has reduced stocks of ammunition. The situation is critical, but getting new shells quickly is not possible. Therefore, the government has decided that the manufacture of ammunition should be as important as the long-term investment in Gripen planes and submarines.",
		"Військова підтримка України Швецією призвела до скорочення запасів боєприпасів. Ситуація критична, але швидко отримати нові снаряди неможливо. Тому уряд вирішив, що виробництво боєприпасів має бути таким же важливим, як і довгострокові інвестиції в літаки та підводні човни Gripen.",
		"https://www.dn.se/sverige/ammunitionskris-i-forsvaret-for-lite-pa-lager/"
	],
	[
		"2023-06-30",
		"Ukrainian forces use now Turkish Cobra II armored vehicles",
		"Українські війська зараз використовують турецьку бронетехніку Cobra II",
		"https://www.armyrecognition.com/defense_news_june_2023_global_security_army_industry/ukrainian_forces_use_now_turkish_cobra_ii_armored_vehicle.html"
	],
	[
		"2023-06-29",
		"The EU has agreed to offer “future security commitments” to Ukraine. The agreement commits the EU to continue financing weapons supplies to Kyiv through the European Peace Facility, a fund paid for by capitals, according to a person briefed on the discussions. They also pledged to expand the EU’s initiative to train Ukrainian troops, and to explore the possibility of EU military missions to Ukraine if the conditions for it were deemed suitable.",
		"ЄС погодився запропонувати Україні «майбутні зобов’язання щодо безпеки». Угода зобов’язує ЄС продовжувати фінансувати поставки зброї Києву через Європейський фонд миру. Вони також пообіцяли розширити ініціативу ЄС щодо підготовки українських військових, а також вивчити можливість військових місій ЄС в Україні, якщо умови для цього будуть визнані відповідними.",
		"https://www.ft.com/content/8f0528ba-45a4-42c0-b099-07a34e2ee9ff"
	],
	[
		"2023-06-28",
		"The German arms manufacturer Rheinmetall confirmed the upcoming shipment of 14 Leopard 2A4 tanks to Ukraine.",
		"Німецький виробник озброєнь Rheinmetall підтвердив постачання в Україну 14 танків Leopard 2A4.",
		"https://www.plenglish.com/news/2023/06/28/german-arms-manufacturer-to-supply-military-aid-to-ukraine/"
	],
	[
		"2023-06-28",
		"Solid majorities of Americans support providing weaponry to Ukraine to defend itself against Russia and believe that such aid demonstrates to China and other U.S. rivals a will to protect U.S. interests and allies, according to a Reuters/Ipsos survey.",
		"Згідно з опитуванням Reuters/Ipsos, переважна більшість американців підтримують надання Україні зброї для захисту від Росії та вважають, що така допомога демонструє Китаю та іншим суперникам США бажання захищати інтереси та союзників США.",
		"https://www.reuters.com/world/most-americans-support-us-arming-ukraine-reutersipsos-2023-06-28/"
	],
	[
		"2023-06-28",
		"Switzerland has vetoed a plan to export nearly 100 mothballed Leopard battle tanks to Ukraine. The tanks have never been in service in Switzerland, were never intended for use by the Swiss military and are not based in the country. All 96 are stored in Italy, having been acquired in 2016 from the Italian military in a private transaction by the Swiss arms manufacturer Ruag.",
		"Швейцарія наклала вето на експорт в Україну майже 100 законсервованих бойових танків Leopard. Танки ніколи не були на озброєнні в Швейцарії, ніколи не призначалися для використання швейцарськими військовими і не базуються в країні. Усі 96 зберігаються в Італії, вони були придбані у 2016 році в італійських військових у приватній угоді швейцарським виробником зброї Ruag.",
		"https://www.ft.com/content/f33417b0-89a6-4212-a052-41da96f75234"
	],
	[
		"2023-06-28",
		"Lithuania has announced procurement of two Norwegian-made National Advanced Surface-to-Air Missile System (NASAMS) medium-range  air defense launchers for Ukraine to protect civil infrastructure. The deal is valued $9.8 mlm.",
		"Литва оголосила про закупівлю для України двох норвезьких пускових установок середньої дальності (National Advanced Surface-to-Air Missile System - NASAMS) для захисту цивільної інфраструктури. Вартість угоди становить 9,8 млн доларів.",
		"https://twitter.com/Lithuanian_MoD/status/1673956862042030081?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1673956862042030081%7Ctwgr%5Eb2eddf126103f065d35f8ed88afb419e253ecd76%7Ctwcon%5Es1_c10&ref_url=https%3A%2F%2Feurasiantimes.com%2Fcurious-case-of-nasams-lithuania-to-buy-air-defense-systems%2F"
	],
	[
		"2023-06-27",
		"The Defense Department announced an additional security assistance package of up to $500 million. The package includes additional armored vehicles, antiarmor systems and critical munitions for U.S.-provided Patriot air defense systems and High Mobility Artillery Rocket Systems among other items.",
		"Міністерство оборони США оголосило про додатковий пакет допомоги у сфері безпеки на суму до 500 мільйонів доларів. Пакет включає додаткову бронетехніку, протитанкові системи та боєприпаси для наданих США систем протиповітряної оборони Patriot і високомобільних артилерійських ракетних систем.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3441398/pentagon-announces-500m-in-security-assistance-for-ukraine/"
	],
	[
		"2023-06-26",
		"The Australian government will provide a new A$110 million ($73.5 million) package to Ukraine. It includes 28 M113 armoured vehicles, 14 special operations vehicles, 28 medium trucks and 14 trailers.",
		"Уряд Австралії надасть Україні новий пакет допомоги на 110 мільйонів австралійських доларів. Він включає 28 броньованих машин М113, 14 машин спеціального призначення, 28 середніх вантажівок і 14 причепів.",
		"https://www.reuters.com/world/europe/australia-provide-74-million-assistance-package-ukraine-2023-06-26/"
	],
	[
		"2023-06-26",
		"The Bulgarian government has approved a new military aid package for Ukraine. The cabinet’s approval comes in accordance with a December 2022 parliamentary vote. The details of both aid packages remain classified.",
		"Уряд Болгарії затвердив новий пакет військової допомоги Україні. Схвалення Кабінету міністрів відбулося відповідно до парламентського голосування в грудні 2022 року. Деталі обох пакетів допомоги залишаються засекреченими.",
		"https://www.rferl.org/a/bulgaria-approves-military-aid-ukraine/32476806.html"
	],
	[
		"2023-06-26",
		"Germany will send 45 more Gepard anti-aircraft systems to Ukraine this year",
		"Цього року Німеччина надішле Україні ще 45 зенітних систем Gepard",
		"https://www.thedefensepost.com/2023/06/26/germany-gepard-ukraine/"
	],
	[
		"2023-06-26",
		"Rheinmetall Sending 20 Additional Marder Infantry Vehicles to Ukraine",
		"Rheinmetall відправляє в Україну 20 додаткових машин піхоти Marder",
		"https://www.thedefensepost.com/2023/06/26/rheinmetall-marder-vehicles-ukraine/"
	]
]