[
	[
		"2025-02-08",
		"Lithuania has donated trucks and spare parts for American M113 armored personnel carriers to the Ukrainian Defense Forces.",
		"Литва передала Збройним силам України вантажівки та запчастини до американських бронетранспортерів М113.",
		"https://mil.in.ua/en/news/lithuania-donates-trucks-and-spare-parts-for-armored-personnel-carriers-to-ukraine/"
	],
	[
		"2025-02-08",
		"Bulgaria stands to receive about €500 million from its military support to Ukraine over the past three years. Sofia benefited from about €300 million in compensation from the United States and the European Commission for sending Soviet-era military hardware to Kyiv. It also received €174 million from Denmark as part of two contracts to support Ukraine’s military in its struggle against the Russian invasion.",
		"Болгарія може отримати близько 500 мільйонів євро від військової підтримки України за останні три роки. Софія отримала близько 300 мільйонів євро компенсації від США та Європейської комісії за відправку до Києва військової техніки радянських часів. Вона також отримала 174 мільйони євро від Данії в рамках двох контрактів на підтримку українських військових у боротьбі проти російського вторгнення.",
		"https://www.telegraph.co.uk/world-news/2025/02/07/bulgaria-to-make-500m-from-military-aid-to-ukraine/"
	],
	[
		"2025-02-07",
		"Ukraine’s air force has received F-16s from the Netherlands.",
		"Військово-повітряні сили України отримали винищувачі F-16 від Нідерландів.",
		"https://edition.cnn.com/2025/02/07/europe/ukraine-france-mirage-fighter-jets-intl-hnk-ml/index.html"
	],
	[
		"2025-02-06",
		"Ukraine received the first Mirage 2000 fighter jets from France.",
		"Україна отримала перші винищувачі Mirage 2000 від Франції.",
		"https://www.defensenews.com/global/europe/2025/02/06/ukraine-receives-first-mirage-2000-fighter-jets-from-france/"
	],
	[
		"2025-02-06",
		"A majority of German citizens support providing military assistance to Ukraine, with a significant portion advocating for increased aid, according to a new poll by the Wahlen research group.",
		"Більшість громадян Німеччини підтримують надання військової допомоги Україні, причому значна частина виступає за її збільшення, згідно з новим опитуванням, проведеним дослідницькою групою Wahlen.",
		"https://kyivindependent.com/majority-of-germans-support-military-aid-to-ukraine-survey-shows/"
	],
	[
		"2025-01-31",
		"Finland has provided Ukraine with its 27th military aid package, totaling 198 million euros.",
		"Фінляндія надала Україні 27-й пакет військової допомоги на загальну суму 198 мільйонів євро.",
		"https://odessa-journal.com/ukraine-will-receive-a-new-aid-package-from-finland-worth-nearly-200-million-euros"
	],
	[
		"2025-01-31",
		"Ukraine to ratify a defense agreement with the UK, securing £2 billion for air defense, missile systems, and military repair bases.",
		"Україна ратифікує оборонну угоду з Великою Британією, що передбачає виділення 2 мільярдів фунтів стерлінгів на протиповітряну оборону, ракетні системи та військові ремонтні бази.",
		"https://odessa-journal.com/the-united-kingdom-is-allocating-2-billion-in-military-aid-to-ukraine"
	],
	[
		"2025-01-30",
		"Sweden will provide Ukraine with a military aid package worth over $1.2 billion.",
		"Швеція надасть Україні пакет військової допомоги на суму понад $1,2 млрд.",
		"https://kyivindependent.com/sweden-unveils-its-largest-military-aid-package-for-ukraine-worth-1-2-billion/"
	],
	[
		"2025-01-30",
		"Germany’s budget committee has called Finance Minister Joerg Kukies to approve an additional €3 billion in military aid for Ukraine.",
		"Бюджетний комітет Німеччини закликав міністра фінансів Йорга Кукіса затвердити додаткові 3 мільярди євро військової допомоги для України.",
		"https://mil.in.ua/en/news/bundestag-calls-for-additional-e3-billion-for-military-aid-to-ukraine/"
	],
	[
		"2025-01-29",
		"Croatia will provide Ukraine with a new package of military and technical assistance.",
		"Хорватія надасть Україні новий пакет військово-технічної допомоги.",
		"https://mil.in.ua/en/news/croatia-is-preparing-a-military-aid-package-for-ukraine/"
	],
	[
		"2025-01-29",
		"The United States has transferred around 90 Patriot missiles from storage in Israel to Poland for delivery to Ukraine.",
		"Сполучені Штати передали близько 90 ракет Patriot зі сховища в Ізраїлі до Польщі для доставки в Україну.",
		"https://kyivindependent.com/us-transfers-90-patriot-missiles-from-israel-to-ukraine-axios-reports/"
	],
	[
		"2025-01-28",
		"The Italian parliament's lower house on Jan. 28 approved the prolongation of military support for Ukraine until Dec. 31, 2025.",
		"Нижня палата італійського парламенту 28 січня схвалила продовження військової підтримки України до 31 грудня 2025 року.",
		"https://kyivindependent.com/italian-parliament-approves-extension-of-military-assistance-to-ukraine-in-2025/"
	],
	[
		"2025-01-24",
		"Canada's $440 million Ukraine aid package was approved by Parliament.",
		"Парламент схвалив пакет допомоги Україні на суму 440 мільйонів доларів",
		"https://www.thecanadianpressnews.ca/fact_checking/canadas-440-million-ukraine-aid-package-was-approved-by-parliament-despite-claims-to-the-contrary/article_c1a96118-96a5-5f7f-884e-0f34b5c11d9a.html"
	],
	[
		"2025-01-23",
		"Ukraine and Sweden agreed to sign a bilateral agreement on cooperation between companies in the defense industry.",
		"Україна та Швеція домовилися підписати двосторонню угоду щодо співпраці компаній в сфері ОПК.\n",
		"https://mod.gov.ua/news/ukrayina-ta-shvecziya-domovilisya-pidpisati-dvostoronnyu-ugodu-shhodo-spivpraczi-kompanij-v-sferi-opk"
	],
	[
		"2025-01-20",
		"Lithuania announced that the country is sending a new military aid package to Ukraine complete with drones and other weapons.",
		"Литва оголосила, що надсилає Україні новий пакет військової допомоги, який включає безпілотники та інше озброєння.",
		"https://www.msn.com/en-us/politics/government/nato-ally-sends-new-aid-package-to-ukraine/ar-AA1xAaLs"
	],
	[
		"2025-01-17",
		"Ukraine will receive 15 Gravehawk ground-based air defense system from the UK.",
		"Україна отримає від Великої Британії 15 наземних комплексів протиповітряної оборони Gravehawk.",
		"https://thedefensepost.com/2025/01/17/uk-air-defense-ukraine/"
	],
	[
		"2025-01-17",
		"The UK government has announced an unprecedented £4.5 billion military aid package for Ukraine. This includes a £3 billion commitment for lethal aid in 2025. Additionally, £1.5 billion from a £2.26 billion G7 loan, to be repaid using profits from immobilised Russian sovereign assets, will fund procurement projects critical to Ukraine’s defence efforts.",
		"Уряд Великої Британії оголосив про безпрецедентний пакет військової допомоги Україні у розмірі 4,5 млрд фунтів стерлінгів. Це включає 3 мільярди фунтів стерлінгів на летальну допомогу у 2025 році. Крім того, 1,5 мільярда фунтів стерлінгів з кредиту G7 у розмірі 2,26 мільярда фунтів стерлінгів, який буде погашено за рахунок прибутків від іммобілізованих російських суверенних активів, підуть на фінансування проектів закупівель, критично важливих для оборонних зусиль України.",
		"https://ukdefencejournal.org.uk/uk-unveils-massive-military-aid-package-for-ukraine-in-2025/"
	],
	[
		"2025-01-12",
		"Annalena Baerbock, German Foreign Minister and co-leader of the Greens, insists that Berlin should provide Ukraine with more military aid than currently planned in the budget.",
		"Анналена Бербок, міністр закордонних справ Німеччини та співголова партії Зелених, наполягає на тому, що Берлін повинен надати Україні більше військової допомоги, ніж зараз заплановано в бюджеті.",
		"https://www.pravda.com.ua/eng/news/2025/01/12/7493144/"
	],
	[
		"2025-01-12",
		"Germany will deploy two Patriot air defense systems in Poland to protect the logistics center of international military assistance to Ukraine.",
		"Німеччина розмістить у Польщі два комплекси ППО Patriot для захисту логістичного центру міжнародної військової допомоги Україні.",
		"https://mil.in.ua/en/news/germany-to-deploy-patriot-air-defense-systems-in-poland-to-protect-aid-center-for-ukraine/"
	],
	[
		"2025-01-12",
		"Ukraine will receive 30,000 new surveillance and attack drones as part of a multinational initiative jointly led by Latvia and the United Kingdom.",
		"Україна отримає 30 000 нових розвідувальних і ударних безпілотників в рамках багатонаціональної ініціативи, яку спільно очолюють Латвія і Велика Британія.",
		"https://www.aviacionline.com/international-support-grows-ukraine-to-receive-advanced-drones-and-defense-funds"
	]
]