[
	[
		"2024-11-30",
		"Luxembourg has allocated €80 million for Ukrainian weapon production. The allocated funds are expected to fuel the production of Ukrainian drones, surveillance systems, and electronic warfare tools by 2025. ",
		"Люксембург виділив 80 мільйонів євро на виробництво української зброї. Очікується, що виділені кошти підуть на виробництво українських безпілотників, систем спостереження та засобів радіоелектронної боротьби до 2025 року. ",
		"https://bulgarianmilitary.com/2024/11/30/small-nation-big-impact-luxembourg-pledges-e80m-for-ukraine-weapons/"
	],
	[
		"2024-11-29",
		"European Parliament has adopted a resolution which ask the EU and its member states to strengthen their military support for Ukraine, including through the provision of aircraft, long-range missiles, including Taurus missiles, modern air defence systems, including Patriots and SAMP/T and ammunition, as well as MANPADS (Man-Portable Air-Defence Systems), artillery and training programmes for Ukrainian forces. All EU member states and NATO allies should commit to supporting Ukraine militarily, both collectively and individually, with no less than 0.25% of their GDP annually, the resolution says . ",
		"Європейський парламент ухвалив резолюцію, в якій просить ЄС та його держави-члени посилити військову підтримку України, в тому числі шляхом надання літаків, ракет дальнього радіусу дії, включаючи ракети «Таурус», сучасних систем протиповітряної оборони, включаючи «Патріоти» і SAMP/T та боєприпасів, а також ПЗРК (переносні зенітно-ракетні комплекси), артилерії та тренувальних програм для українських сил. Усі країни-члени ЄС і союзники по НАТО повинні взяти на себе зобов'язання підтримувати Україну у військовому плані, як колективно, так і індивідуально, виділяючи на це не менше 0,25% свого ВВП щорічно, йдеться в резолюції.",
		"https://www.europarl.europa.eu/news/en/press-room/20241121IPR25543/more-military-support-for-ukraine-amid-the-involvement-of-china-and-north-korea"
	],
	[
		"2024-11-28",
		"Ukrainian army has received 3 Patriot launchers from Netherlands.",
		"Українська армія отримала 3 пускові установки Patriot від Нідерландів.",
		"https://x.com/DefensieMin/status/1862052642538565821"
	],
	[
		"2024-11-28",
		"The heads of government of Denmark, Estonia, Finland, Latvia, Norway, Poland, and Sweden issued a joint statement in which they assured of increased military assistance for Ukraine in the coming months.",
		"Глави урядів Данії, Естонії, Фінляндії, Латвії, Норвегії, Польщі, Швеції та Фінляндії виступили зі спільною заявою, в якій запевнили про збільшення військової допомоги Україні в найближчі місяці.",
		"https://mil.in.ua/en/news/seven-european-countries-pledge-to-increase-military-assistance-for-ukraine/"
	],
	[
		"2024-11-28",
		"The South Korean government did not express interest in supplying weapons and weapons components during a meeting with Defense Minister Rustem Umierov in Seoul.",
		"Уряд Південної Кореї не висловив зацікавленості у постачанні зброї та збройових компонентів під час зустрічі з міністром оборони Рустемом Умєровим у Сеулі.",
		"https://mil.in.ua/en/news/south-korea-refuses-to-sell-arms-to-ukraine/"
	],
	[
		"2024-11-26",
		"Germany will supply Ukraine with two additional IRIS-T air defense systems, including the medium-range SLM and short-range SLS models, by the end of the year.",
		"До кінця року Німеччина поставить Україні дві додаткові системи протиповітряної оборони IRIS-T, включаючи моделі середньої дальності SLM і малої дальності SLS.",
		"https://kyivindependent.com/germany-to-deliver-2-iris-t-air-defense-systems-to-ukraine-by-years-end-ministry-says/"
	],
	[
		"2024-11-23",
		"West should 'not set red lines' on providing military support for Ukraine, French foreign minister says",
		"Захід не повинен «встановлювати червоні лінії» щодо надання військової підтримки Україні, - міністр закордонних справ Франції.",
		"https://kyivindependent.com/west-should-not-set-red-lines-on-providing-military-support-for-ukraine-french-foreign-minister-says/"
	],
	[
		"2024-11-23",
		"Canada's Department of National Defence (DND) announced that a donation of a National Advanced Surface-to-Air Missile System (NASAMS) had arrived to Ukraine.",
		"Міністерство національної оборони Канади (DND) оголосило про те, що в Україну прибув новітній зенітно-ракетний комплекс NASAMS.",
		"https://www.canada.ca/en/department-national-defence/news/2024/11/canadas-donation-of-new-air-defence-system-arrives-in-ukraine.html"
	],
	[
		"2024-11-21",
		"The UK government is exploring the possibility of repurposing decommissioned military equipment for use by Ukraine, Defence Secretary John Healey revealed in Parliament.",
		"Уряд Великої Британії вивчає можливість перепрофілювання списаної військової техніки для використання в Україні, повідомив у парламенті міністр оборони Джон Хілі.",
		"https://ukdefencejournal.org.uk/uk-may-send-retired-military-equipment-to-aid-ukraine/"
	],
	[
		"2024-11-21",
		"George Simion, who heads the Alliance for the Unity of Romanians, said he would halt military aid to Ukraine if he becomes the president. ",
		"Джордже Сіміон, який очолює Альянс за єдність румунів, заявив, що припинить військову допомогу Україні, якщо стане президентом. ",
		"https://www.livemint.com/companies/news/romanian-ultra-nationalist-presidential-hopeful-vows-to-end-military-aid-to-kyiv-11732166608010.html"
	],
	[
		"2024-11-20",
		"Defense Minister of UK is asking for more military aid for Ukraine’s defense.",
		"Міністр оборони Великої Британії просить більше військової допомоги для оборони України.",
		"https://tribune.com.pk/multimedia/videos/2255134"
	],
	[
		"2024-11-20",
		"The U.S. is sending a new round of military assistance, valued at up to $275 million to Ukraine",
		"США направляють Україні новий раунд військової допомоги на суму до 275 мільйонів доларів",
		"https://www.defense.gov/News/News-Stories/Article/Article/3972848/austin-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2024-11-19",
		"The UK will provide to Ukraine £7.5 million for new attack and surveillance drones.",
		"Велика Британія надасть Україні 7,5 млн фунтів стерлінгів на нові ударні та розвідувальні безпілотники.",
		"https://www.msn.com/en-us/news/world/uk-announces-7-5m-in-military-aid-for-ukraine-on-1000th-day-of-war/ar-AA1uk8nF"
	],
	[
		"2024-11-17",
		"Estonia's cabinet approved a proposal to deliver another package of military aid for Ukraine. The latest aid package will include an unspecified amount of munitions and military equipment, including naval uniforms, observation equipment, sights, and protective equipment. It was not immediately clear as to when the package is expected to arrive in Ukraine.",
		"Уряд Естонії схвалив пропозицію про надання чергового пакету військової допомоги Україні. Останній пакет допомоги включатиме невизначену кількість боєприпасів і військового обладнання, в тому числі військово-морську форму, прилади спостереження, приціли і захисне спорядження. Не відразу було зрозуміло, коли очікується прибуття цієї допомоги в Україну.",
		"https://www.msn.com/en-us/news/world/estonia-approves-delivery-of-additional-military-aid-package-for-ukraine/ar-AA1udJO7"
	],
	[
		"2024-11-16",
		"A Czech company STV GROUP has handed over a symbolic cheque for RPG-7 anti-tank rocket launchers for the Ukrainian Defence Forces. The weapons cost is EUR 765,000.",
		"Чеська компанія STV GROUP передала символічний чек на протитанкові ракетні комплекси РПГ-7 для Збройних сил України. Вартість зброї становить 765 000 євро.",
		"https://t.me/Ukraine_MFA/4184"
	],
	[
		"2024-11-16",
		"President Volodymyr Zelenskyy has stated that Ukraine has not received even half of the weapons officially allocated by the United States and that Europe has helped Ukraine just as much as the US.",
		"Президент Володимир Зеленський заявив, що Україна не отримала навіть половини зброї, офіційно виділеної Сполученими Штатами, і що Європа допомогла Україні не менше, ніж США.",
		"https://www.yahoo.com/news/ukraine-not-received-half-us-084014198.html"
	],
	[
		"2024-11-14",
		"Deputy Pentagon press secretary Sabrina Singh neither confirmed nor denied that Ukraine will receive all $7 bln. weapons till the end of the year, as President Biden has promised.",
		"Заступник прес-секретаря Пентагону Сабріна Сінгх не підтвердила, але й не спростувала, що Україна отримає всі $7 млрд зброї до кінця року, як обіцяв президент Байден.",
		"https://www.defense.gov/News/Transcripts/Transcript/Article/3965597/deputy-pentagon-press-secretary-sabrina-singh-holds-a-press-briefing/"
	],
	[
		"2024-11-10",
		"Biden's administration has allowed defense contractors to work within Ukraine to assist with the maintenance and repair of military equipment like F-16 fighter jets and Patriot air defense systems. ",
		"Адміністрація Байдена дозволила оборонним підрядникам працювати в Україні для надання допомоги в обслуговуванні та ремонті військової техніки, такої як винищувачі F-16 та системи протиповітряної оборони Patriot. ",
		"https://www3.nhk.or.jp/nhkworld/en/news/20241109_12/"
	],
	[
		"2024-11-09",
		"In response to stepped-up Russian drone and missile attacks, the Pentagon is sending to Ukraine more than 500 interceptors for the Patriot missile defense system and the National Advanced Surface-to-Air Missile System, or NASAMS, which are expected to arrive in the weeks ahead, according to a senior administration official.",
		"У відповідь на посилення російських безпілотних і ракетних атак Пентагон відправляє в Україну понад 500 перехоплювачів для системи протиракетної оборони «Патріот» і Національної вдосконаленої протиракетної системи «земля-повітря» (NASAMS), які, як очікується, прибудуть в найближчі тижні, за словами високопоставленого представника адміністрації.",
		"https://www.wsj.com/politics/national-security/u-s-struggles-to-rush-weapons-to-ukraine-before-trump-takes-office-dfabb1fd"
	],
	[
		"2024-11-08",
		"The Biden administration has confirmed that the US will keep surging aid to Ukraine before Donald Trump becomes president in January.",
		"Адміністрація Байдена підтвердила, що США продовжуватимуть збільшувати допомогу Україні до того, як Дональд Трамп стане президентом у січні.",
		"https://www.theguardian.com/world/2024/nov/08/ukraine-war-briefing-biden-administration-confirms-surge-of-military-aid-to-kyiv-will-continue"
	],
	[
		"2024-11-08",
		"Germany will be able to provide most of the €4 billion promised to Ukraine for military support, even if the 2025 budget is not approved in time after the collapse of the coalition government.",
		"Німеччина зможе надати більшу частину з обіцяних Україні 4 мільярдів євро на військову підтримку, навіть якщо бюджет на 2025 рік не буде вчасно затверджений після розпаду коаліційного уряду.",
		"https://mil.in.ua/en/news/reuters-germany-to-provide-promised-aid-to-ukraine-in-2025-despite-coalition-collapse/"
	],
	[
		"2024-11-07",
		"The leader of the Free Democratic Party (FDP), Christian Lindner, has accused German Chancellor Olaf Scholz of obstructing effective military support for Ukraine.",
		"Лідер Вільної демократичної партії (ВДП) Крістіан Лінднер звинуватив канцлера Німеччини Олафа Шольца у перешкоджанні ефективній військовій підтримці України.",
		"https://defence-blog.com/fdps-lindner-scholz-denied-crucial-ukraine-military-support/"
	],
	[
		"2024-11-05",
		"Australia will donate 14 rigid hull boats to Ukraine to strengthen its maritime and coastal defense.",
		"Австралія передасть Україні 14 катерів з жорстким корпусом для посилення морської та берегової оборони.Carnation",
		"https://mil.in.ua/en/news/australia-to-transfer-14-boats-to-ukraine/"
	],
	[
		"2024-11-03",
		"The price of a Russian victory will be times higher for Germany than helping Ukraine win over Russia in the ongoing war. This was assessed by economists from the Kiel Institute of World Economy (IfW Kiel).",
		"Ціна перемоги Росії буде в рази вищою для Німеччини, ніж допомога Україні у перемозі над Росією у війні, що триває. Таку оцінку дали економісти з Кільського інституту світової економіки (IfW Kiel).",
		"https://www.ukrinform.net/rubric-economy/3922836-russian-victory-would-cost-germany-10-to-20-times-more-than-aid-to-ukraine-german-experts.html"
	],
	[
		"2024-11-03",
		"Canada provided 13 off-road vehicles with demining equipment to the Ukrainian National Special Transport Service.",
		"Канада надала 13 позашляховиків з обладнанням для розмінування Державній спеціальній службі транспорту України.",
		"https://rubryka.com/en/2024/10/31/rishennya-dlya-peremogy-kanady-nadala-ukrayini-partiyu-pikapiv-z-obladnannyam-dlya-rozminuvannya/"
	]
]