[
	[
		"2024-05-05",
		"The US Government is in negotiations with other G7 countries to provide Ukraine with $50 bln. support package which will be financed mostly from the frozen Russian assets.",
		"Уряд США веде переговори з іншими країнами \"Великої сімки\" про надання Україні пакету підтримки на суму 50 млрд доларів, який буде фінансуватися переважно за рахунок заморожених російських активів.",
		"https://www.bloomberg.com/news/articles/2024-05-03/g-7-eyes-plan-on-us-led-50-billion-aid-package-for-ukraine"
	],
	[
		"2024-05-04",
		"The Commander of the Estonian Defence Forces suggested preparing for a possible blockade of the Baltic Sea for Russia.",
		"Командувач Сил оборони Естонії запропонував готуватися до можливої блокади Балтійського моря для Росії.",
		"https://mil.in.ua/en/news/estonia-proposes-to-blockade-the-baltic-sea-for-russia/"
	],
	[
		"2024-05-03",
		"British Foreign Secretary David Cameron promised three billion pounds ($3.74 billion) of annual military aid for Ukraine for \"as long as it takes\", adding that London had no objection to the weapons being used inside Russia.",
		"Міністр закордонних справ Великобританії Девід Кемерон пообіцяв три мільярди фунтів стерлінгів ($3,74 млрд) щорічної військової допомоги Україні \"стільки, скільки буде потрібно\", додавши, що Лондон не заперечує проти використання зброї всередині Росії.",
		"https://www.reuters.com/world/uk/britains-cameron-kyiv-promises-ukraine-aid-as-long-it-takes-2024-05-02/"
	],
	[
		"2024-05-03",
		"Ukraine’s president and foreign minister have pressed British Foreign Secretary David Cameron to accelerate the delivery of promised military aid to Kyiv.",
		"Президент і міністр закордонних справ України закликали міністра закордонних справ Великої Британії Девіда Кемерона прискорити надання Києву обіцяної військової допомоги.",
		"https://www.irishexaminer.com/world/arid-41387779.html"
	],
	[
		"2024-05-03",
		"The Italian government has included an additional battery of the SAMP/T air defense system in the new military aid package for Ukraine.",
		"Уряд Італії включив додаткову батарею системи протиповітряної оборони SAMP/T до нового пакету військової допомоги Україні.",
		"https://mil.in.ua/en/news/italy-plans-to-provide-ukraine-with-additional-samp-t-air-defense-systems/"
	],
	[
		"2024-05-02",
		"French President Emmanuel Macron said he has not ruled out sending ground troops to Ukraine if Russia breaks through Ukrainian front lines and the government in Kyiv made such a request.",
		"Президент Франції Еммануель Макрон заявив, що не виключає введення сухопутних військ в Україну, якщо Росія прорве українську лінію фронту і уряд у Києві звернеться з таким проханням.",
		"https://ca.news.yahoo.com/nato-country-said-could-join-112923689.html"
	],
	[
		"2024-04-30",
		"Norway has made a decision to allocate an additional $600 million to support Ukraine.",
		"Норвегія прийняла рішення про виділення додаткових 600 мільйонів доларів на підтримку України.",
		"https://x.com/ZelenskyyUa/status/1785340280926806342"
	],
	[
		"2024-04-30",
		"The government of Latvia has just approved the transfer of NBS anti-aircraft guns, tactical unmanned surveillance systems, as well as other essential material and technical assets to the Armed Forces of Ukraine.",
		"Уряд Латвії щойно схвалив передачу Збройним силам України зенітних гармат NBS, тактичних безпілотних систем спостереження, а також інших необхідних матеріально-технічних засобів.",
		"https://x.com/DefenceU/status/1785303619622883330"
	],
	[
		"2024-04-28",
		"A former us Lt and military expert has warned that Russia will “win” the war and it is “almost impossible for Ukraine to win.”",
		"Колишній американський лейтенант і військовий експерт попередив, що Росія \"виграє\" війну, а Україні \"майже неможливо перемогти\".",
		"https://londonlovesbusiness.com/us-military-expert-warns-its-almost-impossible-for-ukraine-to-win/"
	],
	[
		"2024-04-28",
		"Australia backs Ukraine with $100-mln military aid",
		"Австралія підтримала Україну військовою допомогою на $100 млн",
		"https://www.yahoo.com/news/australia-backs-ukraine-100-mln-071957070.html"
	],
	[
		"2024-04-28",
		"Estonian Center for Defense Investments (RKIK) and the eState Academy will use European Peace Facility resources to procure various nonlethal military equipment for Moldovan armed forces. A contract for passive radars has been signed with a Czech company.",
		"Естонський центр оборонних інвестицій (RKIK) та Академія електронної держави використовуватимуть ресурси Європейського фонду миру для закупівлі різного нелетального військового обладнання для збройних сил Молдови. З чеською компанією було підписано контракт на поставку пасивних радарів.",
		"https://news.err.ee/1609326753/estonia-to-procure-military-equipment-for-moldova-and-ukraine"
	],
	[
		"2024-04-27",
		"The US will \"rush\" Patriot air defense missiles to Ukraine as part of a military aid package, Defense Secretary Lloyd Austin has said.",
		"США \"поспішатимуть\" з ракетами ППО Patriot в Україну в рамках пакету військової допомоги, заявив міністр оборони Ллойд Остін.",
		"https://www.businessinsider.com/us-to-rush-patriot-missiles-to-ukraine-amid-russian-airstrikes-2024-4"
	],
	[
		"2024-04-27",
		"British and American defence pledges for Ukraine should inspire other countries to follow suit, Kaja Kallas, the prime minister of Estonia, has said.",
		"Обіцянки Великої Британії та США щодо підтримки України повинні надихнути інші країни наслідувати їхній приклад, заявила Кая Каллас, прем'єр-міністр Естонії.",
		"https://www.telegraph.co.uk/world-news/2024/04/27/uk-and-us-ukraine-aid-must-inspire-others-says-kaja-kallas/"
	],
	[
		"2024-04-26",
		"The Department of Defense (DoD) announced a historic new security assistance package valued at $6 bln. to address Ukraine's ongoing battlefield needs and demonstrate unwavering U.S. support for Ukraine. This package, provided through the Ukraine Security Assistance Initiative (USAI) includes additional munitions for Patriot air defense systems; additional munitions for National Advanced Surface-to-Air Missile Systems (NASAMS); equipment to integrate Western air defense launchers, missiles, and radars with Ukraine's air defense systems; counter-UAS equipment and systems; munitions for laser-guided rocket systems; multi-mission radars; counter-artillery radars; additional ammunition for High Mobility Artillery Rocket Systems (HIMARS); 155mm and 152mm artillery rounds; precision aerial munitions; Switchblade and Puma Unmanned Aerial Systems (UAS); tactical vehicles to tow weapons and equipment; demolition munitions; components to support Ukrainian production of UAS and other capabilities; small arms and additional small arms ammunition and ancillary items and support for training, maintenance, and sustainment activities.",
		"Міністерство оборони (МО) США оголосило про надання нового історичного пакету допомоги у сфері безпеки на суму 6 млрд. доларів для задоволення поточних потреб України на полі бою та демонстрації непохитної підтримки України з боку США. Цей пакет, що надається в рамках Ініціативи безпекової допомоги Україні (USAI), включає додаткові боєприпаси для систем ППО Patriot; додаткові боєприпаси для національних передових зенітно-ракетних комплексів (NASAMS); обладнання для інтеграції західних пускових установок, ракет і радарів з українськими системами ППО; обладнання та системи протидії БПЛА; боєприпаси для ракетних систем з лазерним наведенням; багатоцільові радіолокаційні станції; контр-артилерійські радіолокаційні станції; додаткові боєприпаси для високомобільних артилерійських ракетних систем (HIMARS); артилерійські снаряди калібру 155 мм і 152 мм; високоточні авіаційні боєприпаси; безпілотні авіаційні комплекси (БАК) Switchblade і Puma; тактичні транспортні засоби для буксирування озброєння і техніки; боєприпаси для підриву; компоненти для підтримки українського виробництва БАК та інших засобів; стрілецька зброя і додаткові боєприпаси до стрілецької зброї, а також допоміжні засоби, підтримка для тренувань, технічного обслуговування і забезпечення діяльності.",
		"https://www.defense.gov/News/Releases/Release/Article/3757794/biden-administration-announces-historic-new-security-assistance-package-for-ukr/"
	],
	[
		"2024-04-25",
		"Poland has provided Ukraine military support worth the equivalent of around €8.4 billion ($9 billion) over the past two years, the government said on Thursday. A total of 44 armaments packages have been handed over to Kiev, said Foreign Minister Radosław Sikorski during a keynote speech in the Polish parliament. Poland has provided Ukraine with 300 tanks and combat vehicles, 14 fighter planes, plus helicopters, air defence systems and ammunition, military experts say.",
		"За останні два роки Польща надала Україні військову допомогу на суму, еквівалентну приблизно 8,4 млрд євро (9 млрд доларів), заявив у четвер уряд країни. Загалом Києву було передано 44 пакети озброєнь, заявив міністр закордонних справ Радослав Сікорський під час програмної промови в польському парламенті. Польща надала Україні 300 танків і бойових машин, 14 винищувачів, а також вертольоти, системи протиповітряної оборони і боєприпаси, кажуть військові експерти.",
		"https://www.yahoo.com/news/polands-total-military-aid-ukraine-111427588.html"
	],
	[
		"2024-04-24",
		"The Department of Defense (DoD) announced a significant new security assistance to urgently meet Ukraine's critical security and defense needs. This announcement is the Biden Administration's fifty-sixth tranche of equipment to be provided from DoD inventories to Ukraine since August 2021. This Presidential Drawdown Authority (PDA) package has an estimated value of $1 billion and includes air defense interceptors, artillery rounds, armored vehicles, and anti-tank weapons. ",
		"Міністерство оборони (МО) США оголосило про нову значну допомогу у сфері безпеки для термінового задоволення критично важливих потреб України у сфері безпеки та оборони. Це оголошення є п'ятдесят шостим траншем обладнання, яке адміністрація Байдена надасть Україні з запасів Міністерства оборони, починаючи з серпня 2021 року. Цей пакет, наданий в рамках президентського рішення про скорочення озброєнь (PDA), оцінюється в 1 мільярд доларів і включає перехоплювачі протиповітряної оборони, артилерійські снаряди, бронемашини та протитанкову зброю.",
		"https://www.defense.gov/News/Releases/Release/Article/3754238/biden-administration-announces-significant-new-security-assistance-for-ukraine/"
	],
	[
		"2024-04-24",
		"The German chancellor says Europe must continue to step up its help for Ukraine even after the approval of a big U.S. aid package.",
		"Канцлер Німеччини заявила, що Європа повинна продовжувати нарощувати допомогу Україні навіть після схвалення великого пакету допомоги від США.",
		"https://abcnews.go.com/International/wireStory/german-leader-europe-increasing-aid-ukraine-after-us-109574795"
	],
	[
		"2024-04-24",
		"Defense minister of Spain Margarita Robles has participated in Ukraine Defence Contact Group meeting, where she announced that the shipment the day before yesterday has a set of hospital medicines and individual combat first aid kits. He also reported the delivery, a new consignment of heavy caliber artillery ammunition, followed by other shipments of 155 and 120 mm ammunition the next months. The minister has especially stopped at the Spanish contribution to anti-aircraft defense, announcing the dispatch of a long-range Patriot anti-aircraft interceptor missile set that will arrive at the logistics base within four days. In addition, the Spanish aid planned for the next two months includes light and heavy machine guns, wheeled protected logistics vehicles, infantry armored vehicles, tank weapons and field artillery shells. These shipments will be followed by the supply of various anti-aircraft surveillance systems and remote weapons stations for drone defense, systems that are being prepared by the Spanish defense industry.",
		"Міністр оборони Іспанії Маргарита Роблес взяла участь у засіданні Контактної групи з питань оборони України, де повідомила, що позавчорашня партія вантажу містила набір лікарняних медикаментів та індивідуальні бойові аптечки першої допомоги. Він також повідомив про доставку нової партії артилерійських боєприпасів великого калібру, за якою в найближчі місяці очікуються інші поставки боєприпасів калібру 155 та 120 мм. Міністр особливо зупинився на іспанському внеску в протиповітряну оборону, оголосивши про відправку комплексу зенітних ракет-перехоплювачів \"Патріот\" великої дальності, який прибуде на базу матеріально-технічного забезпечення протягом чотирьох днів. Крім того, іспанська допомога, запланована на наступні два місяці, включає легкі і важкі кулемети, колісні захищені транспортні засоби матеріально-технічного забезпечення, піхотні броньовані машини, танкове озброєння і снаряди для польової артилерії. За цими поставками послідує постачання різних систем протиповітряного спостереження і дистанційних станцій озброєння для захисту від безпілотників - систем, які готуються іспанською оборонною промисловістю.",
		"https://www.defensa.gob.es/gabinete/notasPrensa/2024/04/DGC-240426-reunion-grupo-contacto-ucrania.html"
	],
	[
		"2024-04-23",
		"The UK will provide an additional £500m to Kyiv on top of the £2.5bn allocated for this financial year.",
		"Великобританія надасть Києву додаткові 500 млн фунтів стерлінгів до 2,5 млрд фунтів стерлінгів, виділених на цей фінансовий рік.",
		"https://www.bbc.com/news/uk-politics-68878627"
	],
	[
		"2024-04-20",
		"The House is preparing in a rare Saturday session to approve $95 billion in foreign aid for Ukraine, Israel and other U.S. allies",
		"Палата представників готується на рідкісній суботній сесії затвердити $95 млрд зовнішньої допомоги для України, Ізраїлю та інших союзників США",
		"https://abcnews.go.com/US/wireStory/house-brink-approving-ukraine-israel-aid-after-months-109451608"
	],
	[
		"2024-04-20",
		"The House has passed a $95 billion package providing foreign aid for Ukraine, Israel and the Indo-Pacific region.",
		"Палата представників ухвалила пакет на 95 мільярдів доларів, що передбачає надання зовнішньої допомоги Україні, Ізраїлю та Індо-Тихоокеанському регіону.",
		"https://edition.cnn.com/videos/politics/2024/04/20/ukraine-aid-vote-passes-house-digvid.cnn"
	]
]