[
	[
		"2023-11-03",
		"The Department of Defense announced additional security assistance which includes the drawdown of security assistance from DoD inventories valued at up to $125 million to meet Ukraine's immediate battlefield needs, as well as $300 million in Ukraine Security Assistance Initiative (USAI) funds to strengthen Ukraine's air defenses over the long term. The 50th PDA package includes additional air defense capabilities, artillery ammunition, anti-tank weapons, and other equipment. Under USAI, the DoD will provide Ukraine with laser-guided munitions to counter Unmanned Aerial Systems.",
		"Міністерство оборони США оголосило про додаткову допомогу у сфері безпеки, яка включає вилучення допомоги з безпеки із запасів Міністерства оборони вартістю до 125 мільйонів доларів США для задоволення негайних потреб України на полі бою, а також 300 мільйонів доларів США в рамках Ініціативи сприяння безпеці України (USAI) для зміцнення повітряної безпеки України. захист протягом тривалого часу. У комплект 50-го КПК входять додаткові засоби протиповітряної оборони, артилерійські боєприпаси, протитанкова зброя та інше обладнання. Згідно з USAI, Міністерство оборони надасть Україні боєприпаси з лазерним наведенням для протидії безпілотним літальним системам.",
		"https://www.defense.gov/News/Releases/Release/Article/3578754/biden-administration-announces-new-security-assistance-for-ukraine/"
	],
	[
		"2023-10-29",
		"The Canadian Army has dozens of older armoured personnel carriers it plans to send to the scrapheap this year — even though a private company has offered to refurbish them for use in Ukraine.",
		"У канадської армії є десятки старіших бронетранспортерів, які вона планує відправити на звалище цього року, хоча приватна компанія запропонувала відремонтувати їх для використання в Україні.",
		"https://www.cbc.ca/news/politics/armoured-vehicles-armatec-ukraine-dnd-1.6973154"
	],
	[
		"2023-10-28",
		"Finland is preparing a new aid package for Ukraine to protect critical infrastructure.",
		"Фінляндія готує новий пакет допомоги Україні для захисту критичної інфраструктури.",
		"https://t.me/Klymenko_MVS/418"
	],
	[
		"2023-10-26",
		"Slovakia's new Prime Minister, Robert Fico, announced on Thursday that he would stop delivering arms to Ukraine, limiting support for his neighbour to \"humanitarian and civilian aid\".",
		"Новий прем'єр-міністр Словаччини Роберт Фіцо оголосив, що припинить поставки зброї в Україну, обмеживши підтримку свого сусіда \"гуманітарною та цивільною допомогою\".",
		"https://www.euronews.com/2023/10/26/slovakia-announces-the-end-of-military-aid-to-ukraine"
	],
	[
		"2023-10-26",
		"The Danish government has declared its commitment to providing Ukraine with a new military aid package worth 3.7 billion Danish kroner, which is approximately $520 million.",
		"Уряд Данії заявив про готовність надати Україні новий пакет військової допомоги вартістю 3,7 мільярда датських крон, що становить приблизно 520 мільйонів доларів.",
		"https://defence-blog.com/denmark-to-send-520-million-in-weapons-military-aid-to-ukraine/"
	],
	[
		"2023-10-26",
		"The Department of Defense has announced the 49th drawdown assistance package for Ukraine valued at up to $150 million. It includes air defense equipment, artillery rounds and antitank weapons.",
		"Міністерство оборони США оголосило про 49-й пакет допомоги для України на суму до $150 млн. Це засоби протиповітряної оборони, артилерійські снаряди та протитанкова зброя.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3570190/dod-announces-up-to-150m-in-aid-for-ukraine/"
	],
	[
		"2023-10-25",
		"The Australian Government, with the support of local defence industry, is providing a further $20 million package of military assistance to Ukraine. It includes de-mining equipment, portable x-ray machines, a 3D metal printer, and counter drone systems.",
		"Уряд Австралії за підтримки місцевої оборонної промисловості надає ще один пакет військової допомоги Україні на суму 20 мільйонів доларів. До нього входять обладнання для розмінування, портативні рентгенівські апарати, 3D-принтер для металу та системи протидронів.",
		"https://www.minister.defence.gov.au/media-releases/2023-10-25/australian-capabilities-continue-supporting-ukraine"
	],
	[
		"2023-10-24",
		"The head of NATO Jens Stoltenberg urged allied states to ramp up production of arms.",
		"Глава НАТО Єнс Столтенберг закликав країни-союзники нарощувати виробництво зброї.",
		"https://www.aa.com.tr/en/europe/natos-stoltenberg-urges-allies-to-ramp-up-production-to-meet-ukraines-needs/3031338"
	],
	[
		"2023-10-24",
		"Contract notified by Belgian Ministry of Defense for the benefit of Ukraine already successfully completed - for the delivery of thousands of 105 mm ammunition for Leopard 1 tanks.",
		"Контракт, нотифікований Міністерством оборони Бельгії на користь України, вже успішно завершився – на поставку тисяч 105-мм боєприпасів для танків Leopard 1.",
		"https://x.com/ForcesOperation/status/1716874613534437530?s=20"
	],
	[
		"2023-10-23",
		"The Council of the European Union has failed to agree on a EUR 500 million ($534 million) tranche of military aid to Ukraine, due to Hungary blocking the motion.",
		"Рада Європейського Союзу не змогла погодити транш військової допомоги Україні в розмірі 500 мільйонів євро через те, що Угорщина заблокувала цю пропозицію.",
		"https://uk.finance.yahoo.com/news/hungary-blocks-534-million-eu-210000273.html"
	],
	[
		"2023-10-22",
		"The head of the lower chamber of the Czech parliament, Marketa Pekarova Adamova, told RFE/RL's Ukrainian Service that Ukraine \"must win the war\" and reestablish control over the Black Sea region of Crimea, which Russia occupied in 2014. She said the West \"definitely made the wrong decision\" with its \"insufficient\" response to Moscow’s seizure of Crimea.",
		"Голова нижньої палати парламенту Чехії Маркета Пекарова Адамова заявила, що Україна «має виграти війну» і відновити контроль над чорноморським регіоном Криму, який Росія окупувала в 2014 році. Вона сказала, що Захід «безумовно прийняв неправильне рішення» своєю «недостатньою» реакцією на захоплення Криму Москвою.",
		"https://www.rferl.org/a/czech-parliament-speaker-reaffirms-support-ukraine/32648883.html"
	],
	[
		"2023-10-20",
		"US President Joe Biden urgently requested military aid for Ukraine and Israel in a massive $106 billion national security package, including $61 billion in military aid for Ukraine and $14 billion for Israel.",
		"Президент США Джо Байден терміново запросив військову допомогу для України та Ізраїлю у масштабному пакеті національної безпеки на 106 мільярдів доларів, включаючи 61 мільярд доларів військової допомоги Україні та 14 мільярдів доларів для Ізраїлю.",
		"https://www.timesofisrael.com/biden-asks-congress-to-okay-14-billion-in-aid-to-israel-61-billion-for-ukraine/"
	],
	[
		"2023-10-20",
		"On Friday, the German government reported on the shipment of another package of military aid to Ukraine over the past week. It includes 3 anti-air Gepard tanks, 1 bridge-layer tank Beaver, 20 RQ-35 Heidrun and 20 Vector reconnaissance drones,  three HX81 tractors with three semi-trailers, 13 border guard vehicles and almost 3,900 DM125 155mm smoke artillery shells.",
		"У п'ятницю уряд Німеччини повідомив про відправку чергового пакету військової допомоги Україні:\n\n- 3 зенітні танки Gepard\n- 1 мостоукладач Beaver\n- 20 безпілотників-розвідників RQ-35 Heidrun\n- 20 розвідників Vector\n\nта інше обладнання.",
		"https://www.bundesregierung.de/breg-en/news/military-support-ukraine-2054992"
	],
	[
		"2023-10-20",
		"The German government informed that the 2023 defense budget of €5.4 billion ($6 bl), along with additional approvals for subsequent years raising the amount to €10.5 billion ($11 bl), is intended to “be directed primarily toward military aid for Ukraine,” but will also help replenish stocks of the German army.",
		"Уряд Німеччини повідомив, що оборонний бюджет на 2023 рік у розмірі 5,4 мільярда євро разом із додатковими схваленнями на наступні роки, які підвищують суму до 10,5 мільярда євро, має на меті «в першу чергу військову допомогу Україні», але також допоможе поповнити запаси німецької армії.",
		"https://euromaidanpress.com/2023/10/20/germany-provides-military-package-including-drones-gepards-to-ukraine/"
	],
	[
		"2023-10-20",
		"Senate Republican Leader Mitch McConnell (R-Ky.) on Friday urged his Senate colleagues to move quickly on legislation to send military aid to Israel and Ukraine and to counter China’s ambitions in the Indo-Pacific. McConnell said the Senate would review the $100 billion emergency spending request Biden sent to Congress Friday and craft its own package “in the coming days.” ",
		"Лідер республіканців у Сенаті Мітч МакКоннелл закликав своїх колег у Сенаті швидко рухатися до закону про надсилання військової допомоги Ізраїлю та Україні та протистояти амбіціям Китаю в Індо-Тихоокеанському регіоні. Макконнелл сказав, що Сенат розгляне запит на екстрені витрати в розмірі 100 мільярдів доларів, надісланий Байденом Конгресу в п’ятницю, і розробить власний пакет «найближчими днями».",
		"https://thehill.com/homenews/senate/4267710-mcconnell-urges-action-spending-israel-ukraine/"
	],
	[
		"2023-10-19",
		"Croatia has provided its all Mi-8 helicopters to Ukraine as part of military assistance.",
		"Хорватія надала всі свої гелікоптери Мі-8 Україні в рамках військової допомоги.",
		"https://www.defense.gov/News/Transcripts/Transcript/Article/3562479/secretary-of-defense-lloyd-j-austin-iii-remarks-welcoming-croatian-defense-mini/"
	],
	[
		"2023-10-18",
		"France will triple production of 155mm ammunition to increase supplies to Ukraine. The French Ministry of Defense said that the increase in ammunition production would allow it to send Ukraine up to 3,000 155-mm shells per month starting in 2024.",
		"Франція втричі збільшить виробництво 155-мм боєприпасів для збільшення поставок в Україну. Міністерство оборони Франції заявило, що збільшення виробництва боєприпасів дозволить відправляти в Україну до 3 тис. 155-мм снарядів на місяць, починаючи з 2024 року.",
		"https://mil.in.ua/en/news/france-triples-shells-production-for-ukraine/"
	],
	[
		"2023-10-17",
		"Ukraine’s military has used US-provided long-range ATACMS missiles for the first time, according to President Volodymyr Zelenskiy, who said they were deployed on the battlefield against Russia and “executed very accurately”.",
		"За словами Президента Володимира Зеленського, українські військові вперше використали надані США ракети великої дальності ATACMS",
		"Ukraine deploys US-supplied ATACMS missiles for first time, Zelenskiy says | Ukraine | The Guardian"
	],
	[
		"2023-10-17",
		"Ukraine’s counteroffensive against Russia is six to nine months behind schedule due to delays in Western weapons deliveries",
		"Контрнаступ України проти Росії відстає від графіка на шість-дев'ять місяців через затримки поставок зброї",
		"https://www.thedefensepost.com/2023/10/17/ukraine-offensive-behind-schedule/"
	],
	[
		"2023-10-17",
		"In a groundbreaking move, the UK Ministry of Defense announced a robust military support package for Ukraine, valued at over £100m ($122 million). Among the military aid to be sent to Ukraine, as confirmed at the Ukraine Defence Contact Group meeting in Brussels, will be around 100 uncrewed aerial systems.",
		"Міністерство оборони Великобританії оголосило про потужний пакет військової підтримки для України вартістю понад 100 мільйонів фунтів стерлінгів (122 мільйони доларів США). Серед військової допомоги Україні, як підтвердили на засіданні Контактної групи з питань оборони України в Брюсселі, буде близько 100 безпілотних літальних комплексів.",
		"https://www.globenewswire.com/news-release/2023/10/17/2761486/28124/en/UK-Ministry-of-Defense-s-Significant-Military-Aid-Package-for-Ukraine-Bolsters-Importance-of-Unmanned-Aerial-Systems-New-Report-Reveals.html"
	],
	[
		"2023-10-17",
		"Lithuania, in cooperation with the German defense industry, has started repairing Ukrainian Leopard tanks.",
		"Литва у співпраці з німецьким ОПК розпочала ремонт українських танків Leopard.",
		"https://mil.in.ua/en/news/lithuania-starts-repairing-ukrainian-leopard-tanks/"
	],
	[
		"2023-10-16",
		"All 31 U.S.-made M1A1 Abrams tanks promised to Kyiv by the Biden administration have arrived in Ukraine, according to the U.S. military.",
		"Усі обіцяні Києву адміністрацією Байдена 31 танк M1A1 Abrams американського виробництва прибули в Україну, повідомляє армія США.",
		"https://www.voanews.com/a/all-31-abrams-tanks-in-ukraine-us-military-confirms-to-voa/7313918.html"
	],
	[
		"2023-10-14",
		"Ukraine is expected to receive high-precision GLSDB (Ground Launched Small Diameter Bomb) already this winter.",
		"Очікується, що Україна отримає високоточні GLSDB (Ground Launched Small Diameter Bomb) вже цієї зими.",
		"https://mil.in.ua/en/news/boeing-reveals-when-ukraine-will-receive-high-precision-glsdb/"
	],
	[
		"2023-10-13",
		"A new survey conducted by the Chicago Council on Global Affairs shows that nearly two-thirds of those polled (63 percent) support sending additional arms and military supplies to Ukraine, and 61 percent support providing economic assistance.",
		"Нове опитування, проведене Чиказькою радою з глобальних справ, показує, що майже дві третини опитаних (63 відсотки) підтримують надсилання додаткового озброєння та військових поставок Україні, а 61 відсоток підтримують надання економічної допомоги.",
		"https://www.politico.eu/article/despite-washington-chaos-americans-still-want-to-support-ukraine/"
	],
	[
		"2023-10-13",
		"The Netherlands will supply to Ukraine extra Patriot missiles for air defense and patrol boats to provide safe grain export.",
		"Нідерланди поставлять Україні додаткові ракети Patriot для ППО та патрульні катери для забезпечення безпечного експорту зерна.",
		"https://x.com/MinPres/status/1712848320694006132?s=20"
	],
	[
		"2023-10-11",
		"The Department of Defense has announced the 48th presidential drawdown authority military aid package for Ukraine valued at $200 mln. It includes air defense capabilities, anti-tank weapons, and other equipment.",
		"Міністерство оборони США оголосило про 48-й пакет військової допомоги Україні за розпорядженням Президента на суму 200 мільйонів доларів. Це засоби протиповітряної оборони, протитанкова зброя та інше обладнання.",
		"https://www.defense.gov/News/Releases/Release/Article/3553644/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-10-11",
		"A new package of military support for Ukraine, worth more than £100m is  announced by the Defence Secretary of the UK. It will include air defense systems MSI-DS Terrahawk Paladin. ",
		"Міністр оборони Великої Британії оголосив про новий пакет військової підтримки для України вартістю понад 100 мільйонів фунтів стерлінгів. До його складу увійдуть системи ППО MSI-DS Terrahawk Paladin.",
		"https://www.gov.uk/government/news/major-new-package-of-support-for-ukraines-counter-offensive-announced-by-grant-shapps"
	],
	[
		"2023-10-10",
		"Germany will provide Ukraine with a new €1 billion ($1.1 billion) military aid package, Defense Minister Boris Pistorius announced on Tuesday.",
		"Німеччина надасть Україні новий пакет військової допомоги на 1 мільярд євро",
		"https://www.aa.com.tr/en/europe/germany-announces-11b-military-aid-package-for-ukraine/3014609"
	],
	[
		"2023-10-10",
		"US senators from both parties intend to pass an annual aid package for Ukraine worth between US$50 billion and US$100 billion in the coming weeks.",
		"Американські сенатори від обох партій мають намір ухвалити щорічний пакет допомоги Україні на суму від 50 до 100 мільярдів доларів США найближчими тижнями.",
		"https://news.yahoo.com/us-senators-seek-pass-annual-225241445.html"
	],
	[
		"2023-10-09",
		"The U.S. Department of Defense wants to simultaneously meet the munitions needs of both Israel and Ukraine.",
		"Міністерство оборони США хоче одночасно задовольнити потреби Ізраїлю та України в боєприпасах.",
		"https://www.reuters.com/world/us-army-chief-says-congress-must-act-ensure-arms-both-israel-ukraine-2023-10-09/"
	]
]