[
	[
		"2024-03-24",
		"The Prime Minister of Lithuania, Ingrid Šimonite, called on Ukraine's Western partners to increase aid to Kyiv and not to be afraid of Russia's defeat in the criminal war unleashed by it.",
		"Прем'єр-міністр Литви Інгрід Шимоніте закликала західних партнерів України збільшити допомогу Києву та не боятися поразки Росії в розв'язаній нею кримінальній війні.",
		"https://news.online.ua/en/in-lithuania-the-scenario-of-ukraines-victory-in-the-war-against-the-russian-federation-was-named-875464/"
	],
	[
		"2024-03-23",
		"Britain will provide Ukraine with a new military aid package worth 60 million pounds, including reconnaissance drones and 20 million pounds for air defense systems.",
		"Британія надасть Україні новий пакет військової допомоги на 60 мільйонів фунтів стерлінгів, включаючи розвідувальні безпілотники та 20 мільйонів фунтів на системи ППО.",
		"https://unn.ua/en/news/britain-to-provide-ukraine-with-a-new-military-aid-package"
	],
	[
		"2024-03-23",
		"The Franco-German tank manufacturer KNDS will create a unit in Ukraine to produce ammunition and spare parts for equipment sent by the two European neighbors.",
		"Франко-німецький виробник танків KNDS створить в Україні підрозділ з виробництва боєприпасів і запчастин для техніки, яку відправляють два європейські сусіди.",
		"https://euromaidanpress.com/2024/03/23/france-germany-allow-tank-manufacturer-knds-to-establish-branch-in-ukraine/"
	],
	[
		"2024-03-22",
		"The first Ukrainian pilots to have undergone intensive training under the guidance of Royal Air Force instructors have graduated from flight school.",
		"Перші українські пілоти, які пройшли інтенсивну підготовку під керівництвом інструкторів Королівських ВПС, закінчили льотну школу.",
		"https://www.gov.uk/government/news/first-ukrainian-pilots-graduate-from-raf-flight-training"
	],
	[
		"2024-03-22",
		"Lithuanian ministry of defense reported that counter-drone systems for the Ukrainian Defense Forces successfully reached the country.",
		"Міністерство оборони Литви повідомило, що комплекси протидії безпілотників ЗСУ успішно досягли країни.",
		"https://kam.lt/ukrainai-perduotos-antidronu-sistemos/"
	],
	[
		"2024-03-22",
		"Federal Chancellor Olaf Scholz and other EU leaders agreed to accelerate plans to use interest earned on frozen Russian central bank assets, This could amount to €3 billion this year alone. Scholz said the funds would mainly be used to buy weapons and munitions which Ukraine needs to defend itself against the Russian invasion. ",
		"Федеральний канцлер Олаф Шольц та інші лідери ЄС погодилися прискорити плани використання відсотків, отриманих із заморожених активів російського центрального банку. Тільки цього року це може скласти 3 мільярди євро. Шольц зазначив, що кошти в основному будуть спрямовані на закупівлю зброї та боєприпасів, необхідних Україні для захисту від російського вторгнення.",
		"https://www.deutschland.de/en/news/additional-military-aid-on-track-for-ukraine"
	],
	[
		"2024-03-15",
		"Greece will continue supplying Ukraine with guns and ammunition this year without depleting its stocks. The equipment will be bought from the Czech Republic and transferred directly to Ukraine. Czech and Greek officials are negotiating the prices of these systems; signing a bilateral agreement will follow.",
		"Греція продовжить постачати Україні зброю і боєприпаси цього року, не вичерпуючи своїх запасів. Обладнання закуповуватимуть із Чехії та передадуть напряму в Україну. Чеські та грецькі офіційні особи ведуть переговори про ціни на ці системи; буде підписання двосторонньої угоди.",
		"https://www.ekathimerini.com/news/1234126/greece-will-keep-supplying-ukraine/"
	],
	[
		"2024-03-15",
		"The Belgian Council of Ministers declared a substantial increase in its military support for Ukraine, with a new aid package totaling €412 million including 300 Lynx combat vehicles and three minehunter ships. The most significant portion of the aid, amounting to €373.1 million, is allocated for additional artillery munitions.",
		"Рада міністрів Бельгії оголосила про значне збільшення військової підтримки України з новим пакетом допомоги на загальну суму 412 мільйонів євро, включаючи 300 бойових машин Lynx і три кораблі-мінники. Найбільша частина допомоги, яка становить 373,1 млн євро, спрямована на додаткові артилерійські боєприпаси.",
		"https://armyrecognition.com/defense_news_march_2024_global_security_army_industry/belgium_increases_military_aid_to_ukraine_with_300_lynx_combat_vehicles_3_minehunter_ships.html"
	],
	[
		"2024-03-15",
		"Germany, France and Poland vowed Friday to procure more weapons for Kyiv and step up production of military equipment along with partners in Ukraine.",
		"Німеччина, Франція та Польща в п'ятницю пообіцяли закупити Києву більше зброї та наростити виробництво військової техніки разом з партнерами в Україні.",
		"https://apnews.com/article/germany-france-poland-ukraine-military-support-2b6615f15e05f166910c3141d3baac0f"
	],
	[
		"2024-03-15",
		"Labour MP Clive Lewis tabled an Early Day Motion calling on the UK Government to send retired equipment to Ukraine and to recognise “that the UK must play a part in organising an urgent increase in aid to enable Ukrainians to free their entire country” and send this equipment.",
		"Депутат від Лейбористської партії Клайв Льюїс подав пропозицію Early Day Motion із закликом до уряду Великої Британії надіслати в Україну списане обладнання та визнати, «що Велика Британія має взяти участь в організації термінового збільшення допомоги, щоб дати можливість українцям звільнити всю свою країну», і надіслати це обладнання.",
		"https://inews.co.uk/news/world/britain-selling-military-equipment-ukraine-2956644"
	],
	[
		"2024-03-15",
		"Bulgaria has sent to Ukraine all the BTR-60 armored personnel carriers that were promised last year.",
		"Болгарія відправила в Україну всі бронетранспортери БТР-60, які були обіцяні минулого року.",
		"https://mil.in.ua/en/news/minister-of-defense-of-bulgaria-all-promised-bulgarian-apcs-delivered-to-ukraine/"
	],
	[
		"2024-03-15",
		"The European Commission has allocated €500 million foreseen under the Act in Support of Ammunition Production (ASAP). This will allow the European defence industry to ramp up its ammunition production capacity to 2 million shells per year by the end of 2025.",
		"Європейська комісія виділила 500 мільйонів євро, передбачених Законом про підтримку виробництва боєприпасів (ASAP). Це дозволить європейській оборонній промисловості до кінця 2025 року збільшити потужність виробництва боєприпасів до 2 мільйонів снарядів на рік.",
		"https://ec.europa.eu/commission/presscorner/detail/en/IP_24_1495"
	],
	[
		"2024-03-15",
		"The Portuguese government will allocate €100 million to the Czech initiative to purchase artillery shells for Ukrainian Defense Forces.",
		"Уряд Португалії виділить 100 мільйонів євро на чеську ініціативу щодо закупівлі артилерійських снарядів для ЗСУ.",
		"https://mil.in.ua/en/news/portugal-to-allocate-e100-million-for-shells-for-ukraine/"
	],
	[
		"2024-03-14",
		"European Union countries agreed on Wednesday to provide 5 billion euros for military aid for Ukraine as part of a revamp of an EU-run assistance fund, handing Kyiv a timely boost as its forces struggle against Russia's invasion.",
		"Країни Європейського Союзу погодилися в середу надати 5 мільярдів євро на військову допомогу Україні в рамках оновлення фонду допомоги, яким керує ЄС, надаючи Києву своєчасну підтримку під час боротьби його сил проти вторгнення Росії.",
		"https://www.msn.com/en-gb/news/world/eu-agrees-5-billion-euro-boost-for-ukraine-military-aid-fund/ar-BB1jPIxb"
	],
	[
		"2024-03-14",
		"Germany's largest defense contractor Rheinmetall is set to significantly increase its production of artillery shells and other munitions by opening several new factories in Ukraine, Lithuania and Germany.",
		"Найбільший оборонний підрядник Німеччини Rheinmetall має намір значно збільшити виробництво артилерійських снарядів та інших боєприпасів, відкривши кілька нових заводів в Україні, Литві та Німеччині.",
		"https://www.dw.com/en/ukraine-updates-rheinmetall-plans-ukraine-arms-factories/live-68526705"
	],
	[
		"2024-03-12",
		"The Department of Defense (DoD) announced additional security assistance for Ukraine. This announcement is the Biden Administration's fifty-fifth tranche of equipment to be provided from DoD inventories for Ukraine since August 2021. This Presidential Drawdown Authority (PDA) package is valued at up to $300 million and includes capabilities to support Ukraine's immediate air defense, artillery, and anti-tank requirements.",
		"Міністерство оборони оголосило про додаткову безпекову допомогу Україні. Це оголошення є п’ятдесят п’ятим траншем обладнання Адміністрації Байдена, яке буде надано з інвентарних запасів Міністерства оборони України з серпня 2021 року. Цей пакет президентських розпоряджень (PDA) оцінюється в 300 мільйонів доларів США та включає можливості для підтримки безпосередньої протиповітряної оборони України, артилерії. , і протитанкові вимоги.",
		"https://www.defense.gov/News/Releases/Release/Article/3704975/biden-administration-announces-urgent-security-assistance-for-ukraine/"
	],
	[
		"2024-03-10",
		"At the summit meeting scheduled for April, the Japanese and U.S. governments have agreed to \"strengthen the joint production system\" for defense equipment, and have begun making adjustments to include this in the outcome document. There is a sense of crisis on the US side that it may run out of stock of artillery shells and missiles due to prolonged support for Ukraine.",
		"На саміті, запланованому на квітень, уряди Японії та США домовилися «зміцнити систему спільного виробництва» оборонного обладнання та почали вносити корективи, щоб включити це в підсумковий документ. У США є відчуття кризи, що через тривалу підтримку України у них можуть закінчитися запаси артилерійських снарядів і ракет.",
		"https://www.yomiuri.co.jp/politics/20240309-OYT1T50255/"
	],
	[
		"2024-03-09",
		"The Polish Foreign Minister believes that the discussion about sending Western troops in Ukraine is useful for making an impact on Russia.",
		"Глава МЗС Польщі вважає, що дискусія про введення західних військ в Україну корисна для впливу на Росію.",
		"https://mil.in.ua/en/news/the-ministry-of-foreign-affairs-of-poland-commented-on-the-idea-of-sending-western-troops-in-ukraine/"
	],
	[
		"2024-03-08",
		"Polish Foreign Minister Radek Sikorski: 'The presence of NATO forces in Ukraine is not unthinkable.'",
		"Міністр закордонних справ Польщі Радек Сікорський: «Присутність сил НАТО в Україні не є немислимою».",
		"https://x.com/PolandMFA/status/1766118567529869614?s=20"
	],
	[
		"2024-03-08",
		"Estonia intends to sign an agreement on security cooperation with Ukraine.",
		"Естонія має намір підписати з Україною угоду про співпрацю в галузі безпеки.",
		"https://www.pravda.com.ua/eng/news/2024/03/8/7445632/"
	],
	[
		"2024-03-08",
		"France is negotiating with Arab countries to return the sold French weapons for further transfer to Ukraine.",
		"Франція веде переговори з арабськими країнами про повернення проданої французької зброї для подальшої передачі Україні.",
		"https://mil.in.ua/en/news/france-is-negotiating-the-transfer-of-weapons-from-arab-countries-to-ukraine/"
	],
	[
		"2024-03-08",
		"France is planning to have some of its arms manufacturers produce much-needed military equipment directly on Ukrainian soil to help the country in its war against Russia, Defence Minister Sebastien Lecornu said on Friday.",
		"Міністр оборони Себастьєн Лекорню заявив у п’ятницю, що Франція планує, щоб деякі з її виробників зброї виробляли вкрай необхідне військове обладнання безпосередньо на українській землі, щоб допомогти країні у війні проти Росії.",
		"https://www.reuters.com/world/europe/french-defence-companies-build-military-equipment-ukrainian-soil-minister-2024-03-08/"
	],
	[
		"2024-03-07",
		"Britain will deliver more than 10,000 drones to the Ukrainian armed forces, the country's defense secretary announced during a Kyiv visit.",
		"Британія поставить Збройним силам України понад 10 тисяч безпілотників, повідомив міністр оборони країни під час візиту в Київ.",
		"https://www.politico.eu/article/uk-to-send-10000-drones-to-ukraine-shapps-zelenskyy/"
	],
	[
		"2024-03-07",
		"Luxembourg has joined the Czech initiative to purchase artillery ammunition for Ukraine outside the alliance.",
		"Люксембург приєднався до чеської ініціативи щодо закупівлі артилерійських боєприпасів для України поза межами альянсу.",
		"https://x.com/Defense_lu/status/1765804808508747855?s=20"
	],
	[
		"2024-03-05",
		"The French authorities are considering allowing their special forces and military units to cross Ukraine’s border.",
		"Французька влада розглядає можливість пропуску свого спецназу та військових підрозділів через кордон України.",
		"https://ubn.news/france-is-considering-sending-special-forces-to-ukraine-to-create-a-strategic-dilemma-for-russia/"
	],
	[
		"2024-03-02",
		"Argentina donates two Mi-171E to Ukraine.",
		"Аргентина передала Україні два Мі-171Е.",
		"https://www.scramble.nl/military-news/argentina-donates-two-mi-171e-to-ukraine"
	],
	[
		"2024-03-02",
		"Finnish Defence Minister Antti Häkkänen calls on the West to increase military support for Ukraine and to find money for shells \"immediately\".",
		"Міністр оборони Фінляндії Антті Хаккянен закликає Захід збільшити військову підтримку України та «негайно» знайти гроші на снаряди.",
		"https://www.pravda.com.ua/eng/news/2024/03/2/7444697/"
	],
	[
		"2024-03-01",
		"President Volodymyr Zelenskiy and Dutch Prime Minister Mark Rutte signed a 10-year security deal - with the Netherlands promising to help fund the supply of 800,000 artillery shells to hold back Russian forces.",
		"Президент Володимир Зеленський і прем’єр-міністр Нідерландів Марк Рютте підписали 10-річну угоду про безпеку – Нідерланди обіцяють допомогти профінансувати постачання 800 000 артилерійських снарядів для стримування російських військ.",
		"https://www.yahoo.com/news/netherlands-rutte-signs-security-deal-222454417.html"
	],
	[
		"2024-03-01",
		"The Netherlands Ministry of Defense reported that they supply Ukraine with rubber, patrol and combat boats. They are also contributing €250 million to the Czech initiative to order large numbers of artillery shells for Ukraine in the short term.",
		"У Міноборони Нідерландів повідомили, що постачають Україні гумові, патрульні та бойові катери. Вони також виділяють 250 мільйонів євро на чеську ініціативу щодо замовлення великої кількості артилерійських снарядів для України в короткостроковій перспективі.",
		"https://www.defensie.nl/actueel/nieuws/2024/03/01/nederland-doneert-vaartuigen-aan-oekraine"
	],
	[
		"2024-03-01",
		"Ukrainian President Volodymyr Zelenskyy announced Friday he and Dutch Prime Minister Mark Rutte signed a security agreement that will provide Kyiv with $2.2 billion in military aid this year.",
		"Президент України Володимир Зеленський оголосив у п’ятницю, що він і прем’єр-міністр Нідерландів Марк Рютте підписали безпекову угоду, яка надасть Києву 2,2 мільярда доларів військової допомоги цього року.",
		"https://www.voanews.com/a/netherlands-pledges-2-2-billion-in-military-aid-for-ukraine-/7510204.html"
	],
	[
		"2024-02-29",
		"Under the right conditions, Canada open to sending noncombat troops to Ukraine, Defence Minister Bill Blair says.",
		"Міністр оборони Білл Блер заявив, що за сприятливих умов Канада відкрита для відправки небойових військ в Україну.",
		"https://www.thestar.com/politics/federal/under-the-right-conditions-canada-open-to-sending-noncombat-troops-to-ukraine-defence-minister-bill/article_eec6806c-d71d-11ee-91fb-ab92d0af803e.html"
	],
	[
		"2024-02-29",
		"\"Through an innovative program France is ordering 100 remotely operated drones from Delair, which will arrive to Ukraine this summer. In total there will be 2000 ordered from our industry, which will go to Ukraine and for our needs.\" - Defense Minister of France Sebastien Lecornu.",
		"«Через інноваційну програму Франція замовляє у Delair 100 дистанційно керованих дронів, які прибудуть в Україну цього літа. Загалом буде 2000 замовлених з нашої галузі, які підуть в Україну та для наших потреб». – Міністр оборони Франції Себастьян Лекорню.",
		"https://x.com/SebLecornu/status/1763297648663040200?s=20"
	],
	[
		"2024-02-29",
		"Argentine President Javier Milei is planning to hold a \"summit of Latin America support\" for Ukraine in late 2024.",
		"Президент Аргентини Хав'єр Мілей планує провести \"саміт підтримки Латинської Америки\" України наприкінці 2024 року.",
		"https://news.yahoo.com/argentinas-president-milei-spearheads-latin-130500291.html"
	],
	[
		"2024-02-27",
		"Netherlands has ordered nine DITA self-propelled 155 mm howitzer for Ukraine,",
		"Нідерланди замовили для України дев'ять самохідних 155-мм гаубиць DITA",
		"https://www.defensie.nl/actueel/nieuws/2024/02/27/generaal-eichelsheim-bezoekt-aan-oekraine-leverende-wapenfabrikanten-in-tsjechie"
	],
	[
		"2024-02-25",
		"The Japanese government is poised to proceed with “indirect military aid” to Ukraine by providing surface-to-air missiles to the United States, whose stockpiles have been reduced due to its support for Ukraine under Russian aggression.",
		"Уряд Японії готовий продовжити «непряму військову допомогу» Україні, надавши ракети «земля-повітря» Сполученим Штатам, чиї запаси були скорочені через підтримку України під час російської агресії.",
		"https://japannews.yomiuri.co.jp/politics/defense-security/20240225-170945/"
	]
]