[
	[
		"2025-06-01",
		"Ukraine is preparing to include manufacturers of armored vehicles, drones, and even missiles in the \"Danish model.\"",
		"Україна готується включити до «данської моделі» виробників бронетехніки, безпілотників і навіть ракет.",
		"https://newsukraine.rbc.ua/news/beyond-artillery-who-to-join-danish-model-1748728211.html"
	],
	[
		"2025-05-30",
		"Ukraine and France have agreed to boost defense cooperation, focusing on logistical support and adapting to the demands of modern warfare.",
		"Україна та Франція домовилися посилити оборонну співпрацю, зосередившись на логістичній підтримці та адаптації до вимог сучасної війни.",
		"https://www.aa.com.tr/en/europe/ukraine-france-expand-defense-cooperation-with-focus-on-battlefield-logistics/3584327"
	],
	[
		"2025-05-29",
		"Germany will finance the purchase of Ukrainian Bars missile drones, Liutyi strike drones, and Flamingo interceptor drones.",
		"Німеччина профінансує закупівлю українських ракетних безпілотників «Барс», ударних безпілотників «Люті» та безпілотників-перехоплювачів «Фламінго».",
		"https://militarnyi.com/en/news/welt-germany-to-support-production-of-ukrainian-drones-bars-liutyi-and-interceptor-uavs-worth-e400-million/"
	],
	[
		"2025-05-28",
		"German chancellor Friedrich Merz announced that Berlin will help Kyiv develop new long-range weapons that can hit targets in Russian territory.",
		"Канцлер Німеччини Фрідріх Мерц заявив, що Берлін допоможе Києву розробити нове далекобійне озброєння, здатне вражати цілі на території Росії.",
		"https://www.dw.com/en/ukraine-merz-announces-long-range-weapons-with-zelenskyy/live-72693164"
	],
	[
		"2025-05-28",
		"Germany will provide further military support for Ukraine amounting to about €5bn ($5.65bn).",
		"Німеччина надасть подальшу військову підтримку Україні на суму близько 5 млрд євро ($5,65 млрд).",
		"https://www.theguardian.com/world/live/2025/may/28/ukraine-russia-war-zelenskyy-merz-taurus-trump-putin-live-news-updates"
	],
	[
		"2025-05-27",
		"Kyiv and London signed an agreement to use $3 billion profits from frozen Russian assets under the Extraordinary Revenue Acceleration (ERA) initiative to cover the needs of the Ukrainian army and the Ukrainian defense industry.",
		"Київ і Лондон підписали угоду про використання 3 мільярдів доларів прибутку від заморожених російських активів в рамках ініціативи «Надзвичайне прискорення податкових надходжень» (ERA) на потреби української армії та української оборонної промисловості.",
		"https://kyivindependent.com/uk-to-allocate-3-billion-of-proceeds-from-frozen-russian-assets-to-ukrainian-defense/"
	],
	[
		"2025-05-27",
		"Sweden has allocated 4.8 billion Swedish kronor (nearly $504 million) to strengthen Ukraine's defense capabilities.",
		"Швеція виділила 4,8 мільярда шведських крон (майже 504 мільйони доларів) на посилення обороноздатності України.",
		"https://kyivindependent.com/sweden-allocates-over-500-million-for-ukrainian-defense-capabilities/"
	],
	[
		"2025-05-25",
		"Western European leaders are considering buying U.S. weapons for Ukraine.",
		"Західноєвропейські лідери розглядають можливість купівлі американської зброї для України.",
		"https://www.oneindia.com/videos/western-europes-claim-ukraine-war-weapons-purchase-011-4246210.html"
	],
	[
		"2025-05-25",
		"Sweden and Denmark sent aid to Kyiv in the form of fishing nets, which Ukraine presumably uses to combat drones.",
		"Швеція і Данія надіслали Києву допомогу у вигляді рибальських сіток, які Україна, ймовірно, використовує для боротьби з безпілотниками.",
		"https://baku.ws/en/world/denmark-and-sweden-sent-aid-to-ukraine-for-drone-defense"
	],
	[
		"2025-05-25",
		"On 25 May, Dutch Minister of Defense Ruben Brekelmans announced that the final F-16 fighter jet pledged to Ukraine will be delivered tomorrow, on 26 May.",
		"25 травня міністр оборони Нідерландів Рубен Брекельманс оголосив, що останній обіцяний Україні винищувач F-16 буде доставлений завтра, 26 травня.",
		"https://euromaidanpress.com/2025/05/25/ukraine-to-get-last-pledged-dutch-f-16-fighter-jets-tomorrow/"
	],
	[
		"2025-05-25",
		"Lawmakers in Slovakia's ruling coalition will push to demand compensation from Kiev for the military and financial aid Bratislava has provided it over the course of the Ukraine conflict.",
		"Депутати правлячої коаліції Словаччини вимагатимуть від Києва компенсації за військову та фінансову допомогу, яку Братислава надала йому протягом конфлікту в Україні.",
		"https://www.bignewsnetwork.com/news/278238659/slovakia-party-to-demand-ukraine-compensate-aid"
	],
	[
		"2025-05-24",
		"Pentagon may downgrade Ukraine-focused office amid policy restructure.",
		"Пентагон може знизити статус українського офісу на тлі реструктуризації політики.",
		"https://kyivindependent.com/pentagon-may-downgrade-ukraine-focused-office-amid-policy-restructure-media-reports/"
	],
	[
		"2025-05-23",
		"Ukraine has signed a memorandum of understanding with KNDS to jointly produce medium-caliber ammunition for the armed forces.",
		"Україна підписала меморандум про взаєморозуміння з KNDS щодо спільного виробництва боєприпасів середнього калібру для збройних сил.",
		"https://thedefensepost.com/2025/05/23/ukraine-knds-ammo-production/"
	],
	[
		"2025-05-10",
		"The United States had approved Germany’s transfer of 125 long-range artillery rockets and 100 Patriot air-defense missiles to Ukraine.",
		"Сполучені Штати схвалили передачу Німеччиною Україні 125 артилерійських ракет великої дальності і 100 зенітно-ракетних комплексів Patriot.",
		"https://www.nytimes.com/2025/05/10/world/europe/eu-ukraine-weapons.html"
	],
	[
		"2025-05-10",
		"The leaders of Britain, France, Germany and Poland, on their first joint visit to Ukraine, said on Saturday that Russia would face “new and massive” sanctions on its banking and energy sectors if President Vladimir V. Putin refused to agree to a full, unconditional 30-day cease-fire.",
		"Лідери Великої Британії, Франції, Німеччини та Польщі під час свого першого спільного візиту в Україну заявили в суботу, що Росія зіткнеться з «новими і масивними» санкціями щодо її банківського та енергетичного секторів, якщо президент Володимир Путін відмовиться погодитися на повне, безумовне 30-денне припинення вогню.",
		"https://www.nytimes.com/2025/05/10/world/europe/ukraine-war-visit-starmer-macron-zelensky-merz.html"
	]
]