[
	[
		"2023-04-06",
		"Poland will supply Kyiv with 14 MiG-29 fighter jets in a few days, said Polish President Andrzej Duda, speaking at a press conference following Volodymyr Zelensky's visit to Warsaw. He also confirmed that he is ready to provide Ukraine with all 28 MiG-29 planes which Poland has.",
		"Польща за кілька днів поставить Києву 14 винищувачів МіГ-29, заявив президент Польщі Анджей Дуда, виступаючи на прес-конференції за підсумками візиту Володимира Зеленського до Варшави. Він також підтвердив, що готовий надати Україні всі 28 літаків МіГ-29, які є у Польщі.",
		"https://www.rferl.org/a/ukraine-zelenskiy-poland-visit/32350100.html"
	],
	[
		"2023-04-05",
		"The Lithuanian Defense Minister Arvydas Anušauskas informed in his Twitter about a new military package for Ukraine. \"The value of the new Lithuanian military support package for Ukraine will reach about 41 million €. It will consist of sent equipment, new acquisitions, contributions to international funds.\"",
		"Про новий військовий пакет для України повідомив у своєму Twitter міністр оборони Литви Арвідас Анушаускас. «Вартість нового литовського пакету військової підтримки України сягне близько 41 мільйона євро. Він складатиметься з надісланого обладнання, нових придбань, внесків у міжнародні фонди».",
		"https://twitter.com/a_anusauskas/status/1643630840654561289?s=20"
	],
	[
		"2023-04-05",
		"Ukraine and Poland agreed on the joint production of 125mm-calibre tank shells.",
		"Україна та Польща домовилися про спільне виробництво танкових снарядів калібру 125 мм.",
		"https://www.aljazeera.com/news/2023/4/7/russia-ukraine-war-list-of-key-events-day-408"
	],
	[
		"2023-04-04",
		"The Department of Defense (DoD) announced new security assistance package for Ukraine. This includes the authorization of a Presidential Drawdown of security assistance valued at up to $500 million. In addition, a significant package of air defense capabilities, as well as artillery and tank ammunition, mortar systems, rockets, and anti-armor systems using $2.1 billion in Ukraine Security Assistance Initiative (USAI) funds was announced.",
		"Міністерство оборони оголосило про новий пакет допомоги Україні в галузі безпеки. Це включає в себе санкцію президентського скорочення допомоги у сфері безпеки на суму до 500 мільйонів доларів. Крім того, було оголошено про значний пакет засобів протиповітряної оборони, а також артилерійських і танкових боєприпасів, мінометних систем, ракет і протиброньових систем із використанням 2,1 мільярда доларів США з коштів Ініціативи сприяння безпеці в Україні (USAI).",
		"https://www.defense.gov/News/Releases/Release/Article/3350958/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-04-03",
		"Denmark and Norway have signed an agreement on the supply of 8,000 155mm artillery shells to the Ukrainian Armed Forces. It is expected that CAESAR self-propelled artillery from Danmark and shells will come together.",
		"Данія та Норвегія підписали угоду про постачання Збройним силам України 8 тисяч 155-мм артилерійських снарядів. Очікується, що разом зійдуть САУ CAESAR з Данії та снаряди.",
		"https://en.interfax.com.ua/news/general/901644.html"
	],
	[
		"2023-04-03",
		"Slovakia is implementing new measures which will expand artillery ammunition production ‘fivefold’ to aid Ukraine, announced Acting Defence Minister Jaroslav Naď.",
		"Словаччина впроваджує нові заходи, які дозволять збільшити виробництво артилерійських боєприпасів «в п’ять разів» для допомоги Україні, заявив виконуючий обов’язки міністра оборони Ярослав Надь.",
		"https://www.euractiv.com/section/politics/news/slovakia-to-increase-ammo-production-fivefold-says-defence-minister/"
	],
	[
		"2023-04-03",
		"The armaments manufacturer Rheinmetall is setting up a maintenance and logistics centre in Romania for tanks, howitzers and military vehicles supplied by the West to Ukraine for its defence.",
		"Виробник озброєння Rheinmetall створює в Румунії центр технічного обслуговування та логістики танків, гаубиць і військової техніки, які Захід постачає в Україну для її оборони.",
		"https://www.deutschland.de/en/news/ticker-solidarity-with-ukraine"
	],
	[
		"2023-04-03",
		"Finance Minister of Netherlands Sigrid Kaag during her visit to Kiev said the Dutch Cabinet should discuss the possibility of providing additional financial support to Ukraine this year. The Netherlands has already announced 2.5 billion euros in aid for this year, with an emphasis on military support.",
		"Міністр фінансів Нідерландів Сігрід Кааг під час візиту до Києва заявила, що уряд Нідерландів має обговорити можливість надання додаткової фінансової підтримки Україні цього року. Нідерланди вже оголосили про виділення 2,5 млрд євро допомоги на цей рік, з акцентом на військову підтримку.",
		"https://nltimes.nl/2023/04/03/dutch-finance-minister-kyiv-discuss-long-term-support"
	],
	[
		"2023-04-03",
		"Ukraine Ordered $80 Million Worth of Australian Combat Modules For Armored Vehicles",
		"Україна замовила австралійські бойові модулі для бронетехніки на 80 мільйонів доларів",
		"https://en.defence-ua.com/analysis/ukraine_ordered_80_million_worth_of_australian_combat_modules_for_armored_vehicles_what_are_they_and_for_which_vehicles-6284.html"
	],
	[
		"2023-04-02",
		"Minister of Defense Jana Černochová (ODS) stated in Chech TV Channel 24 that the Czech army warehouses still have equipment that can be sent to Ukraine. In the coming days, Černochová and the Chief of the General Staff of the Army of the Czech Republic, Karel Řehka, will meet with President Peter Pavel. The president stated in the media last week that the Czech Republic does not have many other options for military aid to Ukraine. Now President Pavel received a list of material that could be sent to Ukraine.",
		"Міністр оборони Яна Чернохова (ODS) заявила в ефірі Чеського телеканалу 24, що на складах чеської армії все ще є техніка, яку можна відправити в Україну. Найближчими днями Чернохова та начальник Генерального штабу армії Чеської Республіки Карел Ржеха зустрінуться з президентом Петером Павелом. Минулого тижня президент заявив у ЗМІ, що Чеська Республіка не має багатьох інших варіантів військової допомоги Україні. Тепер президент Павло отримав список матеріалів, які можна відправити в Україну.",
		"https://ct24.ceskatelevize.cz/domaci/3576160-pokud-cina-dokaze-rusy-presvedcit-k-ukonceni-valky-cernochova-privita-je-urcite-cesta"
	],
	[
		"2023-04-02",
		"Ukroboronprom starts producing fragmentation munition designed for drones.",
		"\"Укроборонпром\" починає виробництво осколкових боєприпасів для безпілотників.",
		"https://news.yahoo.com/drone-shells-now-produced-ukraine-160500490.html"
	],
	[
		"2023-04-01",
		"The chairman of the US Joint Chiefs of Staff General Mark A. Milley ruled out the possibility of the Pentagon providing long-range missiles to war-hit Ukraine, citing a small stockpile as the reason. ",
		"Голова Об'єднаного комітету начальників штабів США генерал Марк А. Міллі виключив можливість надання Пентагоном ракет великої дальності Україні, назвавши причиною невеликі запаси.",
		"https://www.republicworld.com/world-news/russia-ukraine-crisis/us-rejects-providing-long-range-missiles-to-ukraine-to-maintain-its-own-inventories-articleshow.html"
	],
	[
		"2023-04-01",
		"Polish prime minister Mateusz Morawiecki has announced ordering by Ukraine 100 Rosomak infantry fighting vehicles (IFVs) from Poland.",
		"Прем'єр-міністр Польщі Матеуш Моравецький заявив про замовлення Україною 100 бойових машин піхоти (БМП) Росомак у Польщі.",
		"https://www.thefirstnews.com/article/ukraine-orders-100-infantry-fighting-vehicles-from-poland-37569"
	],
	[
		"2023-03-31",
		"A new $2.6 billion U.S. military aid package that could include air surveillance radars, anti-tank rockets and fuel trucks for Ukraine's fight against Russia is expected to be announced as soon as Monday, three U.S. officials said on Friday.",
		"Очікується, що новий пакет військової допомоги США на суму 2,6 мільярда доларів, який може включати радари повітряного спостереження, протитанкові ракети та бензовози для боротьби України з Росією, буде оголошено найближчим часом у понеділок, повідомили у п’ятницю три американські чиновники.",
		"https://www.reuters.com/world/munitions-anti-tank-rockets-next-26-bln-us-pledge-ukraine-sources-2023-03-31/"
	],
	[
		"2023-03-31",
		"Ukrainian Air Force spokesperson Yurii Ihnat confirmed that the nation's air force has now integrated JDAM (Joint Direct Attack Munition) GPS-guided precision bombs into their aircraft fleet.",
		"Речник Повітряних сил України Юрій Ігнат підтвердив, що національні ВПС інтегрували у свій авіапарк високоточні бомби JDAM (Joint Direct Attack Munition) з GPS-наведенням.",
		"https://www.armyrecognition.com/defense_news_april_2023_global_security_army_industry/ukrainian_armed_forces_use_now_us_jdam_gps_precision_guided_bombs_to_strike_russian_army.html"
	],
	[
		"2023-03-29",
		"The security commission of the Swiss House of Representatives has voted to decommission 25 out of 96 Leopard tanks, thereby enabling their sale back to their German manufacturer. This move will allow Switzerland to help Ukraine indirectly. The tanks are intended \"to fill the gaps in the German army that were created by supporting Ukraine with German tanks\".",
		"Комісія з безпеки Палати представників Конгресу Швейцарії проголосувала за виведення з експлуатації 25 із 96 танків Leopard, таким чином дозволивши їх продати назад німецькому виробнику. Цей крок дозволить Швейцарії опосередковано допомогти Україні. Танки призначені «заповнити прогалини в німецькій армії, які утворилися підтримкою України німецькими танками».",
		"https://www.swissinfo.ch/eng/swiss-commission-recommends-selling-25-tanks-back-to-germany/48401162"
	],
	[
		"2023-03-29",
		"Spain will send six promised Leopard battle tanks to Ukraine after Easter",
		"Іспанія після Великодня відправить в Україну шість обіцяних бойових танків Leopard",
		"https://www.thedefensepost.com/2023/03/29/spain-leopard-tanks-ukraine-4/"
	],
	[
		"2023-03-29",
		"Ukrainian army uses Corvo PPDS cardboard drones from Sypaq Australian company",
		"Українська армія використовує картонні дрони Corvo PPDS австралійської компанії Sypaq",
		"https://www.armyrecognition.com/ukraine_-_russia_conflict_war_2022/ukrainian_army_uses_corvo_ppds_cardboard_drones_from_sypaq_australian_company.html"
	],
	[
		"2023-03-29",
		"Pentagon Leaders Still Say ‘No’ to F-16s, MQ-9s for Ukraine",
		"Керівники Пентагону все ще кажуть «ні» F-16, MQ-9 для України",
		"https://www.airandspaceforces.com/pentagon-leaders-no-f-16s-mq-9s-ukraine/"
	],
	[
		"2023-03-28",
		"Germany wants to multiply spending on military aid to Ukraine in the coming years - from three to more than 15 billion euros. It is unclear how the sum would be allocated as well as the precise time frame covered by the spending. ",
		"Німеччина хоче збільшити витрати на військову допомогу Україні в найближчі роки – з трьох до понад 15 мільярдів євро. Незрозуміло, як буде розподілена сума, а також точні часові рамки",
		"https://www.spiegel.de/politik/deutschland/waffenhilfe-fuer-die-ukraine-wird-massiv-ausgeweitet-a-71fab9c7-6c38-41eb-8536-dbf20aee1114"
	],
	[
		"2023-03-28",
		"France will double this month its supplies of 155 artillery rounds to Ukraine to about 2,000 shells a month.",
		"Цього місяця Франція подвоїть постачання Україні 155 артилерійських снарядів до близько 2 тис. снарядів на місяць.",
		"https://uk.news.yahoo.com/france-double-munitions-supplies-ukraine-101423843.html"
	],
	[
		"2023-03-28",
		"Bulgaria will most likely sell a huge amount of ammunition to Ukraine through intermediaries",
		"Болгарія, швидше за все, продасть величезну кількість боєприпасів Україні через посередників",
		"https://www.euractiv.com/section/politics/news/bulgarian-ammo-to-ukraine-could-impact-war/"
	],
	[
		"2023-03-27",
		"Ukraine received 18 German Leopard tanks and 14 British Challenger tanks",
		"Україна отримала 18 німецьких танків Leopard і 14 британських танків Challenger",
		"https://www.rfi.fr/en/international/20230328-promised-german-and-british-tanks-arrive-in-ukraine"
	],
	[
		"2023-03-27",
		"Ukrainian volunteers have started an international crowdsourcing campaign to provide their military with a fleet of FV101 Scorpion armored reconnaissance vehicles.",
		"Українські волонтери розпочали міжнародну краудсорсингову кампанію для забезпечення своїх військових парком броньованих розвідувальних машин FV101 Scorpion.",
		"https://www.thedefensepost.com/category/war/"
	],
	[
		"2023-03-27",
		"Ukrainian tank crews complete Challenger 2 MBT training in UK",
		"Українські танкісти завершили навчання на танках Challenger 2 у Великобританії",
		"https://www.armyrecognition.com/defense_news_march_2023_global_security_army_industry/ukrainian_tank_crews_complete_challenger_2_training_in_uk.html"
	],
	[
		"2023-03-27",
		"40 Marder infantry fighting vehicles from Germany have been handed over at the Ukrainian border",
		"40 бойових машин піхоти Marder з Німеччини передані на українському кордоні",
		"https://www.spiegel.de/politik/deutschland/deutsche-leopard-panzer-in-der-ukraine-angekommen-a-a275a157-d33a-4df0-a43e-bd57a0a7b6f9"
	],
	[
		"2023-03-26",
		"The General Staff of North Macedonia has backed the transfer to Ukraine of 12 Mi-24 military helicopters",
		"Генеральний штаб Північної Македонії підтримав передачу Україні 12 військових вертольотів Мі-24",
		"https://www.rferl.org/a/ukraine-macedonia-helicopters-mi24/32334786.html"
	],
	[
		"2023-03-25",
		"Polish ammunition maker Dezamet, part of state arms producer Polska Grupa Zbrojeniowa (PGZ), will substantially boost capacity to supply EU-funded ammunition to Ukraine according to Poland’s Prime Minister Mateusz Morawiecki. “We want to multiply the output severalfold as quickly as possible,” he said. Dezamet, which produces ammunition for artillery, mortars, and grenade launchers, is one of PGZ group’s more than 50 armaments enterprises.",
		"Прем’єр-міністр Польщі Матеуш Моравецький заявив, що польський виробник боєприпасів Dezamet, який є частиною державного виробника зброї Polska Grupa Zbrojeniowa (PGZ), суттєво збільшить потужності для постачання в Україну боєприпасів, що фінансуються ЄС. «Ми хочемо якнайшвидше збільшити вихід у кілька разів», — сказав він. Компанія «Дезамет», яка виробляє боєприпаси для артилерії, мінометів і гранатометів, є одним із понад 50 збройових підприємств групи PGZ.",
		"https://tvpworld.com/68735075/poland-to-boost-production-of-ammunition-sevenfold-pm-morawiecki"
	],
	[
		"2023-03-24",
		"The Finnish Ministry of Defence (MoD) has announced to donate 3 additional mine-clearing Leopard 2 main battle tanks (MBTs) to the Ukrainian Armed Forces.",
		"Міністерство оборони Фінляндії оголосило про передачу Збройним силам України 3 додаткових бойових танків (ОБТ) Leopard 2 для розмінування.",
		"https://www.army-technology.com/news/finland-mine-clearing-leopard2-ukraine/"
	],
	[
		"2023-03-24",
		"Ukraine's Defence Minister Oleksii Reznikov in his interview to Reuters said the government is expanding its drone programme for both reconnaissance and attacking enemy targets over an increasing range. Ukraine plans to spend nearly $550 million on drones in 2023 and has set up drone assault units within its armed forces.",
		"Міністр оборони України Олексій Резніков в інтерв'ю Reuters заявив, що уряд розширює програму безпілотників як для розвідки, так і для атаки ворожих цілей на все більшій відстані. Україна планує витратити майже 550 мільйонів доларів на безпілотники у 2023 році та створила штурмові підрозділи безпілотників у своїх збройних силах.",
		"https://www.reuters.com/world/europe/inside-ukraines-scramble-game-changer-drone-fleet-2023-03-24/"
	],
	[
		"2023-03-23",
		"The first four of 13 Soviet-era MiG-29 fighter jets that Slovakia decided to give Ukraine have been safely handed over to the Ukrainian air force",
		"Перші чотири з 13 радянських винищувачів МіГ-29, які Словаччина вирішила передати Україні, безпечно передано українським ВПС",
		"https://apnews.com/article/russia-ukraine-war-us-slovakia-jets-c13dbb2e63da577e1f0d0f77050822e1"
	],
	[
		"2023-03-22",
		"65 Ukrainians are wrapping up training on the Patriot missile system at Fort Sill, in the coming days. The Ukrainian air defenders and two donated Patriot systems will be on the battlefield in a matter of weeks, after training began in mid-January.\n",
		"Найближчими днями 65 українців завершують навчання на ракетному комплексі Patriot у Форт-Сіллі. Українські ППО та дві подаровані системи «Патріот» будуть на полі бою за лічені тижні, після початку навчання в середині січня.",
		"https://www.politico.com/news/2023/03/21/us-delivery-tanks-missiles-ukraine-00088098"
	],
	[
		"2023-03-22",
		"Lithuanian President Gitanas Nausėda promised military support for Ukraine in his twitter message: \"In upcoming months, Lithuania will send anti-drones, weapons, ammunition, provide military training & will continue inviting the allies to boost up their efforts too.\" ",
		"Президент Литви Гітанас Науседа пообіцяв військову підтримку Україні у своєму повідомленні у Twitter: «Найближчими місяцями Литва надішле протипілотники, зброю, боєприпаси, забезпечить військову підготовку та продовжить запрошувати союзників також посилити свої зусилля».",
		"https://twitter.com/GitanasNauseda/status/1638463702826352644?s=20"
	],
	[
		"2023-03-21",
		"The UK will send “armour piercing rounds which contain depleted uranium” to Ukraine, for use with the tank squadron donated by the British army.",
		"Велика Британія надішле в Україну «бронебійні снаряди, які містять збіднений уран» для використання в танковій ескадрильї, подарованій британською армією.",
		"https://declassifieduk.org/britain-supplying-depleted-uranium-rounds-to-ukraine/"
	],
	[
		"2023-03-21",
		"The Pentagon is speeding up its delivery of Abrams tanks to Ukraine, opting to send a refurbished older model that can be ready faster, with the aim of getting the 70-ton battle powerhouses to the war zone in eight to 10 months",
		"Пентагон прискорює поставку танків Abrams в Україну, вирішивши відправити відремонтовану стару модель, яка може бути готова швидше, з метою доставки 70-тонних бойових установок у зону бойових дій за вісім-десять місяців.",
		"https://news7.ca/novyny/ssha-hochut-pryskoryty-postavku-tankiv-abrams-ukrayini-zmi/"
	],
	[
		"2023-03-20",
		"Israel Approves Counter-Drone System Sale for Ukraine",
		"Ізраїль схвалив продаж системи боротьби з безпілотниками для України",
		"https://www.thedefensepost.com/2023/03/20/israel-counter-drone-system-ukraine/"
	],
	[
		"2023-03-20",
		"the Department of Defense (DoD) announces the authorization of a Presidential Drawdown of security assistance to meet Ukraine’s critical security and defense needs. This authorization is the thirty-fourth drawdown of equipment from DoD inventories for Ukraine since August 2021 and is valued at up to $350 million.",
		"Міністерство оборони оголошує про санкціонування президентського скорочення допомоги у сфері безпеки для задоволення критичних потреб України у сфері безпеки та оборони. Цей дозвіл є тридцять четвертим вилученням обладнання з інвентарних запасів Міністерства оборони України з серпня 2021 року та оцінюється в 350 мільйонів доларів США.",
		"https://www.defense.gov/News/Releases/Release/Article/3334472/dod-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2023-03-20",
		"North Macedonia confirmed sending of four previously promised SU-25 aircraft to Ukraine. The country's government is currently considering the transfer of 12 MI-24 attack helicopters to Ukraine.",
		"Північна Македонія підтвердила відправку Україні чотирьох раніше обіцяних літаків СУ-25. Наразі уряд країни розглядає питання про передачу Україні 12 ударних вертольотів Мі-24.",
		"https://censor.net/en/news/3406883/north_macedonia_confirmed_return_of_four_su25_aircraft_to_ukraine_mass_media"
	],
	[
		"2023-03-20",
		"The EU has reached a deal to send Ukraine 1 million rounds of ammunition within the next 12 months. The plan will see the EU both donate ammunition from its own stockpiles and also jointly purchase new shells for Ukraine. It also leaves open the possibility that the EU could help countries collectively buy missiles for Ukraine.",
		"ЄС домовився про відправку Україні 1 мільйона боєприпасів протягом наступних 12 місяців. Відповідно до плану, ЄС передасть боєприпаси зі своїх власних запасів і спільно закупить нові снаряди для України. Це також залишає відкритою можливість того, що ЄС може допомогти країнам колективно купувати ракети для України.",
		"https://www.politico.eu/article/eu-seals-deal-send-ukraine-1-million-ammo-rounds-shells-war/"
	],
	[
		"2023-03-20",
		"Canada is sending Leopard 2 based  armored recovery vehicle to Ukraine.",
		"Канада відправляє в Україну броньовану евакуаційну машину на базі Leopard-2.",
		"https://www.armyrecognition.com/defense_news_march_2023_global_security_army_industry/canada_is_sending_leopard_2_arv_recovery_tanks_to_ukraine.htmll"
	],
	[
		"2023-03-18",
		"Three senior U.S. security officials held a video call with a group of their Ukrainian counterparts to discuss military aid to Kyiv. \"We discussed the further provision of necessary assistance to our country, in particular vehicles, weapons and ammunition,\" Andriy Yermak wrote on the Telegram messaging app.",
		"Троє високопоставлених співробітників служби безпеки США провели відеодзвінок з групою своїх українських колег, щоб обговорити військову допомогу Києву. «Ми обговорили подальше надання необхідної допомоги нашій державі, зокрема техніки, зброї та боєприпасів», – написав Андрій Єрмак у месенджері Telegram.",
		"https://www.voanews.com/a/top-ukraine-us-defense-officials-discuss-military-aid-in-call-/7011749.html"
	],
	[
		"2023-03-17",
		"Poland will send four Soviet-era Mig fighter jets to Ukraine - becoming the first Nato country to send planes since Russia invaded last year.",
		"Польща надішле в Україну чотири винищувачі радянських часів Міг, ставши першою країною НАТО, яка направить літаки після вторгнення Росії минулого року.",
		"https://www.bbc.com/news/world-europe-64975770"
	],
	[
		"2023-03-17",
		"Slovakia announced it would send 13 MiG-29 fighter jets to Ukraine in the coming weeks, joining fellow NATO member Poland. Slovakia's MiG-29s were retired last summer and most are not operational. The country plans to send those that are, with the rest going as spare parts for Ukraine's existing fleet.",
		"Словаччина оголосила, що найближчими тижнями відправить в Україну 13 винищувачів МіГ-29, приєднавшись до Польщі, яка є членом НАТО. Словацькі МіГ-29 були зняті з експлуатації минулого літа, і більшість з них не експлуатуються. Країна планує відправити ті, що є в експлуатації, а решта піде як запчастини до наявного українського флоту.",
		"https://www.npr.org/2023/03/16/1163895110/poland-will-send-fighter-jets-to-ukraine-the-first-nato-country-to-do-so"
	],
	[
		"2023-03-17",
		"Slovakia announces donation to Ukraine of 2 2K12 Kub air defense missile systems",
		"Словаччина повідомляє про передачу Україні двох зенітно-ракетних комплексів 2K12 Kub",
		"https://www.mosr.sk/52628-en/minister-obrany-j-nad-podpisal-medzivladnu-dohodu-s-ukrajinou/"
	],
	[
		"2023-03-16",
		"Canadian Defence Minister Anita Anand has announced additional military assistance to Ukraine. Canada will donate nearly 8,000 rounds of 155mm ammunition, as well as 12 air defence missiles sourced from Canadian Armed Forces’ (CAF) inventory, to sustain the air defence systems currently deployed in Ukraine.",
		"Міністр оборони Канади Аніта Ананд заявила про додаткову військову допомогу Україні. Канада передасть майже 8000 снарядів калібру 155 мм, а також 12 ракет ППО зі складу Збройних сил Канади (CAF) для підтримки систем ППО, які зараз розміщені в Україні.",
		"https://www.siasat.com/canada-announces-additional-military-aid-to-ukraine-2548113/"
	],
	[
		"2023-03-15",
		"A group of senators from both parties is pressing the Pentagon for more information on what it would take to send F-16 jets to Ukraine.",
		"Група сенаторів від обох партій вимагає від Пентагону додаткової інформації про те, що буде потрібно, щоб відправити літаки F-16 в Україну.",
		"https://www.politico.com/news/2023/03/14/senate-defense-department-ukraine-fighters-00087051"
	],
	[
		"2023-03-15",
		"Prime Minister Benjamin Netanyahu held a discussion Tuesday on Israel’s policy regarding aid to Ukraine in the face of the Russian invasion and war. Hebrew media reported that the meeting discussed the option of providing military assistance to Ukraine, which has long been lobbying Israel for weapons and in particular air defense systems. Israel is prepared to give Ukraine a rocket early warning system and assist the country in clearing landmines, according to the report.",
		"Ізраїль готовий передати Україні систему раннього попередження про ракети та допомогти країні в розмінуванні.",
		"https://www.timesofisrael.com/netanyahu-holds-meeting-on-ukraine-said-to-look-at-providing-military-aid/"
	],
	[
		"2023-03-15",
		"Denmark's government said on Wednesday it will establish a fund of 7 billion Danish crowns ($1.01 billion) for military, civilian and business aid to Ukraine this year. The fund, which was agreed with a broad majority of parties in parliament, will direct 5.4 billion crowns (77%) towards military aid, 1.2 billion (17%) towards civilian aid and 0.4 billion (6%) towards efforts by Danish companies to rebuild Ukraine.",
		"Уряд Данії заявив у середу, що цього року створить фонд у 7 мільярдів датських крон (1,01 мільярда доларів) для військової, цивільної та бізнес-допомоги Україні. Фонд, який було погоджено з переважною більшістю партій у парламенті, спрямує 5,4 мільярда крон (77%) на військову допомогу, 1,2 мільярда (17%) на цивільну допомогу та 0,4 мільярда (6%) на зусилля данських компаній з відбудови Україну.",
		"https://www.reuters.com/world/europe/denmark-establishes-1-bln-fund-aid-ukraine-2023-03-15/"
	],
	[
		"2023-03-14",
		"The Netherlands intends to provide Ukraine with two Alkmaar-class minehunters, starting in 2025. Ukraine will also receive drone detection radar systems and M3 bridge and ferrying systems that enable rapid bridge building. ",
		"Нідерланди мають намір надати Україні два міношукачі типу Alkmaar, починаючи з 2025 року. Україна також отримає радіолокаційні системи виявлення безпілотників і системи мостів і переправ M3, які дозволять швидко будувати мости.",
		"https://english.defensie.nl/latest/news/2023/03/14/ollongren-promises-minehunters-for-ukraine-during-visit-to-bombed-port-cities"
	],
	[
		"2023-03-14",
		"Ukroboronprom starts producing 125 mm shells for Ukrainian tanks",
		"\"Укроборонпром\" починає виробництво 125-мм снарядів для українських танків",
		"https://www.armyrecognition.com/defense_news_march_2023_global_security_army_industry/ukroboronprom_starts_producing_125_mm_shells_for_ukrainian_tanks.html"
	],
	[
		"2023-03-14",
		"UK armed forces minister James Heappey told lawmakers the UK was investigating giving Typhoons to countries that give MiGs to Ukraine.",
		"Міністр збройних сил Великої Британії Джеймс Хіппі заявив законодавцям, що Великобританія розглядає надання Тайфунів країнам, які надають Україні МіГи.",
		"https://breakingdefense.com/2023/03/to-help-ukraine-uk-explores-supplying-eurofighter-typhoons-to-european-mig-29-operators/"
	],
	[
		"2023-03-13",
		"Denmark confirms that 100 Leopard 1A5 tanks for Ukraine will be ready in the spring",
		"Данія підтверджує, що 100 танків Leopard 1A5 для України будуть готові навесні",
		"https://cphpost.dk/2023-03-13/news/first-danish-tanks-ready-for-ukraine-in-may/"
	],
	[
		"2023-03-12",
		"Ukraine's foreign minister Dmytro Kuleba urged Germany to speed up supplies of ammunition and to start training Ukrainian pilots on Western fighter jets. He said German weapons manufacturers had told him at the Munich Security Conference last month they were ready to deliver but were waiting for the government to sign contracts.",
		"Міністр закордонних справ України Дмитро Кулеба закликав Німеччину прискорити постачання боєприпасів і почати навчання українських пілотів на західних винищувачах. Він сказав, що німецькі виробники зброї сказали йому на Мюнхенській конференції з безпеки минулого місяця, що вони готові поставити, але чекають, поки уряд підпише контракти.",
		"https://www.reuters.com/world/europe/ukraines-kuleba-urges-germany-send-more-ammunition-train-up-pilots-2023-03-11/"
	],
	[
		"2023-03-12",
		"Ukraine plans to increase its military budget to 500 m. UAH",
		"Україна планує збільшити військовий бюджет до 500 млн. грн",
		"https://t.me/s/nexta_live"
	],
	[
		"2023-03-12",
		"Japan studies options to export weapons to Ukraine such as rocket launcher systems",
		"Японія вивчає варіанти експорту в Україну зброї, зокрема реактивних систем залпового вогню",
		"https://www.armyrecognition.com/defense_news_march_2023_global_security_army_industry/japan_studies_options_to_export_weapons_to_ukraine_such_as_rocket_launcher_systems.html"
	]
]