[
	[
		"2024-11-03",
		"The price of a Russian victory will be times higher for Germany than helping Ukraine win over Russia in the ongoing war. This was assessed by economists from the Kiel Institute of World Economy (IfW Kiel).",
		"Ціна перемоги Росії буде в рази вищою для Німеччини, ніж допомога Україні у перемозі над Росією у війні, що триває. Таку оцінку дали економісти з Кільського інституту світової економіки (IfW Kiel).",
		"https://www.ukrinform.net/rubric-economy/3922836-russian-victory-would-cost-germany-10-to-20-times-more-than-aid-to-ukraine-german-experts.html"
	],
	[
		"2024-11-03",
		"Canada provided 13 off-road vehicles with demining equipment to the Ukrainian National Special Transport Service.",
		"Канада надала 13 позашляховиків з обладнанням для розмінування Державній спеціальній службі транспорту України.",
		"https://rubryka.com/en/2024/10/31/rishennya-dlya-peremogy-kanady-nadala-ukrayini-partiyu-pikapiv-z-obladnannyam-dlya-rozminuvannya/"
	],
	[
		"2024-11-02",
		"Polish Prime Minister Donald Tusk’s government is proposing to provide military aid to Ukraine on credit.",
		"Уряд прем'єр-міністра Польщі Дональда Туска пропонує надати військову допомогу Україні в кредит.",
		"https://english.nv.ua/nation/poland-considers-offering-defense-aid-to-ukraine-on-credit-says-fm-sikorski-50463371.html"
	],
	[
		"2024-11-01",
		"The Department of Defense announced additional security assistance for Ukraine. This is the sixty-ninth tranche of equipment to be provided from DoD inventories since August 2021. This Presidential Drawdown Authority package, which has an estimated value of $425 million includes air defense interceptors; munitions for rocket systems and artillery; armored vehicles; and anti-tank weapons.",
		"Міністерство оборони США оголосило про надання Україні додаткової безпекової допомоги. Це вже шістдесят дев'ятий транш обладнання, яке буде надано зі складів Міністерства оборони з серпня 2021 року. Цей пакет допомоги за президентським указом про скорочення озброєнь орієнтовною вартістю 425 мільйонів доларів включає перехоплювачі протиповітряної оборони, боєприпаси для ракетних систем та артилерії, бронетехніку та протитанкове озброєння.",
		"https://www.defense.gov/News/Releases/Release/Article/3954004/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2024-11-01",
		"Australia donated several Joint Direct Attack Munition Extended-Range (JDAM-ER) glide bombs to Ukraine following their withdrawal from Royal Australian Air Force (RAAF) service.",
		"Австралія передала Україні кілька планерних бомб JDAM-ER (Joint Direct Attack Munition Extended-Range) після зняття їх з озброєння Королівських ВПС Австралії (RAAF).",
		"https://www.australiandefence.com.au/news/news/australian-jdam-ers-sent-to-ukraine"
	],
	[
		"2024-11-01",
		"Canada’s FM Mélanie Joly stated that Canada supports Ukraine’s long-range strikes within Russia and advocates lifting restrictions on Western weapon use for such operations.",
		"Міністр закордонних справ Канади Мелані Джолі заявила, що Канада підтримує українські дальні удари по Росії і виступає за зняття обмежень на використання західних озброєнь для таких операцій.",
		"https://euromaidanpress.com/2024/11/01/canada-pushes-allies-to-approve-ukraines-long-range-strikes-on-russia-with-western-weapons/"
	],
	[
		"2024-10-31",
		"Lithuania has announced a new military aid package for Ukraine, which includes power generators, mortar bombs and ammunition.",
		"Литва оголосила про новий пакет військової допомоги Україні, який включає електрогенератори, мінометні міни та боєприпаси.",
		"https://www.pravda.com.ua/eng/news/2024/10/31/7482247/"
	],
	[
		"2024-10-31",
		"Norway is preparing a new aid package for Ukraine worth €500 million. It will include F-16 fighter jets and NASAMS air defense systems",
		"Норвегія готує новий пакет допомоги Україні на суму 500 мільйонів євро. Він включатиме винищувачі F-16 та системи протиповітряної оборони NASAMS",
		"https://newsukraine.rbc.ua/news/not-only-f-16s-norway-to-deliver-nasams-air-1730375724.html"
	],
	[
		"2024-10-31",
		"South Korea’s military aid to Ukraine will depend on the level of cooperation between North Korea and Russia.",
		"Військова допомога Південної Кореї Україні залежатиме від рівня співпраці між Північною Кореєю та Росією.",
		"https://english.nv.ua/nation/south-korean-aid-to-ukraine-will-be-proportional-to-moscow-s-reliance-on-pyongyang-50462987.html"
	],
	[
		"2024-10-31",
		"The U.K. will allocate three billion pounds ($3.8 billion) per year to military support for Ukraine, according to the draft budget submitted to the parliament on Oct. 30.",
		"Великобританія виділятиме три мільярди фунтів стерлінгів (3,8 мільярда доларів) на рік на військову підтримку України, згідно з проектом бюджету, поданим до парламенту 30 жовтня.",
		"https://www.msn.com/en-us/news/world/uk-promises-3-8-billion-per-year-in-military-aid-to-ukraine/ar-AA1te4j7?apiversion=v2&noservercache=1&domshim=1&renderwebcomponents=1&wcseo=1&batchservertelemetry=1&noservertelemetry=1"
	],
	[
		"2024-10-31",
		"Prime Minister of Canada calls for doubling down efforts to support Ukraine.",
		"Прем'єр-міністр Канади закликав подвоїти зусилля на підтримку України.",
		"https://mil.in.ua/en/news/prime-minister-of-canada-calls-for-doubling-down-efforts-to-support-ukraine/"
	],
	[
		"2024-10-30",
		"The Swedish government will provide Ukraine with €63M in financial support. €20M will go to supporting Ukraine’s defense industry, within the Danish model’s framework, which is aimed at supporting procurement through Ukrainian industry. Sweden will also allocate about €43M to several existing multilateral initiatives to provide quick and effective support to the Armed Forces.",
		"Уряд Швеції надасть Україні 63 млн євро фінансової підтримки. 20 млн євро підуть на підтримку української оборонної промисловості в рамках данської моделі, яка спрямована на підтримку закупівель через українську промисловість. Швеція також виділить близько 43 млн євро на кілька існуючих багатосторонніх ініціатив для надання швидкої та ефективної підтримки Збройним Силам.",
		"https://ubn.news/sweden-will-allocate-a-e63m-military-aid-package-to-ukraine-including-defense-industry-investment/"
	],
	[
		"2024-10-28",
		"The Japanese government has allocated JPY 471.9 billion ($3.08 billion) as part of a $50 billion loan from the G7 countries to support Ukraine.",
		"Уряд Японії виділив 471,9 млрд ієн ($3,08 млрд) як частину кредиту в розмірі $50 млрд, наданого країнами G7 на підтримку України.",
		"https://mil.in.ua/en/news/japan-allocates-3-billion-to-ukraine-as-part-of-g7-s-loan/"
	],
	[
		"2024-10-27",
		"The European Union has found a plan to provide money to Ukraine for military aid and to override Hungary's veto.",
		"Європейський Союз знайшов план, як надати Україні гроші на військову допомогу та подолати вето Угорщини.",
		"https://gagadget.com/en/522519-the-eu-has-found-a-way-to-override-hungarys-veto-on-military-aid-to-ukraine/"
	],
	[
		"2024-10-26",
		"Canada has sent ACSV medical armored vehicles to Ukraine.",
		"Канада передала Україні медичні броньовані автомобілі ACSV.",
		"https://x.com/CAFwithUkraine/status/1850160458453688436"
	],
	[
		"2024-10-24",
		"Ukraine's Defence Ministry and the US Department of Defense Office of Inspector General have investigated the process of accounting for and using American spare parts ordered and supplied to the Armed Forces of Ukraine as international military assistance. The ministry noted that the audit did not reveal significant discrepancies but identified a gap in the regulatory framework. This gap complicates the management of spare parts from damaged military equipment provided to Ukraine as international military assistance by the US.",
		"Міністерство оборони України та Офіс генерального інспектора Міністерства оборони США перевірили процес обліку та використання американських запчастин, замовлених та поставлених Збройним силам України в рамках міжнародної військової допомоги. У міністерстві зазначили, що аудит не виявив суттєвих розбіжностей, але виявив прогалину в нормативно-правовій базі. Ця прогалина ускладнює управління запасними частинами від пошкодженої військової техніки, наданої Україні як міжнародна військова допомога з боку США.",
		"https://www.msn.com/en-us/news/world/audit-of-us-military-aid-usage-reveals-no-significant-violations-ukraines-defence-ministry-reports/ar-AA1sQfZe"
	],
	[
		"2024-10-21",
		"The Department of Defense (DoD) announced additional security assistance for Ukraine. This announcement is the Biden Administration's sixty-eighth tranche of equipment to be provided from DoD inventories for Ukraine since August 2021. This Presidential Drawdown Authority (PDA) package, which has an estimated value of $400 million, will provide Ukraine additional capabilities to meet its most urgent needs, including: munitions for rocket systems and artillery; mortar systems and rounds; armored vehicles; and anti-tank weapons.",
		"Міністерство оборони США оголосило про надання Україні додаткової безпекової допомоги. Це оголошення є шістдесят восьмим траншем обладнання, яке Адміністрація Байдена надасть Україні з запасів Міністерства оборони, починаючи з серпня 2021 року. Цей пакет допомоги за президентським рішенням про скорочення озброєнь (PDA), орієнтовна вартість якого становить 400 мільйонів доларів США, надасть Україні додаткові можливості для задоволення її найнагальніших потреб, зокрема: боєприпаси для ракетних систем та артилерії; мінометні системи та боєприпаси; бронемашини; протитанкові засоби.",
		"https://www.defense.gov/News/Releases/Release/Article/3940873/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2024-10-20",
		"The Danish Ministry of Defense has announced that the country has approved a new military aid package for Ukraine of 2,4 billion kroner ($350 million).",
		"Міністерство оборони Данії оголосило, що країна затвердила новий пакет військової допомоги Україні у розмірі 2,4 млрд крон ($350 млн).",
		"https://www.slobodenpecat.mk/en/danska-objavi-paket-voena-pomosh-za-ukraina-od-350-milioni-dolari/"
	],
	[
		"2024-10-20",
		"France will transfer 12 additional Caesar wheeled artillery systems to Ukraine using funds from the Russian Federation’s frozen assets.",
		"Франція передасть Україні 12 додаткових колісних артилерійських систем «Цезар» за рахунок коштів із заморожених активів Російської Федерації.",
		"https://mil.in.ua/en/news/ukraine-to-receive-12-caesar-acss-for-funds-from-frozen-russian-assets/"
	],
	[
		"2024-10-19",
		"Canada will provide a new aid package to Ukraine. The cost of this military aid package will be 64.8 million Canadian dollars (47 million US dollars). This is a part of 500 million CAD previously announced military support.",
		"Канада надасть новий пакет допомоги Україні. Вартість цього пакету військової допомоги становитиме 64,8 млн канадських доларів (47 млн доларів США). Це частина раніше оголошеної військової допомоги у розмірі 500 мільйонів канадських доларів.",
		"https://news.online.ua/en/canada-will-provide-a-new-package-of-military-aid-to-ukraine-what-will-go-in-there-886192/"
	],
	[
		"2024-10-19",
		"An important agreement was signed between Germany and Ukraine on immediate actions to strengthen Ukraine's air defense system. “The agreement provides for arrangements under which the signatory countries will contribute to joint projects or finance their own projects aimed at strengthening the air defense capabilities of the Armed Forces of Ukraine,” - said the Minister of Defense of Ukraine Rustam Umerov. At the same time, the Defense Minister noted that five other signatory countries will join the project, in addition to Ukraine: Germany, Belgium, Norway, the Netherlands, and Denmark.",
		"Між Німеччиною та Україною було підписано важливу угоду про невідкладні дії щодо посилення системи протиповітряної оборони України. «Угода передбачає домовленості, згідно з якими країни-підписанти робитимуть внесок у спільні проекти або фінансуватимуть власні проекти, спрямовані на посилення спроможностей протиповітряної оборони Збройних Сил України», - заявив міністр оборони України Рустам Умеров. При цьому міністр оборони зазначив, що до проекту, окрім України, долучаться ще п'ять країн-підписантів: Німеччина, Бельгія, Норвегія, Нідерланди та Данія.",
		"https://newsukraine.rbc.ua/news/immediate-air-defense-reinforcement-for-ukraine-1729364102.html"
	],
	[
		"2024-10-18",
		"Germany, the primary supplier of the Leopard 2A6 tanks, has confirmed the dispatch of 18 units in a federal announcement as part of a $1.5 billion arms package, and part of an ongoing NATO commitment to aid Ukraine's defense efforts.",
		"Німеччина, основний постачальник танків Leopard 2A6, підтвердила відправку 18 одиниць у федеральній заяві в рамках пакету озброєнь вартістю 1,5 мільярда доларів і в рамках поточних зобов'язань НАТО з надання допомоги Україні в її оборонних зусиллях.",
		"https://www.newsweek.com/ukraine-gets-leopard-tank-boost-nato-allies-1971237"
	],
	[
		"2024-10-17",
		"The Netherlands, together with Denmark, orders new artillery shells for Ukraine. The Netherlands invests a total of €271 million (USD 294.5 million). The order of 155mm shells will help Ukraine with ammunition in 2025. In addition, the Netherlands orders 6 self-propelled DITA howitzers in the Czech Republic. These can fire the standard 155mm NATO caliber. ",
		"Нідерланди разом з Данією замовляють нові артилерійські снаряди для України. Нідерланди інвестують загалом 271 мільйон євро (294,5 мільйона доларів США). Замовлення 155-мм снарядів допоможе Україні забезпечити себе боєприпасами у 2025 році. Крім того, Нідерланди замовляють 6 самохідних гаубиць DITA у Чеській Республіці. Вони можуть стріляти стандартним калібром НАТО 155 мм. ",
		"https://www.defensie.nl/actueel/nieuws/2024/10/17/nederland-bestelt-in-tsjechie-meer-artilleriegranaten-en-pantserhouwitsers-voor-oekraine"
	],
	[
		"2024-10-17",
		"In the near future, Norway will provide six F-16 fighter jets to the Ukrainian Air Force.",
		"Найближчим часом Норвегія надасть шість винищувачів F-16 українським ВПС.",
		"https://mil.in.ua/en/news/norway-prepares-six-f-16s-for-transfer-to-ukraine/"
	],
	[
		"2024-10-16",
		"The Department of Defense (DoD) announced additional security assistance for Ukraine. This announcement is the Biden Administration's sixty-seventh tranche of equipment to be provided from DoD inventories for Ukraine since August 2021.  This Presidential Drawdown Authority (PDA) package, which has an estimated value of $425 million, includes air defense capabilities, air-to-ground weapons, munitions for rocket systems and artillery, armored vehicles, and anti-tank weapons.",
		"Міністерство оборони США оголосило про надання Україні додаткової безпекової допомоги. Це оголошення є шістдесят сьомим траншем обладнання, яке Адміністрація Байдена надасть Україні з запасів Міністерства оборони, починаючи з серпня 2021 року.  Цей пакет допомоги за президентським рішенням про скорочення озброєнь (PDA), орієнтовна вартість якого становить 425 мільйонів доларів, включає засоби протиповітряної оборони, озброєння класу «повітря-земля», боєприпаси для ракетних систем і артилерії, бронетехніку та протитанкові засоби.",
		"https://www.defense.gov/News/Releases/Release/Article/3937146/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2024-10-13",
		"A recent decision by the European Union to contribute some $440 million to Ukraine’s resurgent arms industry marks a significant shift in the bloc’s approach to Russia’s war against its neighbor, but also highlights the E.U. defense sector’s shortcomings in producing weapons and ammunition.",
		"Нещодавнє рішення Європейського Союзу виділити близько 440 мільйонів доларів на відродження української оборонної промисловості знаменує собою значний зсув у підході блоку до війни Росії проти свого сусіда, але також підкреслює недоліки оборонного сектору ЄС у виробництві зброї та боєприпасів.",
		"https://www.washingtonpost.com/world/2024/10/13/ukraine-defense-industry-denmark/"
	],
	[
		"2024-10-13",
		"Slovakia has decided to stop sending arms to Ukraine, citing a lack of supplies. They have declared the delivery of MiG-29 fighter jets to Ukraine as \"illegal.\"",
		"Словаччина вирішила припинити постачання зброї в Україну, посилаючись на брак поставок. Поставки винищувачів МіГ-29 в Україну вони оголосили «незаконними».",
		"https://www.oneindia.com/videos/slovakia-halts-arms-supply-to-ukraine-mig-29-illegal-011-4186714.html "
	]
]