[
	[
		"2023-11-17",
		"The Dutch government has earmarked an additional 2 billion euros ($2.2 billion) in military aid for Ukraine in 2024.",
		"Уряд Нідерландів виділив додаткові 2 млрд євро на військову допомогу Україні у 2024 році.",
		"https://www.reuters.com/world/europe/dutch-deliver-additional-22-bln-military-aid-kyiv-2024-defence-minister-2023-11-17/"
	],
	[
		"2023-11-17",
		"Minister of Defence of Finland Antti Häkkänen informed about the 20th military package for Ukraine in value of 100 million euros. Due to operational reasons, and to ensure the aid package arrives safely at its destination, the ministry added that no further details on the content, the method of delivery, or the schedule would be provided. The total value of defence support provided by Finland to Ukraine since Russia's invasion amounts to 1.5 billion euros.",
		"Міністр оборони Фінляндії Антті Хаккянен повідомив про 20-й військовий пакет для України вартістю 100 млн євро. З оперативних причин і щоб забезпечити безпечне прибуття пакету допомоги до місця призначення, міністерство додало, що жодних додаткових деталей щодо вмісту, способу доставки чи графіку надавати не буде. Загальна вартість оборонної підтримки, яку Фінляндія надала Україні з моменту вторгнення Росії, становить 1,5 млрд євро.",
		"https://yle.fi/a/74-20060891"
	],
	[
		"2023-11-17",
		"Norway’s Labour-Center government has proposed giving Ukraine NOK 7.5 billion worth of military support through its Nansen Program, which promises NOK 75 billion ($7.5 bln) in military and humanitarian support over the next five years.",
		"Уряд Норвезького центру праці запропонував надати Україні військову підтримку на суму 7,5 мільярдів норвезьких крон через програму Нансена, яка обіцяє 75 мільярдів норвезьких крон (7,5 мільярдів доларів) військової та гуманітарної підтримки протягом наступних п’яти років.",
		"https://www.newsinenglish.no/2023/11/17/norway-denies-any-cuts-in-support-for-ukraine/"
	],
	[
		"2023-11-17",
		"Five Italian arms and military equipment companies have joined the Alliance of Ukrainian Defense Industries.",
		"П'ять італійських компаній з виробництва озброєння та військової техніки приєдналися до Альянсу ОПК України.",
		"https://mspu.gov.ua/news/piat-italiiskykh-kompanii-doluchylysia-do-aliansu-oboronnykh-industrii"
	],
	[
		"2023-11-15",
		"The Czech initiative ‘Darek pro Putina’ (A Gift for Putin) will raise funds for a UH-60 Black Hawk helicopter for Ukraine.",
		"Чеська ініціатива «Darek pro Putina» (Подарунок для Путіна) збиратиме кошти на гелікоптер UH-60 Black Hawk для України.",
		"https://mil.in.ua/en/news/czech-volunteers-rally-to-donate-black-hawk-to-ukraine/"
	],
	[
		"2023-11-14",
		"German Minister of Foreign Affairs, Annalena Baerbock: Germany will not just continue to support to Ukraine, it will expand such assistance during winter months and throughout next year.",
		"Міністр закордонних справ Німеччини Анналена Бербок: Німеччина не просто продовжить підтримувати Україну, вона розширить таку допомогу протягом зимових місяців і протягом наступного року.",
		"https://www.ukrinform.net/rubric-polytics/3786206-putin-rejoices-too-soon-at-international-turbulence-baerbock.html"
	],
	[
		"2023-11-14",
		"The Ukrainian government has awarded Rheinmetall a contract for Leopard 1 systems, including 25 main battle tanks Leopard 1A5, five armoured recovery vehicles (Bergepanzer 2) and two driver training tanks. The order, financed by Germany and worth a figure in the upper-two-digit million-euro range, also includes training, logistics, spare parts, maintenance and other support services.",
		"Уряд України уклав з Rheinmetall контракт на поставку систем Leopard 1, включаючи 25 основних бойових танків Leopard 1A5, п'ять броньованих евакуаційних машин (Bergepanzer 2) і два танки для підготовки водіїв. Замовлення, фінансоване Німеччиною, також включає навчання, логістику, запасні частини, технічне обслуговування та інші допоміжні послуги.",
		"https://www.rheinmetall.com/en/media/news-watch/news/2023/11/2023-11-14-rheinmetall-to-supply-ukraine-with-leopard-systems-on-behalf-of-german-government"
	],
	[
		"2023-11-14",
		"Up until now Ukraine has not sent an order for purchasing of 100 PzH 2000 to Germany. The contract has been approved by the German government in 2022 and is valued at EUR 1.7 bln. The reasons for the decistion are not known. At the same time KNDS confirmed preparations for the production of the RCH 155 wheeled self-propelled howitzers. Currently, KMW is at the stage of construction of the production line. Ukraine has become the 1st customer of KMW for RCH 155 with an order of 18 units. The contract is valued at EUR 216 mln.",
		"Досі Україна не надсилала замовлення на закупівлю 100 PzH 2000 до Німеччини. Контракт був схвалений урядом Німеччини в 2022 році і оцінюється в 1,7 млрд євро. Причини такого рішення невідомі. Водночас KNDS підтвердила підготовку до виробництва колісних самохідних гаубиць RCH 155. Зараз KMW знаходиться на стадії будівництва виробничої лінії. Україна стала першим замовником KMW на RCH 155 із замовленням 18 одиниць. Контракт оцінюється в 216 млн євро.",
		"https://x.com/Bjoern__M/status/1724444791935472127?s=20"
	],
	[
		"2023-11-13",
		"The Canadian government has asked Parliament to approve 500 million CAD (approximately 385 million US dollars) for military aid to Ukraine",
		"Уряд Канади попросив парламент схвалити 500 млн канадських доларів (приблизно 385 млн доларів США) на військову допомогу Україні",
		"https://www.armyrecognition.com/defense_news_november_2023_global_security_army_industry/canada_to_allocate_new_$385_mn_financial_aid_to_ukraine_military_support.html"
	],
	[
		"2023-11-11",
		"Chancellor Olaf Scholz’s governing coalition has agreed to double German military aid for Ukraine next year to €8 billion ($8.6 billion).",
		"Урядова коаліція канцлера Олафа Шольца погодилася подвоїти військову допомогу Німеччини Україні наступного року до 8 мільярдів євро",
		"https://www.bloomberg.com/news/articles/2023-11-11/germany-set-to-double-its-ukraine-military-aid-under-scholz-plan"
	],
	[
		"2023-11-10",
		"A European Union plan to spend up to 20 billion euros ($21.4 billion) on military aid for Ukraine is meeting resistance from EU countries and may not survive in its current form, diplomats say.",
		"План Європейського Союзу витратити до 20 мільярдів євро на військову допомогу Україні зустрічає опір з боку країн ЄС і може не вижити в нинішньому вигляді, кажуть дипломати.",
		"https://www.reuters.com/world/europe/eus-20-billion-euro-plan-ukraine-military-aid-hits-resistance-2023-11-10/"
	],
	[
		"2023-11-10",
		"The Canadian government has asked Parliament to allocate CAD 500 million (about $385 million) for military aid to Ukraine.",
		"Уряд Канади звернувся до парламенту з проханням виділити 500 мільйонів канадських доларів (близько 385 мільйонів доларів США) на військову допомогу Україні.",
		"https://www.ukrinform.ua/rubric-ato/3785411-urad-kanadi-prosit-u-parlamentu-385-miljoniv-na-vijskovu-dopomogu-ukraini.html"
	],
	[
		"2023-11-10",
		"The French company SEFA is ready to supply 8 SDZ (Zone Demining System) demining systems to Ukraine. SEFA and one of the Ukrainian manufacturers are negotiating on the joint production of spare parts for SDZ systems.",
		"Французька компанія SEFA готова поставити в Україну 8 систем розмінування SDZ (Zone Demining System). SEFA та один з українських виробників ведуть переговори про спільне виробництво запчастин для систем SDZ.",
		"https://mil.in.ua/en/news/french-sefa-sends-demining-systems-to-ukraine/"
	],
	[
		"2023-11-09",
		"Global Clearance Solutions (GCS) - a producer of demining equipment - has announced the opening of thier service and maintenance facility in Ukraine.",
		"Global Clearance Solutions (GCS) - виробник обладнання для розмінування - оголосив про відкриття сервісно-технічного центру в Україні.",
		"https://gcs.ch/news-and-stories/2023/11/9/to-support-our-clients-gcs-has-established-a-dedicated-service-amp-maintenance-workshop"
	],
	[
		"2023-11-09",
		"The Ukrainian military received Serbian M93P1 30mm grenades for AGS-17 automatic grenade launchers.",
		"Українські військові отримали сербські гранати М93П1 калібру 30 мм для автоматичних гранатометів АГС-17.",
		"https://mil.in.ua/en/news/serbian-made-30mm-grenades-delivered-to-ukrainian-military-for-ags-17-grenade-launchers/"
	],
	[
		"2023-11-08",
		"The new Slovak government refused to approve a military aid package for Ukraine. The €40.3 million ($43 million) package was prepared by the outgoing government and included four million bullets for rifles, 5,172 pieces of artillery shells, 140 air-defense missiles, eight mortars, and 1,200 mines, said the state-run TASR news agency.",
		"Новий уряд Словаччини відмовився затверджувати пакет військової допомоги Україні. Пакет у розмірі 40,3 мільйона євро був підготовлений урядом, що минає, і включав чотири мільйони куль для гвинтівок, 5172 одиниці артилерійських снарядів, 140 ракет ППО, вісім мінометів і 1200 мін, повідомляє державне інформаційне агентство TASR. .",
		"https://www.aa.com.tr/en/europe/new-slovak-government-refuses-to-approve-military-aid-package-for-ukraine/3047451"
	],
	[
		"2023-11-08",
		"Rheinmetall has received an order from the German government to supply Ukraine with around 100,000 rounds of 120mm mortar ammunition. The order, worth a figure in the lower-three-digit million-euro range, forms part of a recent €400 million military aid package for the Ukrainian armed forces. Delivery is due to begin shortly and extend over the next two years.",
		"Компанія Rheinmetall отримала від уряду Німеччини замовлення на поставку в Україну близько 100 тис. боєприпасів до мінометів калібру 120 мм. Замовлення є частиною нещодавнього пакету військової допомоги на суму 400 мільйонів євро для українських збройних сил. Постачання має розпочатися найближчим часом і триватиме протягом наступних двох років.",
		"https://www.aa.com.tr/en/europe/new-slovak-government-refuses-to-approve-military-aid-package-for-ukraine/3047451"
	],
	[
		"2023-11-08",
		"Ukrainian Minister of Strategic Industries Oleksandr Kamyshin reported on twitter that the Ukrainian government has voted for the increase in military spending for local defense in three areas: $1,5bn for procurement of mostly locally produced drones, $350mn for procurement of locally made artillery systems, and $1,2bn for expanding capabilities of Ukraine defense industry.",
		"Міністр стратегічної промисловості України Олександр Камишін повідомив у Twitter, що український уряд проголосував за збільшення військових витрат на місцеву оборону за трьома напрямками: $1,5 млрд на закупівлю переважно місцевих безпілотників, $350 млн на закупівлю місцевих артилерійських систем, і $1,2 млрд на розширення можливостей ОПК України.",
		"https://x.com/AKamyshin/status/1722246545997983806?s=20"
	],
	[
		"2023-11-08",
		"France's National Assembly approved re-topping the country's special fund for Ukraine with another €200 million. MPs tweaked the cash pot's rules to allow for co-financing by Ukrainian authorities, meaning the total amount of contracts signed can be higher than €200 million. The Senate needs to green light the money before it can be spent.",
		"Національні збори Франції схвалили поповнення спеціального фонду країни для України ще на 200 мільйонів євро. Депутати змінили правила, щоб дозволити українській владі співфінансування, тобто загальна сума підписаних контрактів може перевищувати 200 мільйонів євро. Сенат повинен дати дозвіл на ці гроші, перш ніж їх можна буде витратити.",
		"https://www.politico.eu/article/slovakia-blocks-latest-aid-package-to-ukraine/"
	],
	[
		"2023-11-07",
		"The Dutch Defence Ministry has relocated five F-16 jets to Romania to start training Ukrainian pilots.",
		"Міністерство оборони Нідерландів перекинуло п'ять літаків F-16 до Румунії для початку підготовки українських пілотів.",
		"https://www.defensenews.com/training-sim/2023/11/07/netherlands-sends-five-f-16s-to-romania-to-train-ukrainian-pilots/"
	],
	[
		"2023-11-07",
		"The U.S. Army needs Congress to approve $3.1 billion to buy 155 millimeter artillery rounds and expand production to quickly replace stocks depleted by shipments to Ukraine and Israel.",
		"Армії США потрібно, щоб Конгрес схвалив 3,1 мільярда доларів на закупівлю артилерійських снарядів калібру 155 міліметрів і розширення виробництва, щоб швидко поповнити запаси, вичерпані через поставки в Україну та Ізраїль.",
		"https://www.reuters.com/business/aerospace-defense/us-army-says-it-needs-3-billion-155-mm-artillery-rounds-production-2023-11-07/"
	],
	[
		"2023-11-05",
		"House Speaker Mike Johnson, R-La., on Sunday argued it \"makes sense\" to couple Ukraine aid with funding for the U.S.-Mexico border. \"We have to take care of our own border first,\" Johnson said during an appearance on \"Fox News Sunday.\"",
		"Спікер Палати представників Майк Джонсон, республіканець, у неділю стверджував, що «має сенс» поєднати допомогу Україні з фінансуванням кордону США та Мексики. «Насамперед ми повинні подбати про власний кордон», — сказав Джонсон під час виступу на «Fox News Sunday».",
		"https://news.yahoo.com/speaker-johnson-pushes-couple-ukraine-171835346.html?fr=sycsrp_catchall"
	],
	[
		"2023-11-03",
		"The Department of Defense announced additional security assistance which includes the drawdown of security assistance from DoD inventories valued at up to $125 million to meet Ukraine's immediate battlefield needs, as well as $300 million in Ukraine Security Assistance Initiative (USAI) funds to strengthen Ukraine's air defenses over the long term. The 50th PDA package includes additional air defense capabilities, artillery ammunition, anti-tank weapons, and other equipment. Under USAI, the DoD will provide Ukraine with laser-guided munitions to counter Unmanned Aerial Systems.",
		"Міністерство оборони США оголосило про 50-й пакет військової допомоги за програмою PDA на 150 мільонів доларів, що включає додаткові засоби протиповітряної оборони, артилерійські боєприпаси, протитанкова зброя та інше обладнання.\n\nКрім того, 300 мільонів доларів за програмою USAI будуть спрямовані на закупівлю боєприпасів з лазерним наведенням для протидії безпілотним літальним системам.",
		"https://www.defense.gov/News/Releases/Release/Article/3578754/biden-administration-announces-new-security-assistance-for-ukraine/"
	],
	[
		"2023-11-03",
		"Ten months after Sweden pledged Archer howitzers to Ukraine they are finally on the front line.",
		"Через десять місяців після того, як Швеція передала Україні гаубиці Archer, вони нарешті на передовій.",
		"https://www.forbes.com/sites/davidaxe/2023/11/03/ukraine-finally-deploys-its-ex-swedish-archer-howitzers-theyre-some-of-the-best-big-guns-in-the-war/?sh=58a2a61e3484"
	],
	[
		"2023-11-03",
		"The United States on Thursday imposed sweeping new measures against Moscow over the war in Ukraine, targeting Russia's future energy capabilities, sanctions evasion and a suicide drone.",
		"У четвер Сполучені Штати запровадили радикальні нові заходи проти Москви через війну в Україні, націлені на майбутні енергетичні можливості Росії, ухилення від санкцій і безпілотник-смертник",
		"https://www.reuters.com/world/us-imposes-sweeping-new-sanctions-targeting-russia-over-war-ukraine-2023-11-02/"
	],
	[
		"2023-11-03",
		"During a two-day visit to Ukraine, Dutch Defense Minister Kajsa Ollongren pledged 500 million euros in ammunition between now and the middle of next year. About 260 million euros ($ 276 mn) will be spent on artillery shells and another 240 million euros ($ 255 mn) on tank ammunition.",
		"Під час дводенного візиту в Україну міністр оборони Нідерландів Кайса Оллонгрен пообіцяла виділити 500 мільйонів євро боєприпасів до середини наступного року. Близько 260 млн євро ($276 млн) буде витрачено на артилерійські снаряди і ще 240 млн євро ($255 млн) на боєприпаси для танків.",
		"https://www.parool.nl/wereld/live-oorlog-oekraine-ollongren-zegt-oekraine-voor-500-miljoen-aan-munitie-toe~b1746de6/"
	],
	[
		"2023-11-03",
		"Germany has planned military support for Ukraine at least up until 2032.",
		"Німеччина планує військову підтримку України щонайменше до 2032 року.",
		"https://news.yahoo.com/general-germanys-military-support-ukraine-130941876.html"
	],
	[
		"2023-11-02",
		"Despite pledging to support Ukraine with a million rounds of ammunition within a year to help it beat back Russia’s invasion, the EU’s weapons manufacturers are nowhere near the kind of output needed to hit that target by March. Meanwhile North Korea has supplied Russia with a million of artillery shells.",
		"Незважаючи на зобов’язання підтримати Україну мільйоном боєприпасів протягом року, щоб допомогти їй відбити вторгнення Росії, виробники зброї в ЄС далеко не досягли обсягів виробництва, необхідного для досягнення цієї мети до березня. Тим часом Північна Корея поставила Росії мільйон артилерійських снарядів.",
		"https://www.politico.eu/article/vladimir-putin-kim-jong-un-russia-pyongyang-beats-brussels-to-a-million-ammunition-rounds/"
	],
	[
		"2023-11-01",
		"An analysis of satellite images by Schemes, RFE/RL's Ukrainian investigative unit, suggests that Russia is actively building up its capacity for weapons production and developing new factories.",
		"Аналіз супутникових знімків, проведений українським розслідувальним підрозділом Радіо Свобода «Схеми», показує, що Росія активно нарощує свої потужності з виробництва зброї та розбудовує нові заводи.",
		"https://www.rferl.org/a/russia-ramping-up-war-production/32658857.html"
	],
	[
		"2023-10-29",
		"The Canadian Army has dozens of older armoured personnel carriers it plans to send to the scrapheap this year — even though a private company has offered to refurbish them for use in Ukraine.",
		"У канадської армії є десятки старіших бронетранспортерів, які вона планує відправити на звалище цього року, хоча приватна компанія запропонувала відремонтувати їх для використання в Україні.",
		"https://www.cbc.ca/news/politics/armoured-vehicles-armatec-ukraine-dnd-1.6973154"
	],
	[
		"2023-10-28",
		"Finland is preparing a new aid package for Ukraine to protect critical infrastructure.",
		"Фінляндія готує новий пакет допомоги Україні для захисту критичної інфраструктури.",
		"https://t.me/Klymenko_MVS/418"
	],
	[
		"2023-10-26",
		"Slovakia's new Prime Minister, Robert Fico, announced on Thursday that he would stop delivering arms to Ukraine, limiting support for his neighbour to \"humanitarian and civilian aid\".",
		"Новий прем'єр-міністр Словаччини Роберт Фіцо оголосив, що припинить поставки зброї в Україну, обмеживши підтримку свого сусіда \"гуманітарною та цивільною допомогою\".",
		"https://www.euronews.com/2023/10/26/slovakia-announces-the-end-of-military-aid-to-ukraine"
	],
	[
		"2023-10-26",
		"The Danish government has declared its commitment to providing Ukraine with a new military aid package worth 3.7 billion Danish kroner, which is approximately $520 million.",
		"Уряд Данії заявив про готовність надати Україні новий пакет військової допомоги вартістю 3,7 мільярда датських крон, що становить приблизно 520 мільйонів доларів.",
		"https://defence-blog.com/denmark-to-send-520-million-in-weapons-military-aid-to-ukraine/"
	],
	[
		"2023-10-26",
		"The Department of Defense has announced the 49th drawdown assistance package for Ukraine valued at up to $150 million. It includes air defense equipment, artillery rounds and antitank weapons.",
		"Міністерство оборони США оголосило про 49-й пакет допомоги для України на суму до $150 млн. Це засоби протиповітряної оборони, артилерійські снаряди та протитанкова зброя.",
		"https://www.defense.gov/News/News-Stories/Article/Article/3570190/dod-announces-up-to-150m-in-aid-for-ukraine/"
	],
	[
		"2023-10-25",
		"The Australian Government, with the support of local defence industry, is providing a further $20 million package of military assistance to Ukraine. It includes de-mining equipment, portable x-ray machines, a 3D metal printer, and counter drone systems.",
		"Уряд Австралії за підтримки місцевої оборонної промисловості надає ще один пакет військової допомоги Україні на суму 20 мільйонів доларів. До нього входять обладнання для розмінування, портативні рентгенівські апарати, 3D-принтер для металу та системи протидронів.",
		"https://www.minister.defence.gov.au/media-releases/2023-10-25/australian-capabilities-continue-supporting-ukraine"
	],
	[
		"2023-10-24",
		"The head of NATO Jens Stoltenberg urged allied states to ramp up production of arms.",
		"Глава НАТО Єнс Столтенберг закликав країни-союзники нарощувати виробництво зброї.",
		"https://www.aa.com.tr/en/europe/natos-stoltenberg-urges-allies-to-ramp-up-production-to-meet-ukraines-needs/3031338"
	],
	[
		"2023-10-24",
		"Contract notified by Belgian Ministry of Defense for the benefit of Ukraine already successfully completed - for the delivery of thousands of 105 mm ammunition for Leopard 1 tanks.",
		"Контракт, нотифікований Міністерством оборони Бельгії на користь України, вже успішно завершився – на поставку тисяч 105-мм боєприпасів для танків Leopard 1.",
		"https://x.com/ForcesOperation/status/1716874613534437530?s=20"
	],
	[
		"2023-10-23",
		"The Council of the European Union has failed to agree on a EUR 500 million ($534 million) tranche of military aid to Ukraine, due to Hungary blocking the motion.",
		"Рада Європейського Союзу не змогла погодити транш військової допомоги Україні в розмірі 500 мільйонів євро через те, що Угорщина заблокувала цю пропозицію.",
		"https://uk.finance.yahoo.com/news/hungary-blocks-534-million-eu-210000273.html"
	],
	[
		"2023-10-22",
		"The head of the lower chamber of the Czech parliament, Marketa Pekarova Adamova, told RFE/RL's Ukrainian Service that Ukraine \"must win the war\" and reestablish control over the Black Sea region of Crimea, which Russia occupied in 2014. She said the West \"definitely made the wrong decision\" with its \"insufficient\" response to Moscow’s seizure of Crimea.",
		"Голова нижньої палати парламенту Чехії Маркета Пекарова Адамова заявила, що Україна «має виграти війну» і відновити контроль над чорноморським регіоном Криму, який Росія окупувала в 2014 році. Вона сказала, що Захід «безумовно прийняв неправильне рішення» своєю «недостатньою» реакцією на захоплення Криму Москвою.",
		"https://www.rferl.org/a/czech-parliament-speaker-reaffirms-support-ukraine/32648883.html"
	]
]