[
	[
		"2025-04-12",
		"The UK has announced a further £450 million ($585 million) of military aid to Ukraine.",
		"Великобританія оголосила про виділення додаткової військової допомоги Україні у розмірі 450 мільйонів фунтів стерлінгів (585 мільйонів доларів).",
		"https://www.gdnonline.com/Details/1350154/Ukraine-to-receive-$580-million-of-UK-led-military-support"
	],
	[
		"2025-04-12",
		"Norway will provide €7 billion ($7.9 billion) in military aid to Ukraine in 2025.",
		"Норвегія надасть Україні 7 мільярдів євро (7,9 мільярда доларів) військової допомоги у 2025 році.",
		"https://wenewsenglish.pk/norway-has-pledged-7-9b-in-military-aid-ukrainian-defence-minister/"
	],
	[
		"2025-04-11",
		"During the meeting of the Ukraine Defense Contact Group (UDCG), allies announced the support for Kyiv amounting to more than 21 billion euros (23.85 billion dollars).",
		"Під час засідання Української оборонної контактної групи (UDCG) союзники оголосили про підтримку Києва на суму понад 21 мільярд євро (23,85 мільярда доларів).",
		"https://www.msn.com/en-ca/news/world/ukraine-to-receive-record-aid-from-ramstein-group-amount-announced/ar-AA1CKEqF?cvid=AB6D87FC2F1049419926A2C8EC5F0954&ocid=FUJITSUDHP"
	],
	[
		"2025-04-11",
		"Germany has pledged new deliveries of weapons systems to Ukraine.",
		"Німеччина пообіцяла нові поставки систем озброєння в Україну.",
		"https://www.dw.com/en/germany-announces-fresh-military-aid-to-ukraine/live-72212628"
	],
	[
		"2025-04-11",
		"Lithuania plans to allocate an additional 20 million euros for the purchase of ammunition for Ukraine.",
		"Литва планує виділити додатково 20 мільйонів євро на закупівлю боєприпасів для України.",
		"https://newsukraine.rbc.ua/news/lithuania-to-allocate-20-million-for-ammunition-1744380893.html"
	],
	[
		"2025-04-11",
		"Kyiv and its Western partners launched an electronic warfare coalition in support of Ukraine. The electronic warfare coalition consists of 11 countries and comes on top of other eight Western coalitions to support Ukraine. The new coalition will focus on purchasing equipment, training specialists, and developing electronic warfare policies and doctrines.",
		"Київ та його західні партнери створили коаліцію з радіоелектронної боротьби на підтримку України. Коаліція з радіоелектронної боротьби складається з 11 країн і приєдналася до інших восьми західних коаліцій на підтримку України. Нова коаліція зосередиться на закупівлі обладнання, підготовці фахівців та розробці політики і доктрин у сфері радіоелектронної боротьби.",
		"https://kyivindependent.com/electronic-warfare-coalition-for-ukraine-launched-in-brussels/"
	],
	[
		"2025-04-11",
		"Sweden orders 18 new Archer self-propelled howitzers from BAE Systems as part of largest military aid package to Ukraine.",
		"Швеція замовляє 18 нових самохідних гаубиць Archer у BAE Systems в рамках найбільшого пакету військової допомоги Україні.",
		"https://armyrecognition.com/news/army-news/2025/sweden-orders-18-new-archer-self-propelled-howitzers-from-bae-systems-as-part-of-largest-military-aid-package-to-ukraine"
	],
	[
		"2025-04-09",
		"Belgium has announced a new military aid package for Ukraine, valued at an estimated €1 billion.",
		"Бельгія оголосила про новий пакет військової допомоги Україні на суму близько 1 мільярда євро.",
		"https://news.az/news/belgium-announces-1b-military-aid-package-for-ukraine"
	],
	[
		"2025-04-08",
		"The United States' military will withdraw troops and equipment from Jasionka, a logistics hub in southeastern Poland that supplies most weapons being sent to Ukraine.",
		"Американські військові виведуть війська і техніку з Ясьонки, логістичного центру на південному сході Польщі, який постачає більшість озброєнь, що відправляються в Україну.",
		"https://www.politico.eu/article/us-pull-presence-key-ukraine-arms-aid-hub-poland-jasionka/"
	],
	[
		"2025-04-07",
		"Norway is providing 5 billion kroner for the purchase of artillery shells for Ukraine. Part of the funds will be allocated through the Czech initiative, and the rest through the mechanisms of the European Peace Facility.",
		"Норвегія виділяє 5 мільярдів крон на закупівлю артилерійських снарядів для України. Частина коштів буде виділена через чеську ініціативу, а решта - через механізми Європейського фонду миру.",
		"https://newsukraine.rbc.ua/news/norway-allocates-additional-5-billion-kroner-1744047194.html"
	],
	[
		"2025-04-02",
		"Posts on X mentioned the UK pledging for Ukraine an unspecified number of Westland Puma HC.2 medium transport helicopters (potentially 8–10 units), though this has not been officially confirmed by government sources.\n\n",
		"У повідомленнях на Х згадується, що Велика Британія пообіцяла надати Україні невизначену кількість середніх транспортних вертольотів Westland Puma HC.2 (потенційно 8-10 одиниць), хоча це не було офіційно підтверджено урядовими джерелами.\n",
		"https://x.com/Jeff21461/status/1907400355572297962\n\n"
	],
	[
		"2025-03-31",
		"Sweden announced its largest military aid package to Ukraine since 2022, valued at $1.6 billion (16 billion SEK). This included $950 million for weapon purchases, $550 million for Ukrainian defense industry production, and $100 million in weapons from Swedish stocks. This package was widely noted for its scale and focus on boosting Ukraine’s domestic production capacity.\n\n",
		"Швеція оголосила про найбільший пакет військової допомоги Україні з 2022 року на суму 1,6 мільярда доларів (16 мільярдів шведських крон). Він включає 950 мільйонів доларів на закупівлю озброєнь, 550 мільйонів доларів на продукцію української оборонної промисловості та 100 мільйонів доларів у вигляді озброєнь зі шведських запасів. Цей пакет був широко відзначений своїм масштабом і спрямованістю на посилення внутрішнього виробничого потенціалу України.",
		"https://x.com/Maks_NAFO_FELLA/status/1906663019024720018"
	],
	[
		"2025-03-30",
		"US president Donald Trump is “very angry” and “p***** off” with Vladimir Putin for his suggestion Volodymyr Zelensky should be replaced by a UN-mandated government.",
		"Президент США Дональд Трамп «дуже злий» і «розлючений» на Володимира Путіна за його пропозицію замінити Володимира Зеленського урядом, сформованим за мандатом ООН",
		"https://www.independent.co.uk/news/world/europe/ukraine-russia-war-latest-map-trump-putin-b2723998.html"
	],
	[
		"2025-03-30",
		"We will not accept Russian demands that leave Ukraine defenceless, says Ukraine's foreign minister.",
		"Ми не приймемо російські вимоги, які роблять Україну беззахисною, - заявив міністр закордонних справ України.",
		"https://www.pravda.com.ua/eng/news/2025/03/30/7505251/"
	],
	[
		"2025-03-29",
		"Zelenskyy: Ukraine not to recognise US military aid as debt.",
		"Зеленський: Україна не визнає військову допомогу США боргом.",
		"https://www.msn.com/en-ca/news/world/zelensky-ukraine-will-not-recognize-old-us-military-aid-as-loans/ar-AA1BRRKk"
	],
	[
		"2025-03-29",
		"Europe plans for long-term defence aid for Ukraine.",
		"Європа планує довгострокову оборонну допомогу Україні.",
		"https://www.europeaninterest.eu/europe-plans-for-long-term-defence-aid-for-ukraine/"
	],
	[
		"2025-03-28",
		"The Swedish government financially supports Ukraine in the area of mine clearance and drones with over $7mln.",
		"Уряд Швеції фінансово підтримує Україну у сфері розмінування та безпілотників, виділивши понад $7 млн.",
		"https://mil.in.ua/en/news/sweden-allocates-over-e7-million-for-drones-and-demining-in-ukraine/"
	],
	[
		"2025-03-28",
		"The Netherlands will accelerate the allocation of EUR 3.5 billion in aid to Ukraine, providing EUR 2 billion this year, rather than in 2026 as previously planned.",
		"Нідерланди прискорять виділення 3,5 млрд євро допомоги Україні, виділивши 2 млрд євро цього року, а не у 2026 році, як планувалося раніше.",
		"https://interfax.com.ua/news/general/1059398.html"
	],
	[
		"2025-03-27",
		"Trump demands Ukraine’s minerals and oil so that Kiev reimburse all aid received during Joe Biden’s presidency.",
		"Трамп вимагає від України мінерали та нафту, щоб Київ відшкодував всю допомогу, отриману за часів президентства Джо Байдена.",
		"https://www.thetimes.com/uk/defence/article/ukraine-war-russia-uk-trump-ceasefire-sanctions-r87mvgj7x"
	],
	[
		"2025-03-27",
		"US will struggle to make Europe stop arming up Ukraine.",
		"США будуть боротися за те, щоб змусити Європу припинити озброювати Україну.",
		"https://asiatimes.com/2025/03/us-will-struggle-to-make-europe-stop-arming-up-ukraine/#"
	],
	[
		"2025-03-27",
		"North Korea has deployed an additional 3,000 troops to Russia this year and continues to supply missiles, artillery and ammunition to support the Kremlin’s war against Ukraine.",
		"Цього року Північна Корея розгорнула додаткові 3 000 військових в Росії і продовжує постачати ракети, артилерію та боєприпаси для підтримки війни Кремля проти України.",
		"https://www.themoscowtimes.com/2025/03/27/north-korea-sent-more-troops-and-weapons-to-russia-south-koreas-military-says-a88502"
	],
	[
		"2025-03-27",
		"Emmanuel Macron announced a plan to send “reassurance forces” from “several European countries” based in “certain strategic locations” in Ukraine in the event of a peace treaty with Russia.",
		"Еммануель Макрон оголосив про план відправити «сили заспокоєння» з «кількох європейських країн», що базуються в «певних стратегічних точках» в Україні, у разі укладення мирного договору з Росією.",
		"https://www.euronews.com/my-europe/2025/03/27/coalition-of-the-willing-meets-in-paris-to-strengthen-support-for-ukraine"
	],
	[
		"2025-03-26",
		"Emmanuel Macron announces €2 billion in additional military aid for Ukraine.",
		"Еммануель Макрон оголосив про надання Україні додаткової військової допомоги у розмірі 2 млрд євро.",
		"https://www.euronews.com/my-europe/2025/03/26/emmanuel-macron-announces-2-billion-in-additional-military-aid-for-ukraine"
	]
]