[
	[
		"2024-08-24",
		"Lithuania is planning to provide Ukraine with another military package. The value of the new military package was not disclosed.",
		"Литва планує надати Україні черговий військовий пакет. Вартість нового військового пакету не розголошується.",
		"https://www.yahoo.com/news/lithuania-providing-more-military-aid-191158335.html"
	],
	[
		"2024-08-24",
		"Lithuania will allocate €35 million to purchase radars and mine clearance equipment for Ukraine.",
		"Литва виділить 35 мільйонів євро на закупівлю радарів та обладнання для розмінування для України.",
		"https://mil.in.ua/en/news/lithuania-to-purchase-a-radar-for-ukraine-and-supply-5-000-drones-by-the-end-of-fall/"
	],
	[
		"2024-08-24",
		"South African authorities have blocked the supply of artillery shells from the German concern Rheinmetall’s plant located in the country to Poland.",
		"Влада Південно-Африканської Республіки заблокувала постачання артилерійських снарядів з розташованого в країні заводу німецького концерну Rheinmetall до Польщі.",
		"https://mil.in.ua/en/news/south-africa-blocks-artillery-shell-delivery-to-poland/"
	],
	[
		"2024-08-23",
		"The Norwegian government will provide Kyiv with its defense technology and finance the production of 155-millimeter artillery shells developed by the Nammo (Nordic Ammunition Company) in Ukraine.",
		"Уряд Норвегії надасть Києву свої оборонні технології та профінансує виробництво 155-міліметрових артилерійських снарядів, розроблених компанією Nammo (Nordic Ammunition Company) в Україні.",
		"https://www.regjeringen.no/no/aktuelt/oppskrift/id3051006/"
	],
	[
		"2024-08-23",
		"The Department of Defense (DoD) announced additional security assistance. This announcement is the Biden Administration's sixty-fourth tranche of equipment to be provided from DoD inventories for Ukraine since August 2021. This Presidential Drawdown Authority (PDA) package, which has an estimated value of $125 million, will provide Ukraine additional capabilities to meet its most urgent needs, including: air defense capabilities; munitions for rocket systems and artillery; and anti-tank weapons.",
		"Міністерство оборони (МО) США оголосило про надання додаткової допомоги у сфері безпеки. Це оголошення є шістдесят четвертим траншем обладнання, яке Адміністрація Байдена надасть Україні з запасів Міністерства оборони, починаючи з серпня 2021 року. Цей пакет допомоги в рамках президентського рішення про скорочення озброєнь (PDA), оціночна вартість якого становить 125 мільйонів доларів США, надасть Україні додаткові можливості для задоволення її найнагальніших потреб, зокрема: засоби протиповітряної оборони, боєприпаси для ракетних систем та артилерії, а також протитанкові озброєння.",
		"https://www.defense.gov/News/Releases/Release/Article/3883533/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2024-08-22",
		"Latvia is preparing to transfer of drones to Ukraine. This is the largest package which includes 1400 drones, bringing total quantity to 3000 various drones.",
		"Латвія готується до передачі безпілотників Україні. Це найбільша партія, яка включає 1400 безпілотників, а загальна кількість - 3000 різних безпілотників.",
		"https://x.com/AndrisSpruds/status/1826636743371522125"
	],
	[
		"2024-08-19",
		"The Pansarbandvagn 302 (PbV 302) infantry fighting vehicle, produced by Swedish Hägglund & Söner, has been approved for delivery to Ukraine's Armed Forces.",
		"Бойова машина піхоти Pansarbandvagn 302 (PbV 302) виробництва шведської компанії Hägglund & Söner схвалена до постачання на озброєння Збройних сил України",
		"https://kyivindependent.com/ukraine-approves-swedish-infantry-fighting-vehicle-for-military-use/"
	],
	[
		"2024-08-19",
		"The German government has announced a new package of military assistance for Ukraine on August 19. Germany has supplied a new IRIS-T SLS air defense missile system, 14,000 rounds of 155 mm ammunition, 10 naval drones, and other equipment in its latest military aid delivery to Ukraine.",
		"Уряд Німеччини 19 серпня оголосив про новий пакет військової допомоги Україні. В рамках останнього пакету військової допомоги Україні Німеччина поставила новий зенітно-ракетний комплекс IRIS-T SLS, 14 000 боєприпасів калібру 155 мм, 10 військово-морських безпілотників та інше обладнання.",
		"https://armenpress.am/en/article/1197946"
	],
	[
		"2024-08-18",
		"Reports that the German government has allegedly stopped military assistance to Ukraine are incorrect and manipulative. The level of support for our country for the next year will be known only after the budget is approved, which is expected in November.",
		"Повідомлення про те, що уряд Німеччини нібито припинив військову допомогу Україні, не відповідають дійсності та є маніпулятивними. Рівень підтримки нашої країни на наступний рік буде відомий лише після ухвалення бюджету, яке очікується в листопаді.",
		"https://www.ukrinform.net/rubric-polytics/3896141-reports-of-germanys-alleged-suspension-of-military-assistance-to-ukraine-are-manipulative-mfa.html"
	],
	[
		"2024-08-16",
		"The Swedish Defence Materiel Administration is studying the possibility of sending military advisers to Ukraine in order to deepen cooperation with the Armed Forces of Ukraine.",
		"Шведська адміністрація оборонної техніки вивчає можливість направлення військових радників в Україну з метою поглиблення співпраці зі Збройними силами України.",
		"https://mil.in.ua/en/news/sweden-is-studying-the-possibility-of-sending-military-advisers-to-ukraine/"
	],
	[
		"2024-08-16",
		"Ukraine can use Canadian tanks and missiles in its ongoing special military operation on Russia soil, Ottawa said.",
		"Україна може використовувати канадські танки і ракети у своїй триваючій спеціальній військовій операції на території Росії, заявила Оттава.",
		"https://www.politico.eu/article/ukraine-fire-weapons-attack-inside-russia-canada/"
	],
	[
		"2024-08-16",
		"Lithuania has handed over a new military aid package to Ukraine, which includes wheel loaders, trailers and folding beds.",
		"Литва передала Україні новий пакет військової допомоги, який включає колісні навантажувачі, причепи та розкладні ліжка.",
		"https://mil.in.ua/en/news/lithuania-donates-loaders-and-trailers-to-ukrainian-army/"
	],
	[
		"2024-08-15",
		"The Biden administration is “open” to sending long-range cruise missiles to Ukraine",
		"Адміністрація Байдена «відкрита» для відправки крилатих ракет великої дальності в Україну",
		"https://www.politico.com/news/2024/08/15/biden-missiles-ukraine-russia-00174147"
	],
	[
		"2024-08-15",
		"Germany plans to deliver two short-range and two medium-range Iris-T air defense systems, 30 Leopard 1A5 tanks, 400 MRAP-type armored vehicles, 16 self-propelled artillery units of two types, and other weaponry to Ukraine by December 2024.",
		"До грудня 2024 року Німеччина планує поставити Україні два зенітно-ракетні комплекси ближнього і два середнього радіусу дії Iris-T, 30 танків Leopard 1A5, 400 бронетранспортерів типу MRAP, 16 самохідних артилерійських установок двох типів та інше озброєння.",
		"https://youtu.be/xP3QTufqxzo?si=xLsQdMamd21ysv6w"
	],
	[
		"2024-08-11",
		"The European Union has stated that Ukraine's recent incursion into Russia's Kursk region is considered a \"legitimate military action of self-defense.\" A spokesperson for Josep Borrell, the EU's foreign policy and security chief, emphasized that Ukraine has the right to defend itself, including striking enemy forces within Russian territory.",
		"Європейський Союз заявив, що нещодавнє вторгнення України в Курську область Росії вважається \"законною військовою акцією самооборони\". Речник Жозепа Борреля, керівника зовнішньої політики і безпеки ЄС, підкреслив, що Україна має право захищати себе, в тому числі завдаючи ударів по ворожих силах на території Росії.",
		"https://www.novinite.com/articles/227626/EU+Backs+Ukraine%E2%80%99s+Strikes+in+Russia+as+%27Self-Defense%27"
	],
	[
		"2024-08-09",
		"The Department of Defense (DoD) announced additional security assistance for Ukraine. This is the sixty-third tranche of equipment to be provided from DoD inventories for Ukraine since August 2021. The package, which has an estimated value of $125 million, includes:  air defense capabilities; multi-mission radars to detect and counter enemy artillery; and anti-tank weapons.",
		"Міністерство оборони США оголосило про надання Україні додаткової безпекової допомоги. Це вже шістдесят третій транш обладнання, яке буде надано Україні з запасів Міністерства оборони США з серпня 2021 року. Пакет, орієнтовна вартість якого становить 125 мільйонів доларів, включає: засоби протиповітряної оборони; багатофункціональні радари для виявлення та протидії ворожій артилерії; протитанкове озброєння.",
		"https://www.defense.gov/News/Releases/Release/Article/3868082/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2024-08-09",
		"In August, Lithuania will hand over combat machinery, counter-drone systems, transport and logistical means and part of the older armaments to Ukraine.",
		"У серпні Литва передасть Україні бойову техніку, системи протидії безпілотникам, транспортні та логістичні засоби, а також частину старого озброєння.",
		"https://kam.lt/lietuva-ukrainai-perduos-solidu-paramos-paketa/"
	],
	[
		"2024-08-07",
		"The Bulgarian government has allowed the Bulgarian military to train Ukrainian soldiers on the territory of NATO member states.",
		"Уряд Болгарії дозволив болгарським військовим тренувати українських солдатів на території країн-членів НАТО.",
		"https://bnr.bg/en/post/102030300/bulgarian-military-to-train-ukrainian-soldiers"
	],
	[
		"2024-08-04",
		"Ukraine has received its first batch of F-16 fighter jets as part of international support to bolster its defense capabilities.",
		"Україна отримала першу партію винищувачів F-16 в рамках міжнародної підтримки для зміцнення своєї обороноздатності.",
		"https://defence-blog.com/first-batch-of-f-16-fighter-jets-arrives-in-ukraine/"
	],
	[
		"2024-08-02",
		"Ukrainian soldiers of the 82nd Air Assault Brigade have received Cougar MRAP (Mine-Resistant Ambush Protected) armored vehicles.",
		"Українські бійці 82-ї десантно-штурмової бригади отримали броньовані автомобілі Cougar MRAP.",
		"https://euromaidanpress.com/2024/08/02/ukrainian-defenders-receive-american-made-cougar-mrap-armored-vehicles/"
	],
	[
		"2024-08-02",
		"Defense Secretary Lloyd Austin said Tuesday that the U.S. will soon announce an additional $2.3 billion in security assistance for Ukraine, to include anti-tank weapons, interceptors and munitions for Patriot and other air defense systems.",
		"Міністр оборони США Ллойд Остін заявив у вівторок, що США незабаром оголосять про надання Україні додаткової допомоги у сфері безпеки на суму 2,3 мільярда доларів, яка включатиме протитанкову зброю, перехоплювачі та боєприпаси для систем ППО Patriot та інших систем протиповітряної оборони.",
		"https://ca.news.yahoo.com/defense-secretary-austin-says-us-144048726.html"
	],
	[
		"2024-08-02",
		"Almost 100 days have now passed since the Congress passed $61 billion in emergency funding for Ukraine, a measure that included a condition that required the Biden Administration to present to the legislative body a detailed strategy for continued U.S. support. It is now August and there is still no sign on the part of the Biden Administration of any intention to submit such a strategy to Congress. ",
		"Минуло майже 100 днів відтоді, як Конгрес ухвалив рішення про виділення Україні 61 мільярда доларів у рамках надзвичайного фінансування, яке включало умову, що вимагала від адміністрації Байдена представити законодавчому органу детальну стратегію подальшої підтримки з боку Сполучених Штатів. Зараз серпень, а з боку адміністрації Байдена досі немає жодних ознак того, що вона має намір представити таку стратегію на розгляд Конгресу. ",
		"https://responsiblestatecraft.org/biden-ukraine-strategy/"
	],
	[
		"2024-08-01",
		"The Department of Defense (DoD) announced that more weapons have been approved to send to Ukrainian defense forces, authorizing two packages worth a total of $1.7 billion. An additional $200 million from the Presidential Drawdown Authority (PDA) and $1.5 billion from the Ukraine Security Assistance Initiative (USAI) will contribute air missile systems, munitions, electronic warfare equipment, and explosives and munitions to continue Ukraine’s defense against Russia.",
		"Міністерство оборони (МО) США оголосило, що було схвалено надання додаткового озброєння українським силам оборони, затвердивши два пакети на загальну суму 1,7 мільярда доларів. Додаткові 200 мільйонів доларів від Президентського органу з питань скорочення озброєнь (PDA) та 1,5 мільярда доларів від Ініціативи сприяння безпеці України (USAI) будуть спрямовані на постачання зенітних ракетних систем, боєприпасів, засобів радіоелектронної боротьби, а також вибухових речовин та боєприпасів для продовження оборони України від Росії.",
		"https://www.presidentialprayerteam.org/2024/08/01/defense-department-announces-20th-drawdown-for-ukraine-aid/"
	]
]