[
	[
		"2024-11-17",
		"Estonia's cabinet approved a proposal to deliver another package of military aid for Ukraine. The latest aid package will include an unspecified amount of munitions and military equipment, including naval uniforms, observation equipment, sights, and protective equipment. It was not immediately clear as to when the package is expected to arrive in Ukraine.",
		"Уряд Естонії схвалив пропозицію про надання чергового пакету військової допомоги Україні. Останній пакет допомоги включатиме невизначену кількість боєприпасів і військового обладнання, в тому числі військово-морську форму, прилади спостереження, приціли і захисне спорядження. Не відразу було зрозуміло, коли очікується прибуття цієї допомоги в Україну.",
		"https://www.msn.com/en-us/news/world/estonia-approves-delivery-of-additional-military-aid-package-for-ukraine/ar-AA1udJO7"
	],
	[
		"2024-11-16",
		"A Czech company STV GROUP has handed over a symbolic cheque for RPG-7 anti-tank rocket launchers for the Ukrainian Defence Forces. The weapons cost is EUR 765,000.",
		"Чеська компанія STV GROUP передала символічний чек на протитанкові ракетні комплекси РПГ-7 для Збройних сил України. Вартість зброї становить 765 000 євро.",
		"https://t.me/Ukraine_MFA/4184"
	],
	[
		"2024-11-16",
		"President Volodymyr Zelenskyy has stated that Ukraine has not received even half of the weapons officially allocated by the United States and that Europe has helped Ukraine just as much as the US.",
		"Президент Володимир Зеленський заявив, що Україна не отримала навіть половини зброї, офіційно виділеної Сполученими Штатами, і що Європа допомогла Україні не менше, ніж США.",
		"https://www.yahoo.com/news/ukraine-not-received-half-us-084014198.html"
	],
	[
		"2024-11-14",
		"Deputy Pentagon press secretary Sabrina Singh neither confirmed nor denied that Ukraine will receive all $7 bln. weapons till the end of the year, as President Biden has promised.",
		"Заступник прес-секретаря Пентагону Сабріна Сінгх не підтвердила, але й не спростувала, що Україна отримає всі $7 млрд зброї до кінця року, як обіцяв президент Байден.",
		"https://www.defense.gov/News/Transcripts/Transcript/Article/3965597/deputy-pentagon-press-secretary-sabrina-singh-holds-a-press-briefing/"
	],
	[
		"2024-11-10",
		"Biden's administration has allowed defense contractors to work within Ukraine to assist with the maintenance and repair of military equipment like F-16 fighter jets and Patriot air defense systems. ",
		"Адміністрація Байдена дозволила оборонним підрядникам працювати в Україні для надання допомоги в обслуговуванні та ремонті військової техніки, такої як винищувачі F-16 та системи протиповітряної оборони Patriot. ",
		"https://www3.nhk.or.jp/nhkworld/en/news/20241109_12/"
	],
	[
		"2024-11-09",
		"In response to stepped-up Russian drone and missile attacks, the Pentagon is sending to Ukraine more than 500 interceptors for the Patriot missile defense system and the National Advanced Surface-to-Air Missile System, or NASAMS, which are expected to arrive in the weeks ahead, according to a senior administration official.",
		"У відповідь на посилення російських безпілотних і ракетних атак Пентагон відправляє в Україну понад 500 перехоплювачів для системи протиракетної оборони «Патріот» і Національної вдосконаленої протиракетної системи «земля-повітря» (NASAMS), які, як очікується, прибудуть в найближчі тижні, за словами високопоставленого представника адміністрації.",
		"https://www.wsj.com/politics/national-security/u-s-struggles-to-rush-weapons-to-ukraine-before-trump-takes-office-dfabb1fd"
	],
	[
		"2024-11-08",
		"The Biden administration has confirmed that the US will keep surging aid to Ukraine before Donald Trump becomes president in January.",
		"Адміністрація Байдена підтвердила, що США продовжуватимуть збільшувати допомогу Україні до того, як Дональд Трамп стане президентом у січні.",
		"https://www.theguardian.com/world/2024/nov/08/ukraine-war-briefing-biden-administration-confirms-surge-of-military-aid-to-kyiv-will-continue"
	],
	[
		"2024-11-08",
		"Germany will be able to provide most of the €4 billion promised to Ukraine for military support, even if the 2025 budget is not approved in time after the collapse of the coalition government.",
		"Німеччина зможе надати більшу частину з обіцяних Україні 4 мільярдів євро на військову підтримку, навіть якщо бюджет на 2025 рік не буде вчасно затверджений після розпаду коаліційного уряду.",
		"https://mil.in.ua/en/news/reuters-germany-to-provide-promised-aid-to-ukraine-in-2025-despite-coalition-collapse/"
	],
	[
		"2024-11-07",
		"The leader of the Free Democratic Party (FDP), Christian Lindner, has accused German Chancellor Olaf Scholz of obstructing effective military support for Ukraine.",
		"Лідер Вільної демократичної партії (ВДП) Крістіан Лінднер звинуватив канцлера Німеччини Олафа Шольца у перешкоджанні ефективній військовій підтримці України.",
		"https://defence-blog.com/fdps-lindner-scholz-denied-crucial-ukraine-military-support/"
	],
	[
		"2024-11-05",
		"Australia will donate 14 rigid hull boats to Ukraine to strengthen its maritime and coastal defense.",
		"Австралія передасть Україні 14 катерів з жорстким корпусом для посилення морської та берегової оборони.Carnation",
		"https://mil.in.ua/en/news/australia-to-transfer-14-boats-to-ukraine/"
	],
	[
		"2024-11-03",
		"The price of a Russian victory will be times higher for Germany than helping Ukraine win over Russia in the ongoing war. This was assessed by economists from the Kiel Institute of World Economy (IfW Kiel).",
		"Ціна перемоги Росії буде в рази вищою для Німеччини, ніж допомога Україні у перемозі над Росією у війні, що триває. Таку оцінку дали економісти з Кільського інституту світової економіки (IfW Kiel).",
		"https://www.ukrinform.net/rubric-economy/3922836-russian-victory-would-cost-germany-10-to-20-times-more-than-aid-to-ukraine-german-experts.html"
	],
	[
		"2024-11-03",
		"Canada provided 13 off-road vehicles with demining equipment to the Ukrainian National Special Transport Service.",
		"Канада надала 13 позашляховиків з обладнанням для розмінування Державній спеціальній службі транспорту України.",
		"https://rubryka.com/en/2024/10/31/rishennya-dlya-peremogy-kanady-nadala-ukrayini-partiyu-pikapiv-z-obladnannyam-dlya-rozminuvannya/"
	],
	[
		"2024-11-02",
		"Polish Prime Minister Donald Tusk’s government is proposing to provide military aid to Ukraine on credit.",
		"Уряд прем'єр-міністра Польщі Дональда Туска пропонує надати військову допомогу Україні в кредит.",
		"https://english.nv.ua/nation/poland-considers-offering-defense-aid-to-ukraine-on-credit-says-fm-sikorski-50463371.html"
	],
	[
		"2024-11-01",
		"The Department of Defense announced additional security assistance for Ukraine. This is the sixty-ninth tranche of equipment to be provided from DoD inventories since August 2021. This Presidential Drawdown Authority package, which has an estimated value of $425 million includes air defense interceptors; munitions for rocket systems and artillery; armored vehicles; and anti-tank weapons.",
		"Міністерство оборони США оголосило про надання Україні додаткової безпекової допомоги. Це вже шістдесят дев'ятий транш обладнання, яке буде надано зі складів Міністерства оборони з серпня 2021 року. Цей пакет допомоги за президентським указом про скорочення озброєнь орієнтовною вартістю 425 мільйонів доларів включає перехоплювачі протиповітряної оборони, боєприпаси для ракетних систем та артилерії, бронетехніку та протитанкове озброєння.",
		"https://www.defense.gov/News/Releases/Release/Article/3954004/biden-administration-announces-additional-security-assistance-for-ukraine/"
	],
	[
		"2024-11-01",
		"Australia donated several Joint Direct Attack Munition Extended-Range (JDAM-ER) glide bombs to Ukraine following their withdrawal from Royal Australian Air Force (RAAF) service.",
		"Австралія передала Україні кілька планерних бомб JDAM-ER (Joint Direct Attack Munition Extended-Range) після зняття їх з озброєння Королівських ВПС Австралії (RAAF).",
		"https://www.australiandefence.com.au/news/news/australian-jdam-ers-sent-to-ukraine"
	],
	[
		"2024-11-01",
		"Canada’s FM Mélanie Joly stated that Canada supports Ukraine’s long-range strikes within Russia and advocates lifting restrictions on Western weapon use for such operations.",
		"Міністр закордонних справ Канади Мелані Джолі заявила, що Канада підтримує українські дальні удари по Росії і виступає за зняття обмежень на використання західних озброєнь для таких операцій.",
		"https://euromaidanpress.com/2024/11/01/canada-pushes-allies-to-approve-ukraines-long-range-strikes-on-russia-with-western-weapons/"
	],
	[
		"2024-10-31",
		"Lithuania has announced a new military aid package for Ukraine, which includes power generators, mortar bombs and ammunition.",
		"Литва оголосила про новий пакет військової допомоги Україні, який включає електрогенератори, мінометні міни та боєприпаси.",
		"https://www.pravda.com.ua/eng/news/2024/10/31/7482247/"
	],
	[
		"2024-10-31",
		"Norway is preparing a new aid package for Ukraine worth €500 million. It will include F-16 fighter jets and NASAMS air defense systems",
		"Норвегія готує новий пакет допомоги Україні на суму 500 мільйонів євро. Він включатиме винищувачі F-16 та системи протиповітряної оборони NASAMS",
		"https://newsukraine.rbc.ua/news/not-only-f-16s-norway-to-deliver-nasams-air-1730375724.html"
	],
	[
		"2024-10-31",
		"South Korea’s military aid to Ukraine will depend on the level of cooperation between North Korea and Russia.",
		"Військова допомога Південної Кореї Україні залежатиме від рівня співпраці між Північною Кореєю та Росією.",
		"https://english.nv.ua/nation/south-korean-aid-to-ukraine-will-be-proportional-to-moscow-s-reliance-on-pyongyang-50462987.html"
	],
	[
		"2024-10-31",
		"The U.K. will allocate three billion pounds ($3.8 billion) per year to military support for Ukraine, according to the draft budget submitted to the parliament on Oct. 30.",
		"Великобританія виділятиме три мільярди фунтів стерлінгів (3,8 мільярда доларів) на рік на військову підтримку України, згідно з проектом бюджету, поданим до парламенту 30 жовтня.",
		"https://www.msn.com/en-us/news/world/uk-promises-3-8-billion-per-year-in-military-aid-to-ukraine/ar-AA1te4j7?apiversion=v2&noservercache=1&domshim=1&renderwebcomponents=1&wcseo=1&batchservertelemetry=1&noservertelemetry=1"
	],
	[
		"2024-10-31",
		"Prime Minister of Canada calls for doubling down efforts to support Ukraine.",
		"Прем'єр-міністр Канади закликав подвоїти зусилля на підтримку України.",
		"https://mil.in.ua/en/news/prime-minister-of-canada-calls-for-doubling-down-efforts-to-support-ukraine/"
	],
	[
		"2024-10-30",
		"The Swedish government will provide Ukraine with €63M in financial support. €20M will go to supporting Ukraine’s defense industry, within the Danish model’s framework, which is aimed at supporting procurement through Ukrainian industry. Sweden will also allocate about €43M to several existing multilateral initiatives to provide quick and effective support to the Armed Forces.",
		"Уряд Швеції надасть Україні 63 млн євро фінансової підтримки. 20 млн євро підуть на підтримку української оборонної промисловості в рамках данської моделі, яка спрямована на підтримку закупівель через українську промисловість. Швеція також виділить близько 43 млн євро на кілька існуючих багатосторонніх ініціатив для надання швидкої та ефективної підтримки Збройним Силам.",
		"https://ubn.news/sweden-will-allocate-a-e63m-military-aid-package-to-ukraine-including-defense-industry-investment/"
	],
	[
		"2024-10-28",
		"The Japanese government has allocated JPY 471.9 billion ($3.08 billion) as part of a $50 billion loan from the G7 countries to support Ukraine.",
		"Уряд Японії виділив 471,9 млрд ієн ($3,08 млрд) як частину кредиту в розмірі $50 млрд, наданого країнами G7 на підтримку України.",
		"https://mil.in.ua/en/news/japan-allocates-3-billion-to-ukraine-as-part-of-g7-s-loan/"
	],
	[
		"2024-10-27",
		"The European Union has found a plan to provide money to Ukraine for military aid and to override Hungary's veto.",
		"Європейський Союз знайшов план, як надати Україні гроші на військову допомогу та подолати вето Угорщини.",
		"https://gagadget.com/en/522519-the-eu-has-found-a-way-to-override-hungarys-veto-on-military-aid-to-ukraine/"
	],
	[
		"2024-10-26",
		"Canada has sent ACSV medical armored vehicles to Ukraine.",
		"Канада передала Україні медичні броньовані автомобілі ACSV.",
		"https://x.com/CAFwithUkraine/status/1850160458453688436"
	],
	[
		"2024-10-24",
		"Ukraine's Defence Ministry and the US Department of Defense Office of Inspector General have investigated the process of accounting for and using American spare parts ordered and supplied to the Armed Forces of Ukraine as international military assistance. The ministry noted that the audit did not reveal significant discrepancies but identified a gap in the regulatory framework. This gap complicates the management of spare parts from damaged military equipment provided to Ukraine as international military assistance by the US.",
		"Міністерство оборони України та Офіс генерального інспектора Міністерства оборони США перевірили процес обліку та використання американських запчастин, замовлених та поставлених Збройним силам України в рамках міжнародної військової допомоги. У міністерстві зазначили, що аудит не виявив суттєвих розбіжностей, але виявив прогалину в нормативно-правовій базі. Ця прогалина ускладнює управління запасними частинами від пошкодженої військової техніки, наданої Україні як міжнародна військова допомога з боку США.",
		"https://www.msn.com/en-us/news/world/audit-of-us-military-aid-usage-reveals-no-significant-violations-ukraines-defence-ministry-reports/ar-AA1sQfZe"
	],
	[
		"2024-10-21",
		"The Department of Defense (DoD) announced additional security assistance for Ukraine. This announcement is the Biden Administration's sixty-eighth tranche of equipment to be provided from DoD inventories for Ukraine since August 2021. This Presidential Drawdown Authority (PDA) package, which has an estimated value of $400 million, will provide Ukraine additional capabilities to meet its most urgent needs, including: munitions for rocket systems and artillery; mortar systems and rounds; armored vehicles; and anti-tank weapons.",
		"Міністерство оборони США оголосило про надання Україні додаткової безпекової допомоги. Це оголошення є шістдесят восьмим траншем обладнання, яке Адміністрація Байдена надасть Україні з запасів Міністерства оборони, починаючи з серпня 2021 року. Цей пакет допомоги за президентським рішенням про скорочення озброєнь (PDA), орієнтовна вартість якого становить 400 мільйонів доларів США, надасть Україні додаткові можливості для задоволення її найнагальніших потреб, зокрема: боєприпаси для ракетних систем та артилерії; мінометні системи та боєприпаси; бронемашини; протитанкові засоби.",
		"https://www.defense.gov/News/Releases/Release/Article/3940873/biden-administration-announces-additional-security-assistance-for-ukraine/"
	]
]