[
	[
		"2024-04-28",
		"A former us Lt and military expert has warned that Russia will “win” the war and it is “almost impossible for Ukraine to win.”",
		"Колишній американський лейтенант і військовий експерт попередив, що Росія \"виграє\" війну, а Україні \"майже неможливо перемогти\".",
		"https://londonlovesbusiness.com/us-military-expert-warns-its-almost-impossible-for-ukraine-to-win/"
	],
	[
		"2024-04-28",
		"Australia backs Ukraine with $100-mln military aid",
		"Австралія підтримала Україну військовою допомогою на $100 млн",
		"https://www.yahoo.com/news/australia-backs-ukraine-100-mln-071957070.html"
	],
	[
		"2024-04-28",
		"Estonian Center for Defense Investments (RKIK) and the eState Academy will use European Peace Facility resources to procure various nonlethal military equipment for Moldovan armed forces. A contract for passive radars has been signed with a Czech company.",
		"Естонський центр оборонних інвестицій (RKIK) та Академія електронної держави використовуватимуть ресурси Європейського фонду миру для закупівлі різного нелетального військового обладнання для збройних сил Молдови. З чеською компанією було підписано контракт на поставку пасивних радарів.",
		"https://news.err.ee/1609326753/estonia-to-procure-military-equipment-for-moldova-and-ukraine"
	],
	[
		"2024-04-27",
		"The US will \"rush\" Patriot air defense missiles to Ukraine as part of a military aid package, Defense Secretary Lloyd Austin has said.",
		"США \"поспішатимуть\" з ракетами ППО Patriot в Україну в рамках пакету військової допомоги, заявив міністр оборони Ллойд Остін.",
		"https://www.businessinsider.com/us-to-rush-patriot-missiles-to-ukraine-amid-russian-airstrikes-2024-4"
	],
	[
		"2024-04-27",
		"British and American defence pledges for Ukraine should inspire other countries to follow suit, Kaja Kallas, the prime minister of Estonia, has said.",
		"Обіцянки Великої Британії та США щодо підтримки України повинні надихнути інші країни наслідувати їхній приклад, заявила Кая Каллас, прем'єр-міністр Естонії.",
		"https://www.telegraph.co.uk/world-news/2024/04/27/uk-and-us-ukraine-aid-must-inspire-others-says-kaja-kallas/"
	],
	[
		"2024-04-26",
		"The Department of Defense (DoD) announced a historic new security assistance package valued at $6 bln. to address Ukraine's ongoing battlefield needs and demonstrate unwavering U.S. support for Ukraine. This package, provided through the Ukraine Security Assistance Initiative (USAI) includes additional munitions for Patriot air defense systems; additional munitions for National Advanced Surface-to-Air Missile Systems (NASAMS); equipment to integrate Western air defense launchers, missiles, and radars with Ukraine's air defense systems; counter-UAS equipment and systems; munitions for laser-guided rocket systems; multi-mission radars; counter-artillery radars; additional ammunition for High Mobility Artillery Rocket Systems (HIMARS); 155mm and 152mm artillery rounds; precision aerial munitions; Switchblade and Puma Unmanned Aerial Systems (UAS); tactical vehicles to tow weapons and equipment; demolition munitions; components to support Ukrainian production of UAS and other capabilities; small arms and additional small arms ammunition and ancillary items and support for training, maintenance, and sustainment activities.",
		"Міністерство оборони (МО) США оголосило про надання нового історичного пакету допомоги у сфері безпеки на суму 6 млрд. доларів для задоволення поточних потреб України на полі бою та демонстрації непохитної підтримки України з боку США. Цей пакет, що надається в рамках Ініціативи безпекової допомоги Україні (USAI), включає додаткові боєприпаси для систем ППО Patriot; додаткові боєприпаси для національних передових зенітно-ракетних комплексів (NASAMS); обладнання для інтеграції західних пускових установок, ракет і радарів з українськими системами ППО; обладнання та системи протидії БПЛА; боєприпаси для ракетних систем з лазерним наведенням; багатоцільові радіолокаційні станції; контр-артилерійські радіолокаційні станції; додаткові боєприпаси для високомобільних артилерійських ракетних систем (HIMARS); артилерійські снаряди калібру 155 мм і 152 мм; високоточні авіаційні боєприпаси; безпілотні авіаційні комплекси (БАК) Switchblade і Puma; тактичні транспортні засоби для буксирування озброєння і техніки; боєприпаси для підриву; компоненти для підтримки українського виробництва БАК та інших засобів; стрілецька зброя і додаткові боєприпаси до стрілецької зброї, а також допоміжні засоби, підтримка для тренувань, технічного обслуговування і забезпечення діяльності.",
		"https://www.defense.gov/News/Releases/Release/Article/3757794/biden-administration-announces-historic-new-security-assistance-package-for-ukr/"
	],
	[
		"2024-04-25",
		"Poland has provided Ukraine military support worth the equivalent of around €8.4 billion ($9 billion) over the past two years, the government said on Thursday. A total of 44 armaments packages have been handed over to Kiev, said Foreign Minister Radosław Sikorski during a keynote speech in the Polish parliament. Poland has provided Ukraine with 300 tanks and combat vehicles, 14 fighter planes, plus helicopters, air defence systems and ammunition, military experts say.",
		"За останні два роки Польща надала Україні військову допомогу на суму, еквівалентну приблизно 8,4 млрд євро (9 млрд доларів), заявив у четвер уряд країни. Загалом Києву було передано 44 пакети озброєнь, заявив міністр закордонних справ Радослав Сікорський під час програмної промови в польському парламенті. Польща надала Україні 300 танків і бойових машин, 14 винищувачів, а також вертольоти, системи протиповітряної оборони і боєприпаси, кажуть військові експерти.",
		"https://www.yahoo.com/news/polands-total-military-aid-ukraine-111427588.html"
	],
	[
		"2024-04-24",
		"The Department of Defense (DoD) announced a significant new security assistance to urgently meet Ukraine's critical security and defense needs. This announcement is the Biden Administration's fifty-sixth tranche of equipment to be provided from DoD inventories to Ukraine since August 2021. This Presidential Drawdown Authority (PDA) package has an estimated value of $1 billion and includes air defense interceptors, artillery rounds, armored vehicles, and anti-tank weapons. ",
		"Міністерство оборони (МО) США оголосило про нову значну допомогу у сфері безпеки для термінового задоволення критично важливих потреб України у сфері безпеки та оборони. Це оголошення є п'ятдесят шостим траншем обладнання, яке адміністрація Байдена надасть Україні з запасів Міністерства оборони, починаючи з серпня 2021 року. Цей пакет, наданий в рамках президентського рішення про скорочення озброєнь (PDA), оцінюється в 1 мільярд доларів і включає перехоплювачі протиповітряної оборони, артилерійські снаряди, бронемашини та протитанкову зброю.",
		"https://www.defense.gov/News/Releases/Release/Article/3754238/biden-administration-announces-significant-new-security-assistance-for-ukraine/"
	],
	[
		"2024-04-24",
		"The German chancellor says Europe must continue to step up its help for Ukraine even after the approval of a big U.S. aid package.",
		"Канцлер Німеччини заявила, що Європа повинна продовжувати нарощувати допомогу Україні навіть після схвалення великого пакету допомоги від США.",
		"https://abcnews.go.com/International/wireStory/german-leader-europe-increasing-aid-ukraine-after-us-109574795"
	],
	[
		"2024-04-24",
		"Defense minister of Spain Margarita Robles has participated in Ukraine Defence Contact Group meeting, where she announced that the shipment the day before yesterday has a set of hospital medicines and individual combat first aid kits. He also reported the delivery, a new consignment of heavy caliber artillery ammunition, followed by other shipments of 155 and 120 mm ammunition the next months. The minister has especially stopped at the Spanish contribution to anti-aircraft defense, announcing the dispatch of a long-range Patriot anti-aircraft interceptor missile set that will arrive at the logistics base within four days. In addition, the Spanish aid planned for the next two months includes light and heavy machine guns, wheeled protected logistics vehicles, infantry armored vehicles, tank weapons and field artillery shells. These shipments will be followed by the supply of various anti-aircraft surveillance systems and remote weapons stations for drone defense, systems that are being prepared by the Spanish defense industry.",
		"Міністр оборони Іспанії Маргарита Роблес взяла участь у засіданні Контактної групи з питань оборони України, де повідомила, що позавчорашня партія вантажу містила набір лікарняних медикаментів та індивідуальні бойові аптечки першої допомоги. Він також повідомив про доставку нової партії артилерійських боєприпасів великого калібру, за якою в найближчі місяці очікуються інші поставки боєприпасів калібру 155 та 120 мм. Міністр особливо зупинився на іспанському внеску в протиповітряну оборону, оголосивши про відправку комплексу зенітних ракет-перехоплювачів \"Патріот\" великої дальності, який прибуде на базу матеріально-технічного забезпечення протягом чотирьох днів. Крім того, іспанська допомога, запланована на наступні два місяці, включає легкі і важкі кулемети, колісні захищені транспортні засоби матеріально-технічного забезпечення, піхотні броньовані машини, танкове озброєння і снаряди для польової артилерії. За цими поставками послідує постачання різних систем протиповітряного спостереження і дистанційних станцій озброєння для захисту від безпілотників - систем, які готуються іспанською оборонною промисловістю.",
		"https://www.defensa.gob.es/gabinete/notasPrensa/2024/04/DGC-240426-reunion-grupo-contacto-ucrania.html"
	],
	[
		"2024-04-23",
		"The UK will provide an additional £500m to Kyiv on top of the £2.5bn allocated for this financial year.",
		"Великобританія надасть Києву додаткові 500 млн фунтів стерлінгів до 2,5 млрд фунтів стерлінгів, виділених на цей фінансовий рік.",
		"https://www.bbc.com/news/uk-politics-68878627"
	],
	[
		"2024-04-20",
		"The House is preparing in a rare Saturday session to approve $95 billion in foreign aid for Ukraine, Israel and other U.S. allies",
		"Палата представників готується на рідкісній суботній сесії затвердити $95 млрд зовнішньої допомоги для України, Ізраїлю та інших союзників США",
		"https://abcnews.go.com/US/wireStory/house-brink-approving-ukraine-israel-aid-after-months-109451608"
	],
	[
		"2024-04-20",
		"The House has passed a $95 billion package providing foreign aid for Ukraine, Israel and the Indo-Pacific region.",
		"Палата представників ухвалила пакет на 95 мільярдів доларів, що передбачає надання зовнішньої допомоги Україні, Ізраїлю та Індо-Тихоокеанському регіону.",
		"https://edition.cnn.com/videos/politics/2024/04/20/ukraine-aid-vote-passes-house-digvid.cnn"
	],
	[
		"2024-04-19",
		"Nato will give Ukraine more advanced air defences after urgent Kyiv pleas and deadly Russian attacks, military bloc head Jens Stoltenberg has said.",
		"НАТО надасть Україні більш сучасні засоби протиповітряної оборони після наполегливих прохань Києва та смертоносних російських атак, заявив глава військового блоку Єнс Столтенберг.",
		"https://www.bbc.com/news/world-europe-68857046"
	],
	[
		"2024-04-19",
		"The Netherlands is contributing more than €200 million to new initiatives for the rapid delivery of additional air defense and artillery ammunition for Ukraine. ",
		"Нідерланди виділяють понад 200 мільйонів євро на нові ініціативи для швидкої доставки додаткових засобів протиповітряної оборони та артилерійських боєприпасів для України. ",
		"https://www.defensie.nl/actueel/nieuws/2024/04/19/ollongren-per-direct-ruim-%E2%82%AC200-miljoen-extra-voor-acute-steun-aan-oekraine"
	],
	[
		"2024-04-19",
		"The White House expects that the supply of American military aid will start \"right away\" after the supplementary funding is adopted by the US Congress.",
		"Білий дім очікує, що постачання американської військової допомоги розпочнеться \"одразу\" після ухвалення додаткового фінансування Конгресом США.",
		"https://www.pravda.com.ua/eng/news/2024/04/19/7452071/"
	],
	[
		"2024-04-19",
		"On Friday, Minister of National Defense Laurynas Kasčiūnas participated remotely in the urgently convened meeting of the NATO-Ukraine Council. \"We are currently reviewing our priorities to contribute aerospace radar systems as soon as possible. Last week I visited Ukraine and I was convinced that the need for air defense systems and ammunition is extremely high,\" said L. Kasčiūnas at the meeting of the NATO-Ukraine Council.",
		"У п'ятницю міністр національної оборони Литви Лаурінас Кащюнас дистанційно взяв участь у терміново скликаному засіданні Ради Україна-НАТО. \"Зараз ми переглядаємо наші пріоритети, щоб якомога швидше надати аерокосмічні радарні системи. Минулого тижня я відвідав Україну і переконався, що потреба в системах протиповітряної оборони та боєприпасах є надзвичайно високою\", - сказав Л. Кащюнас на засіданні Ради Україна-НАТО.",
		"https://kam.lt/ministras-l-kasciunas-lietuva-svarsto-galimybe-prisideti-prie-vokietijos-oro-gynybos-koalicijos-oro-stebejimo-radarais/"
	],
	[
		"2024-04-19",
		"The Pentagon is preparing to quickly approve a weapons package for Ukraine that includes urgently needed artillery and air defenses as Congress lines up votes to pass additional funding for the country, according to two U.S. officials.",
		"Пентагон готується швидко схвалити пакет озброєнь для України, який включає в себе вкрай необхідну артилерію і засоби протиповітряної оборони, в той час як Конгрес збирає голоси для прийняття додаткового фінансування для країни, за словами двох американських чиновників.",
		"https://www.politico.com/news/2024/04/19/pentagon-prepares-package-of-artillery-air-defenses-for-ukraine-as-house-sets-to-vote-00153328"
	],
	[
		"2024-04-19",
		"Activists in Slovakia who are unhappy that Robert Fico’s government has refused to send Ukraine military aid have raised almost €2 million to facilitate the supply of artillery ammunition to Kyiv.",
		"Активісти у Словаччині, незадоволені тим, що уряд Роберта Фіцо відмовився надсилати Україні військову допомогу, зібрали майже 2 мільйони євро, щоб сприяти постачанню артилерійських боєприпасів до Києва.",
		"https://www.pravda.com.ua/eng/news/2024/04/19/7452038/"
	],
	[
		"2024-04-19",
		"CIA Director William Burns has issued a stark warning, asserting that Ukraine may face defeat in its war against Russia by the end of this year if the United States does not step up its military assistance.",
		"Директор ЦРУ Вільям Бернс виступив з різким попередженням, заявивши, що Україна може зазнати поразки у війні з Росією до кінця цього року, якщо Сполучені Штати не збільшать свою військову допомогу.",
		"https://www.novinite.com/articles/225706/CIA+Director+Warns%3A+Ukraine+Could+Lose+War+Without+Increased+US+Military+Aid"
	],
	[
		"2024-04-19",
		"Two alleged spies suspected of planning to sabotage military aid intended for Ukraine have been arrested.",
		"Заарештовано двох ймовірних шпигунів, яких підозрюють у плануванні саботажу військової допомоги, призначеної для України.",
		"https://www.thesun.co.uk/news/27411782/alleged-spies-ukraine-military-aid-arrested/"
	],
	[
		"2024-04-18",
		"Vice president Mike Pence, calling on Congress to approve funding for Ukraine aid said that American troops will have no choice but to fight Russian invaders in Europe if Russian dictator Vladimir Putin defeats Ukraine.",
		"Віце-президент Майк Пенс, закликаючи Конгрес схвалити фінансування допомоги Україні, заявив, що американські війська не матимуть іншого вибору, окрім як боротися з російськими окупантами в Європі, якщо російський диктатор Володимир Путін переможе Україну.",
		"https://ca.news.yahoo.com/pence-warns-u-military-clash-104800625.html"
	],
	[
		"2024-04-18",
		"Donald Trump said that Europe should give more money to Ukraine.",
		"Дональд Трамп заявив, що Європа повинна давати більше грошей Україні.",
		"https://timesofindia.indiatimes.com/world/us/trump-says-europe-should-give-ukraine-more-aid/articleshow/109412927.cms"
	],
	[
		"2024-04-17",
		"After introducing a package of bills that includes military aid to Ukraine, Mike Johnson told reporters that enabling Ukraine to defend itself is in the best interests of America and the world. ",
		"Після представлення пакету законопроектів, що включає військову допомогу Україні, Майк Джонсон заявив журналістам, що надання Україні можливості захистити себе - в інтересах Америки і всього світу. ",
		"https://www.c-span.org/video/?535006-1/speaker-mike-johnson-holds-news-conference"
	],
	[
		"2024-04-17",
		"In a new budget unveiled, Canada earmarks funds for Ukraine, aiming to ramp up military spending to 1.76% of GDP by 2030, CP24 reported. The budget allocates $1.6 billion over five years for military assistance to Ukraine.",
		"У новому бюджеті, оприлюдненому вчора, Канада виділяє кошти для України, маючи на меті збільшити військові витрати до 1,76% ВВП до 2030 року, повідомляє CP24. Бюджет виділяє $1,6 млрд на п'ять років на військову допомогу Україні.",
		"https://www.yahoo.com/news/canada-gearing-five-military-aid-161500276.html"
	],
	[
		"2024-04-16",
		"The Danish government has consulted the Foreign Policy Council on donation package XVII, which allocates 200 million DKK for investments in the Ukrainian defense industry. In addition, funds have been set aside for a significant maritime capacity, drones and the production of missile components. In total, approximately DKK 2.2 billion has been reserved.",
		"Уряд Данії провів консультації з Радою зовнішньої політики щодо пакету допомоги XVII, який виділяє 200 мільйонів данських крон на інвестиції в українську оборонну промисловість. Крім того, зарезервовані кошти на значний морський потенціал, безпілотники та виробництво ракетних компонентів. Загалом зарезервовано близько 2,2 млрд данських крон.",
		"https://www.fmn.dk/da/nyheder/2024/ny-donationspakke-med-fokus-pa-oget-forsvarsindustrielt-samarbejde-med-ukraine/"
	],
	[
		"2024-04-15",
		"In the context of military assistance to Ukraine, Bulgaria plans to deploy an air defense system on its territory. This was stated by the newly appointed acting Minister of Defense of Bulgaria Atanas Zapryanov during the second Black Sea Security Conference of the International Crimean Platform in Sofia.",
		"У рамках військової допомоги Україні Болгарія планує розмістити на своїй території систему протиповітряної оборони. Про це заявив новопризначений в.о. міністра оборони Болгарії Атанас Запрянов під час другої Чорноморської безпекової конференції Міжнародної Кримської платформи в Софії",
		"https://unn.ua/en/news/military-assistance-to-ukraine-bulgaria-plans-to-deploy-air-defense-system-on-its-territory"
	],
	[
		"2024-04-13",
		"Germany will deliver a United States-made Patriot air defence system and air defence missiles to Ukraine",
		"Німеччина передасть Україні зенітно-ракетні комплекси Patriot американського виробництва та ракети для протиповітряної оборони",
		"https://www.aljazeera.com/news/2024/4/13/germany-to-send-new-missiles-to-ukraine-as-army-struggles-on-eastern-front"
	],
	[
		"2024-04-13",
		"The US and UK announced they had restricted trade of Russian-origin metals – including aluminium, copper and nickel – on global metal exchanges and in derivatives trading. ",
		"США і Великобританія оголосили, що обмежили торгівлю металами російського походження, в тому числі алюмінієм, міддю і нікелем, на світових біржах металів і в торгівлі деривативами.",
		"https://www.euronews.com/2024/04/13/ukraine-war-uk-and-us-metal-ban-china-sells-military-parts-to-moscow-russian-influence-net"
	],
	[
		"2024-04-13",
		"Germany agreed to send a Patriot air-defense system to Ukraine, Chancellor Olaf Scholz said on Saturday, but Berlin hasn't relented on its refusal to provide Kyiv with Taurus cruise missiles.",
		"Німеччина погодилася надіслати Україні систему протиповітряної оборони Patriot, заявив у суботу канцлер Олаф Шольц, але Берлін не відступився від своєї відмови надати Києву крилаті ракети Taurus.",
		"https://www.politico.eu/article/germany-patriot-air-defense-military-ukraine/"
	],
	[
		"2024-04-12",
		"China is helping Russia ramp up its defense industrial base at such a large scale that Moscow is now undertaking its most ambitious expansion in military manufacturing since the Soviet era as it continues its war against Ukraine, according to senior Biden administration officials.",
		"За словами високопосадовців адміністрації Байдена, Китай допомагає Росії нарощувати свою оборонно-промислову базу в таких масштабах, що Москва зараз здійснює найамбітніше розширення військового виробництва з часів Радянського Союзу, продовжуючи війну проти України.",
		"https://edition.cnn.com/2024/04/12/politics/china-russia-support-weapons-manufacturing/index.html"
	],
	[
		"2024-04-12",
		"Trump suggested Republicans push for making additional U.S. military aid to Ukraine \"in the form of a loan rather than a gift.\"",
		"Трамп запропонував республіканцям наполягати на наданні додаткової військової допомоги Україні \"у формі кредиту, а не подарунка\".",
		"https://www.voanews.com/a/with-house-speaker-at-his-side-trump-suggests-ukraine-aid-should-be-loan-/7568213.html"
	],
	[
		"2024-04-12",
		"French President Emmanuel Macron has discussed with German Chancellor Olaf Scholz Europe's plans for military support to Ukraine.",
		"Президент Франції Еммануель Макрон обговорив з канцлером Німеччини Олафом Шольцем плани Європи щодо військової підтримки України.",
		"https://www.elysee.fr/emmanuel-macron/2024/04/12/entretien-en-visioconference-avec-olaf-scholz-chancelier-de-la-republique-federale-dallemagne"
	],
	[
		"2024-04-12",
		"Ukraine is only holding back a Russian breakthrough with drones paid for by volunteers, as Western arms supplies run out, one of Kyiv’s top military commanders has said.",
		"Україна стримує російський прорив лише за допомогою безпілотників, оплачуваних волонтерами, оскільки західні поставки озброєнь закінчуються, заявив один з київських воєначальників.",
		"https://www.telegraph.co.uk/world-news/2024/04/12/only-crowdfunded-drones-holding-the-russians-back-ukraine/"
	],
	[
		"2024-04-12",
		"Mark Rutte announced on his X account that 'the Netherlands will release an additional €1 billion for military support this year. This is on top of the €2 billion already agreed upon. It was also decided that we will make €3 billion available for military support for next year. We are also releasing €400 million to prop up the Ukrainian economy and for critical rehabilitation of energy infrastructure.'",
		"Марк Рютте оголосив на своєму Х-акаунті, що \"Нідерланди цього року виділять додатково 1 мільярд євро на військову підтримку. Це на додаток до вже узгоджених 2 мільярдів євро. Також було вирішено, що ми виділимо 3 мільярди євро на військову підтримку в наступному році. Ми також виділяємо 400 мільйонів євро на підтримку української економіки і на критично важливе відновлення енергетичної інфраструктури\".",
		"https://x.com/MinPres/status/1778770784653123834"
	],
	[
		"2024-04-06",
		"Lithuania continues to provide uninterrupted military support to Ukraine, with the delivery of M577 armoured personnel carriers to the Ukrainian Armed Forces on 5 April.",
		"Литва продовжує надавати безперервну військову підтримку Україні, зокрема, 5 квітня вона передала Збройним силам України бронетранспортери M577.",
		"https://kam.lt/ukrainai-perduoti-sarvuociai-m577/"
	],
	[
		"2024-04-05",
		"Ukraine’s shortage of ammunition and military equipment resulting from the US and its allies’ struggle to resupply the country’s military is having an increasingly dire effect on the battlefield, US and NATO officials are warning",
		"Дефіцит боєприпасів і військової техніки в Україні, спричинений намаганнями США і їхніх союзників поповнити запаси української армії, має дедалі страшніші наслідки на полі бою, попереджають офіційні представники США і НАТО",
		"https://edition.cnn.com/2024/04/04/politics/ukraine-munition-shortages/index.html"
	],
	[
		"2024-04-05",
		"The Finnish Ministry of Defense announced a new military support package for Ukraine worth €188 million",
		"Міністерство оборони Фінляндії оголосило про новий пакет військової підтримки Україні на суму 188 млн євро.",
		"https://www.armyrecognition.com/defense_news_april_2024_global_security_army_industry/finland_announces_new_military_aid_package_to_ukraine.html"
	],
	[
		"2024-04-04",
		"NATO is planning to massively expand its support for Ukraine. A plan by Secretary-General Jens Stoltenberg includes an additional 100 billion euros in military aid to be coordinated by the Alliance — together with weapons delivery and military training. ",
		"НАТО планує значно розширити свою підтримку України. План Генерального секретаря Єнса Столтенберга передбачає додаткові 100 мільярдів євро військової допомоги, яку координуватиме Альянс - разом з поставками зброї та військовою підготовкою.",
		"https://worldcrunch.com/focus/nato-ukraine-war"
	],
	[
		"2024-04-04",
		"Belgium's military aid to Ukraine since the start of the war has reached the €1 billion mark, according to Defence Minister Ludovine Dedonder.",
		"Військова допомога Бельгії Україні з початку війни сягнула позначки в 1 мільярд євро, повідомив міністр оборони Людовін Дедондер.",
		"https://www.brusselstimes.com/991697/belgian-aid-to-ukraine-reaches-e1-billion-milestone"
	],
	[
		"2024-04-04",
		"Latvia prepares to send €1 mln worth of drones, provides new military aid package to Ukraine.",
		"Латвія готується відправити безпілотники вартістю 1 млн євро та надає Україні новий пакет військової допомоги",
		"https://rubryka.com/en/2024/04/04/latviya-peredbachyla-novyj-paket-dopomogy-ukrayini-ta-nevdovzi-nadishle-pershu-partiyu-droniv-na-e1-mln/"
	]
]